cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>SLEEP_EN0</name>
                <addressOffset>0x000000b4</addressOffset>
                <description>enable clock in sleep mode</description>
                <resetValue>0xffffffff</resetValue>
                <fields>
                    <field>
                        <name>CLK_SYS_SIO</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SHA256</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PSM</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ROSC</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ROM</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_RESETS</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PWM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_POWMAN</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_REF_POWMAN</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PLL_USB</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PLL_SYS</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO2</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO1</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO0</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PADS</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_OTP</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_REF_OTP</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_JTAG</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_IO</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_I2C1</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_I2C0</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_HSTX</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_HSTX</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_GLITCH_DETECTOR</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_DMA</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BUSFABRIC</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BUSCTRL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BOOTRAM</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ADC</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_ADC</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ACCESSCTRL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_CLOCKS</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SLEEP_EN1</name>
                <addressOffset>0x000000b8</addressOffset>
                <description>enable clock in sleep mode</description>
                <resetValue>0x7fffffff</resetValue>
                <fields>
                    <field>
                        <name>CLK_SYS_XOSC</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_XIP</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_WATCHDOG</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_USB</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_USBCTRL</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_UART1</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_PERI_UART1</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_UART0</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_PERI_UART0</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_TRNG</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_TIMER1</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_TIMER0</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_TICKS</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_REF_TICKS</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_TBMAN</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SYSINFO</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SYSCFG</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM9</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM8</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM7</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM6</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM5</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM4</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SRAM0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SPI1</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_PERI_SPI1</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SPI0</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLK_PERI_SPI0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ENABLED0</name>
                <addressOffset>0x000000bc</addressOffset>
                <description>indicates the state of the clock enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK_SYS_SIO</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_SHA256</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PSM</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ROSC</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ROM</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_RESETS</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PWM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_POWMAN</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_REF_POWMAN</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PLL_USB</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PLL_SYS</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO2</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO1</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PIO0</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_PADS</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_OTP</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_REF_OTP</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_JTAG</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_IO</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_I2C1</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_I2C0</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_HSTX</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_HSTX</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_GLITCH_DETECTOR</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_DMA</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BUSFABRIC</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BUSCTRL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_BOOTRAM</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ADC</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_ADC</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_ACCESSCTRL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLK_SYS_CLOCKS</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
