cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TICKS</name>
        <baseAddress>0x40108000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>72</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PROC0_CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_CYCLES</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PROC0_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_COUNT</name>
                <addressOffset>0x00000008</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>PROC0_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_CTRL</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_CYCLES</name>
                <addressOffset>0x00000010</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PROC1_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_COUNT</name>
                <addressOffset>0x00000014</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>PROC1_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_CTRL</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_CYCLES</name>
                <addressOffset>0x0000001c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMER0_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_COUNT</name>
                <addressOffset>0x00000020</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>TIMER0_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_CTRL</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_CYCLES</name>
                <addressOffset>0x00000028</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMER1_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_COUNT</name>
                <addressOffset>0x0000002c</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>TIMER1_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_CTRL</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_CYCLES</name>
                <addressOffset>0x00000034</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WATCHDOG_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_COUNT</name>
                <addressOffset>0x00000038</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>WATCHDOG_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_CTRL</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_CYCLES</name>
                <addressOffset>0x00000040</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RISCV_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_COUNT</name>
                <addressOffset>0x00000044</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RISCV_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
