cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <dim>4</dim>
                <dimIncrement>8</dimIncrement>
                <name>GPIO_QSPI_SD%s_CTRL</name>
                <addressOffset>0x00000024</addressOffset>
                <resetValue>0x0000001f</resetValue>
                <fields>
                    <field>
                        <name>IRQOVER</name>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don&#39;t invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive interrupt low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive interrupt high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INOVER</name>
                        <bitRange>[17:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don&#39;t invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive peri input low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive peri input high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OEOVER</name>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output enable from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLE</name>
                                <value>2</value>
                                <description>disable output</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE</name>
                                <value>3</value>
                                <description>enable output</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUTOVER</name>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive output low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive output high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FUNCSEL</name>
                        <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>xip</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>uart</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>i2c</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>sio</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>uart_aux</name>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>null</name>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_PROC0_SECURE</name>
                <addressOffset>0x00000200</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_PROC0_NONSECURE</name>
                <addressOffset>0x00000204</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_PROC1_SECURE</name>
                <addressOffset>0x00000208</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_PROC1_NONSECURE</name>
                <addressOffset>0x0000020c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_DORMANT_WAKE_SECURE</name>
                <addressOffset>0x00000210</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQSUMMARY_DORMANT_WAKE_NONSECURE</name>
                <addressOffset>0x00000214</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_QSPI_SD3</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD2</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD1</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SD0</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SS</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO_QSPI_SCLK</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DM</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USBPHY_DP</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
