cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>PROC0_INTF2</name>
                <addressOffset>0x00000268</addressOffset>
                <description>Interrupt Force for proc0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO23_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO23_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO23_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO23_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO22_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO22_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO22_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO22_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO21_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO21_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO21_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO21_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO20_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO20_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO20_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO20_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO19_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO19_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO19_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO19_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO18_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO18_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO18_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO18_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO17_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO17_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO17_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO17_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO16_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO16_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO16_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO16_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_INTF3</name>
                <addressOffset>0x0000026c</addressOffset>
                <description>Interrupt Force for proc0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO31_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_INTF4</name>
                <addressOffset>0x00000270</addressOffset>
                <description>Interrupt Force for proc0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO39_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
