cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>DORMANT_WAKE_INTS5</name>
                <addressOffset>0x0000031c</addressOffset>
                <description>Interrupt status after masking &amp; forcing for dormant_wake</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO47_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO47_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO47_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO47_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO46_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO46_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO46_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO46_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO45_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO45_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO45_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO45_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO44_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO44_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO44_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO44_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO43_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO43_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO43_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO43_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO42_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO42_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO42_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO42_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO41_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO41_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO41_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO41_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO40_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO40_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO40_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO40_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
