cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SYSINFO</name>
        <baseAddress>0x40000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>24</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CHIP_ID</name>
                <addressOffset>0x00000000</addressOffset>
                <description>JEDEC JEP-106 compliant chip identifier.</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART</name>
                        <bitRange>[27:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MANUFACTURER</name>
                        <bitRange>[11:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STOP_BIT</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PACKAGE_SEL</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PACKAGE_SEL</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PLATFORM</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Platform register. Allows software to know what environment it is running in during pre-production development. Post-production, the PLATFORM is always ASIC, non-SIM.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GATESIM</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BATCHSIM</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HDLSIM</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ASIC</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPGA</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GITREF_RP2350</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Git hash of the chip source. Used to identify chip version.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>GITREF_RP2350</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>SHA256</name>
        <description>SHA-256 hash function implementation</description>
        <baseAddress>0x400f8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>40</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CSR</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00001206</resetValue>
                <fields>
                    <field>
                        <name>BSWAP</name>
                        <description>Enable byte swapping of 32-bit values at the point they are committed to the SHA message scheduler.

                            This block&#39;s bus interface assembles byte/halfword data into message words in little-endian order, so that DMAing the same buffer with different transfer sizes always gives the same result on a little-endian system like RP2350.

                            However, when marshalling bytes into blocks, SHA expects that the first byte is the *most significant* in each message word. To resolve this, once the bus interface has accumulated 32 bits of data (either a word write, two halfword writes in little-endian order, or four byte writes in little-endian order) the final value can be byte-swapped before passing to the actual SHA core.

                            This feature is enabled by default because using the SHA core to checksum byte buffers is expected to be more common than having preformatted SHA message words lying around.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA_SIZE</name>
                        <description>Configure DREQ logic for the correct DMA data size. Must be configured before the DMA channel is triggered.

                            The SHA-256 core&#39;s DREQ logic requests one entire block of data at once, since there is no FIFO, and data goes straight into the core&#39;s message schedule and digest hardware. Therefore, when transferring data with DMA, CSR_DMA_SIZE must be configured in advance so that the correct number of transfers can be requested per block.</description>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>8bit</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16bit</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>32bit</name>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ERR_WDATA_NOT_RDY</name>
                        <description>Set when a write occurs whilst the SHA-256 core is not ready for data (WDATA_RDY is low). Write one to clear.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>SUM_VLD</name>
                        <description>If 1, the SHA-256 checksum presented in registers SUM0 through SUM7 is currently valid.

                            Goes low when WDATA is first written, then returns high once 16 words have been written and the digest of the current 512-bit block has subsequently completed.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WDATA_RDY</name>
                        <description>If 1, the SHA-256 core is ready to accept more data through the WDATA register.

                            After writing 16 words, this flag will go low for 57 cycles whilst the core completes its digest.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>START</name>
                        <description>Write 1 to prepare the SHA-256 core for a new checksum.

                            The SUMx registers are initialised to the proper values (fractional bits of square roots of first 8 primes) and internal counters are cleared. This immediately forces WDATA_RDY and SUM_VLD high.

                            START must be written before initiating a DMA transfer to the SHA-256 core, because the core will always request 16 transfers at a time (1 512-bit block). Additionally, the DMA channel should be configured for a multiple of 16 32-bit transfers.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WDATA</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Write data register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WDATA</name>
                        <description>After pulsing START and writing 16 words of data to this register, WDATA_RDY will go low and the SHA-256 core will complete the digest of the current 512-bit block.

                            Software is responsible for ensuring the data is correctly padded and terminated to a whole number of 512-bit blocks.

                            After this, WDATA_RDY will return high, and more data can be written (if any).

                            This register supports word, halfword and byte writes, so that DMA from non-word-aligned buffers can be supported. The total amount of data per block remains the same (16 words, 32 halfwords or 64 bytes) and byte/halfword transfers must not be mixed within a block.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <name>SUM%s</name>
                <addressOffset>0x00000008</addressOffset>
                <description>256-bit checksum result. Contents are undefined when CSR_SUM_VLD is 0.</description>
                <resetValue>0x00000000</resetValue>
                <access>read-only</access>
            </register>
