cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>EPPB</name>
        <description>Cortex-M33 EPPB vendor register block for RP2350</description>
        <baseAddress>0xe0080000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>12</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>NMI_MASK0</name>
                <addressOffset>0x00000000</addressOffset>
                <description>NMI mask for IRQs 0 through 31. This register is core-local, and is reset by a processor warm reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NMI_MASK0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NMI_MASK1</name>
                <addressOffset>0x00000004</addressOffset>
                <description>NMI mask for IRQs 0 though 51. This register is core-local, and is reset by a processor warm reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NMI_MASK1</name>
                        <bitRange>[19:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SLEEPCTRL</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Nonstandard sleep control register</description>
                <resetValue>0x00000002</resetValue>
                <fields>
                    <field>
                        <name>WICENACK</name>
                        <description>Status signal from the processor&#39;s interrupt controller. Changes to WICENREQ are eventually reflected in WICENACK.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WICENREQ</name>
                        <description>Request that the next processor deep sleep is a WIC sleep. After setting this bit, before sleeping, poll WICENACK to ensure the processor interrupt controller has acknowledged the change.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LIGHT_SLEEP</name>
                        <description>By default, any processor sleep will deassert the system-level clock request. Reenabling the clocks incurs 5 cycles of additional latency on wakeup.

                            Setting LIGHT_SLEEP to 1 keeps the clock request asserted during a normal sleep (Arm SCR.SLEEPDEEP = 0), for faster wakeup. Processor deep sleep (Arm SCR.SLEEPDEEP = 1) is not affected, and will always deassert the system-level clock request.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>PPB</name>
        <description>TEAL registers accessible through the debug interface</description>
        <baseAddress>0xe0000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>274432</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <dim>32</dim>
                <dimIncrement>4</dimIncrement>
                <name>ITM_STIM%s</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_TER0</name>
                <addressOffset>0x00000e00</addressOffset>
                <description>Provide an individual enable bit for each ITM_STIM register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMENA</name>
                        <description>For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n + m) is enabled</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_TPR</name>
                <addressOffset>0x00000e40</addressOffset>
                <description>Controls which stimulus ports can be accessed by unprivileged code</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRIVMASK</name>
                        <description>Bit mask to enable tracing on ITM stimulus ports</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_TCR</name>
                <addressOffset>0x00000e80</addressOffset>
                <description>Configures and controls transfers through the ITM interface</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BUSY</name>
                        <description>Indicates whether the ITM is currently processing events</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRACEBUSID</name>
                        <description>Identifier for multi-source trace stream formatting. If multi-source trace is in use, the debugger must write a unique non-zero trace ID value to this field</description>
                        <bitRange>[22:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GTSFREQ</name>
                        <description>Defines how often the ITM generates a global timestamp, based on the global timestamp clock frequency, or disables generation of global timestamps</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TSPRESCALE</name>
                        <description>Local timestamp prescaler, used with the trace packet reference clock</description>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALLENA</name>
                        <description>Stall the PE to guarantee delivery of Data Trace packets.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWOENA</name>
                        <description>Enables asynchronous clocking of the timestamp counter</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXENA</name>
                        <description>Enables forwarding of hardware event packet from the DWT unit to the ITM for output to the TPIU</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYNCENA</name>
                        <description>Enables Synchronization packet transmission for a synchronous TPIU</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TSENA</name>
                        <description>Enables Local timestamp generation</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ITMENA</name>
                        <description>Enables the ITM</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INT_ATREADY</name>
                <addressOffset>0x00000ef0</addressOffset>
                <description>Integration Mode: Read ATB Ready</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AFVALID</name>
                        <description>A read of this bit returns the value of AFVALID</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ATREADY</name>
                        <description>A read of this bit returns the value of ATREADY</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INT_ATVALID</name>
                <addressOffset>0x00000ef8</addressOffset>
                <description>Integration Mode: Write ATB Valid</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AFREADY</name>
                        <description>A write to this bit gives the value of AFREADY</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATREADY</name>
                        <description>A write to this bit gives the value of ATVALID</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_ITCTRL</name>
                <addressOffset>0x00000f00</addressOffset>
                <description>Integration Mode Control Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IME</name>
                        <description>Integration mode enable bit - The possible values are:  0 - The trace unit is not in integration mode. 1 - The trace unit is in integration mode. This mode enables: A debug agent to perform topology detection. SoC test software to perform integration testing.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_DEVARCH</name>
                <addressOffset>0x00000fbc</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x47701a01</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Defines that the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Defines the architecture revision of the component</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHVER</name>
                        <description>Defines the architecture version of the component</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHPART</name>
                        <description>Defines the architecture of the component</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_DEVTYPE</name>
                <addressOffset>0x00000fcc</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000043</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>Component sub-type</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>Component major type</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR4</name>
                <addressOffset>0x00000fd0</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR5</name>
                <addressOffset>0x00000fd4</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ITM_PIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR6</name>
                <addressOffset>0x00000fd8</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ITM_PIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR7</name>
                <addressOffset>0x00000fdc</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ITM_PIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR0</name>
                <addressOffset>0x00000fe0</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR1</name>
                <addressOffset>0x00000fe4</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR2</name>
                <addressOffset>0x00000fe8</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x0000000b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_PIDR3</name>
                <addressOffset>0x00000fec</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_CIDR0</name>
                <addressOffset>0x00000ff0</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_CIDR1</name>
                <addressOffset>0x00000ff4</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_CIDR2</name>
                <addressOffset>0x00000ff8</addressOffset>
                <description>Provides CoreSight discovery information for the ITM</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
