cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>FP_CIDR1</name>
                <addressOffset>0x00002ff4</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_CIDR2</name>
                <addressOffset>0x00002ff8</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_CIDR3</name>
                <addressOffset>0x00002ffc</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ICTR</name>
                <addressOffset>0x0000e004</addressOffset>
                <description>Provides information about the interrupt controller</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>INTLINESNUM</name>
                        <description>Indicates the number of the highest implemented register in each of the NVIC control register sets, or in the case of NVIC_IPR*n, 4×INTLINESNUM</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ACTLR</name>
                <addressOffset>0x0000e008</addressOffset>
                <description>Provides IMPLEMENTATION DEFINED configuration and control options</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EXTEXCLALL</name>
                        <description>External Exclusives Allowed with no MPU</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISITMATBFLUSH</name>
                        <description>Disable ATB Flush</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FPEXCODIS</name>
                        <description>Disable FPU exception outputs</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISOOFP</name>
                        <description>Disable out-of-order FP instruction completion</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISFOLD</name>
                        <description>Disable dual-issue.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISMCYCINT</name>
                        <description>Disable dual-issue.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SYST_CSR</name>
                <addressOffset>0x0000e010</addressOffset>
                <description>Use the SysTick Control and Status Register to enable the SysTick features.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>COUNTFLAG</name>
                        <description>Returns 1 if timer counted to 0 since last time this was read. Clears on read by application or debugger.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLKSOURCE</name>
                        <description>SysTick clock source. Always reads as one if SYST_CALIB reports NOREF. 
                            Selects the SysTick timer clock source: 
                            0 = External reference clock. 
                            1 = Processor clock.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TICKINT</name>
                        <description>Enables SysTick exception request: 
                            0 = Counting down to zero does not assert the SysTick exception request. 
                            1 = Counting down to zero to asserts the SysTick exception request.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable SysTick counter: 
                            0 = Counter disabled. 
                            1 = Counter enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SYST_RVR</name>
                <addressOffset>0x0000e014</addressOffset>
                <description>Use the SysTick Reload Value Register to specify the start value to load into the current value register when the counter reaches 0. It can be any value between 0 and 0x00FFFFFF. A start value of 0 is possible, but has no effect because the SysTick interrupt and COUNTFLAG are activated when counting from 1 to 0. The reset value of this register is UNKNOWN. 
                    To generate a multi-shot timer with a period of N processor clock cycles, use a RELOAD value of N-1. For example, if the SysTick interrupt is required every 100 clock pulses, set RELOAD to 99.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RELOAD</name>
                        <description>Value to load into the SysTick Current Value Register when the counter reaches 0.</description>
                        <bitRange>[23:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SYST_CVR</name>
                <addressOffset>0x0000e018</addressOffset>
                <description>Use the SysTick Current Value Register to find the current value in the register. The reset value of this register is UNKNOWN.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CURRENT</name>
                        <description>Reads return the current value of the SysTick counter. This register is write-clear. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register.</description>
                        <bitRange>[23:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SYST_CALIB</name>
                <addressOffset>0x0000e01c</addressOffset>
                <description>Use the SysTick Calibration Value Register to enable software to scale to any required speed using divide and multiply.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NOREF</name>
                        <description>If reads as 1, the Reference clock is not provided - the CLKSOURCE bit of the SysTick Control and Status register will be forced to 1 and cannot be cleared to 0.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SKEW</name>
                        <description>If reads as 1, the calibration value for 10ms is inexact (due to clock frequency).</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TENMS</name>
                        <description>An optional Reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If the value reads as 0, the calibration value is not known.</description>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ISER0</name>
                <addressOffset>0x0000e100</addressOffset>
                <description>Enables or reads the enabled state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SETENA</name>
                        <description>For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is enabled</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ISER1</name>
                <addressOffset>0x0000e104</addressOffset>
                <description>Enables or reads the enabled state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SETENA</name>
                        <description>For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n + m is enabled</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ICER0</name>
                <addressOffset>0x0000e180</addressOffset>
                <description>Clears or reads the enabled state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRENA</name>
                        <description>For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is enabled</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ICER1</name>
                <addressOffset>0x0000e184</addressOffset>
                <description>Clears or reads the enabled state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRENA</name>
                        <description>For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n + m is enabled</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ISPR0</name>
                <addressOffset>0x0000e200</addressOffset>
                <description>Enables or reads the pending state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SETPEND</name>
                        <description>For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is pending</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ISPR1</name>
                <addressOffset>0x0000e204</addressOffset>
                <description>Enables or reads the pending state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SETPEND</name>
                        <description>For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n + m is pending</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ICPR0</name>
                <addressOffset>0x0000e280</addressOffset>
                <description>Clears or reads the pending state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRPEND</name>
                        <description>For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is pending</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ICPR1</name>
                <addressOffset>0x0000e284</addressOffset>
                <description>Clears or reads the pending state of each group of 32 interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRPEND</name>
                        <description>For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n + m is pending</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IABR0</name>
                <addressOffset>0x0000e300</addressOffset>
                <description>For each group of 32 interrupts, shows the active state of each interrupt</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ACTIVE</name>
                        <description>For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt 32*n+m</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IABR1</name>
                <addressOffset>0x0000e304</addressOffset>
                <description>For each group of 32 interrupts, shows the active state of each interrupt</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ACTIVE</name>
                        <description>For ACTIVE[m] in NVIC_IABR*n, indicates the active state for interrupt 32*n+m</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ITNS0</name>
                <addressOffset>0x0000e380</addressOffset>
                <description>For each group of 32 interrupts, determines whether each interrupt targets Non-secure or Secure state</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ITNS</name>
                        <description>For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state for interrupt 32*n+m</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_ITNS1</name>
                <addressOffset>0x0000e384</addressOffset>
                <description>For each group of 32 interrupts, determines whether each interrupt targets Non-secure or Secure state</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ITNS</name>
                        <description>For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state for interrupt 32*n+m</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <name>NVIC_IPR%s</name>
                <addressOffset>0x0000e400</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CPUID</name>
                <addressOffset>0x0000ed00</addressOffset>
                <description>Provides identification information for the PE, including an implementer code for the device and a device ID number</description>
                <resetValue>0x411fd210</resetValue>
                <fields>
                    <field>
                        <name>IMPLEMENTER</name>
                        <description>This field must hold an implementer code that has been assigned by ARM</description>
                        <bitRange>[31:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VARIANT</name>
                        <description>IMPLEMENTATION DEFINED variant number. Typically, this field is used to distinguish between different product variants, or major revisions of a product</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHITECTURE</name>
                        <description>Defines the Architecture implemented by the PE</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PARTNO</name>
                        <description>IMPLEMENTATION DEFINED primary part number for the device</description>
                        <bitRange>[15:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>IMPLEMENTATION DEFINED revision number for the device</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
