cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>ICSR</name>
                <addressOffset>0x0000ed04</addressOffset>
                <description>Controls and provides status information for NMI, PendSV, SysTick and interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PENDNMISET</name>
                        <description>Indicates whether the NMI exception is pending</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PENDNMICLR</name>
                        <description>Allows the NMI exception pend state to be cleared</description>
                        <bitRange>[30:30]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PENDSVSET</name>
                        <description>Indicates whether the PendSV exception is pending or set this exception</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PENDSVCLR</name>
                        <description>Allows the PendSV exception pend state to be cleared</description>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PENDSTSET</name>
                        <description>Indicates whether the SysTick exception is pending or set this exception</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PENDSTCLR</name>
                        <description>Allows the SysTick exception pend state to be cleared</description>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>STTNS</name>
                        <description>Controls whether in a single SysTick implementation, the SysTick is Secure or Non-secure</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ISRPREEMPT</name>
                        <description>Indicates whether a pending exception will be serviced on exit from debug halt state</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ISRPENDING</name>
                        <description>Indicates whether an external interrupt, generated by the NVIC, is pending</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VECTPENDING</name>
                        <description>The exception number of the highest priority pending and enabled interrupt</description>
                        <bitRange>[20:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RETTOBASE</name>
                        <description>In Handler mode, indicates whether there is more than one active exception</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VECTACTIVE</name>
                        <description>The exception number of the current executing exception</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>VTOR</name>
                <addressOffset>0x0000ed08</addressOffset>
                <description>The VTOR indicates the offset of the vector table base address from memory address 0x00000000.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TBLOFF</name>
                        <description>Vector table base offset field. It contains bits[31:7] of the offset of the table base from the bottom of the memory map.</description>
                        <bitRange>[31:7]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>AIRCR</name>
                <addressOffset>0x0000ed0c</addressOffset>
                <description>Use the Application Interrupt and Reset Control Register to: determine data endianness, clear all active state information from debug halt mode, request a system reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VECTKEY</name>
                        <description>Register key: 
                            Reads as Unknown 
                            On writes, write 0x05FA to VECTKEY, otherwise the write is ignored.</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDIANESS</name>
                        <description>Data endianness implemented: 
                            0 = Little-endian.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRIS</name>
                        <description>Prioritize Secure exceptions. The value of this bit defines whether Secure exception priority boosting is enabled. 
                            0	Priority ranges of Secure and Non-secure exceptions are identical. 
                            1	Non-secure exceptions are de-prioritized.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFHFNMINS</name>
                        <description>BusFault, HardFault, and NMI Non-secure enable. 
                            0	BusFault, HardFault, and NMI are Secure. 
                            1	BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRIGROUP</name>
                        <description>Interrupt priority grouping field. This field determines the split of group priority from subpriority. 
                            See https://developer.arm.com/documentation/100235/0004/the-cortex-m33-peripherals/system-control-block/application-interrupt-and-reset-control-register?lang=en</description>
                        <bitRange>[10:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYSRESETREQS</name>
                        <description>System reset request, Secure state only. 
                            0	SYSRESETREQ functionality is available to both Security states. 
                            1 SYSRESETREQ functionality is only available to Secure state.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYSRESETREQ</name>
                        <description>Writing 1 to this bit causes the SYSRESETREQ signal to the outer system to be asserted to request a reset. The intention is to force a large system reset of all major components except for debug. The C_HALT bit in the DHCSR is cleared as a result of the system reset requested. The debugger does not lose contact with the device.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VECTCLRACTIVE</name>
                        <description>Clears all active state information for fixed and configurable exceptions. This bit: is self-clearing, can only be set by the DAP when the core is halted.  When set: clears all active exception status of the processor, forces a return to Thread mode, forces an IPSR of 0. A debugger must re-initialize the stack.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCR</name>
                <addressOffset>0x0000ed10</addressOffset>
                <description>System Control Register. Use the System Control Register for power-management functions: signal to the system when the processor can enter a low power state, control how the processor enters and exits low power states.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SEVONPEND</name>
                        <description>Send Event on Pending bit: 
                            0 = Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded. 
                            1 = Enabled events and all interrupts, including disabled interrupts, can wakeup the processor. 
                            When an event or interrupt becomes pending, the event signal wakes up the processor from WFE. If the 
                            processor is not waiting for an event, the event is registered and affects the next WFE. 
                            The processor also wakes up on execution of an SEV instruction or an external event.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEEPDEEPS</name>
                        <description>0 SLEEPDEEP is available to both security states 
                            1 SLEEPDEEP is only available to Secure state</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEEPDEEP</name>
                        <description>Controls whether the processor uses sleep or deep sleep as its low power mode: 
                            0 = Sleep. 
                            1 = Deep sleep.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEEPONEXIT</name>
                        <description>Indicates sleep-on-exit when returning from Handler mode to Thread mode: 
                            0 = Do not sleep when returning to Thread mode. 
                            1 = Enter sleep, or deep sleep, on return from an ISR to Thread mode. 
                            Setting this bit to 1 enables an interrupt driven application to avoid returning to an empty main application.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CCR</name>
                <addressOffset>0x0000ed14</addressOffset>
                <description>Sets or returns configuration and control data</description>
                <resetValue>0x00000201</resetValue>
                <fields>
                    <field>
                        <name>BP</name>
                        <description>Enables program flow prediction `FTSSS</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IC</name>
                        <description>This is a global enable bit for instruction caches in the selected Security state</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DC</name>
                        <description>Enables data caching of all data accesses to Normal memory `FTSSS</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STKOFHFNMIGN</name>
                        <description>Controls the effect of a stack limit violation while executing at a requested priority less than 0</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RES1</name>
                        <description>Reserved, RES1</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BFHFNMIGN</name>
                        <description>Determines the effect of precise BusFaults on handlers running at a requested priority less than 0</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DIV_0_TRP</name>
                        <description>Controls the generation of a DIVBYZERO UsageFault when attempting to perform integer division by zero</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UNALIGN_TRP</name>
                        <description>Controls the trapping of unaligned word or halfword accesses</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USERSETMPEND</name>
                        <description>Determines whether unprivileged accesses are permitted to pend interrupts via the STIR</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RES1_1</name>
                        <description>Reserved, RES1</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SHPR1</name>
                <addressOffset>0x0000ed18</addressOffset>
                <description>Sets or returns priority for system handlers 4 - 7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_7_4</name>
                        <description>Priority of system handler 7, SecureFault</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_6_4</name>
                        <description>Priority of system handler 6, UsageFault</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_5_4</name>
                        <description>Priority of system handler 5, BusFault</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_4_4</name>
                        <description>Priority of system handler 4, MemoryManagement</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SHPR2</name>
                <addressOffset>0x0000ed1c</addressOffset>
                <description>Sets or returns priority for system handlers 8 - 11</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_11_4</name>
                        <description>Priority of system handler 11, SVCall</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_10</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRI_9</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRI_8</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SHPR3</name>
                <addressOffset>0x0000ed20</addressOffset>
                <description>Sets or returns priority for system handlers 12 - 15</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_15_4</name>
                        <description>Priority of system handler 15, SysTick</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_14_4</name>
                        <description>Priority of system handler 14, PendSV</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_13</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRI_12_4</name>
                        <description>Priority of system handler 12, DebugMonitor</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
