cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>SHCSR</name>
                <addressOffset>0x0000ed24</addressOffset>
                <description>Provides access to the active and pending status of system exceptions</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>HARDFAULTPENDED</name>
                        <description>`IAAMO the pending state of the HardFault exception `CTTSSS</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SECUREFAULTPENDED</name>
                        <description>`IAAMO the pending state of the SecureFault exception</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SECUREFAULTENA</name>
                        <description>`DW the SecureFault exception is enabled</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USGFAULTENA</name>
                        <description>`DW the UsageFault exception is enabled `FTSSS</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSFAULTENA</name>
                        <description>`DW the BusFault exception is enabled</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MEMFAULTENA</name>
                        <description>`DW the MemManage exception is enabled `FTSSS</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SVCALLPENDED</name>
                        <description>`IAAMO the pending state of the SVCall exception `FTSSS</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSFAULTPENDED</name>
                        <description>`IAAMO the pending state of the BusFault exception</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MEMFAULTPENDED</name>
                        <description>`IAAMO the pending state of the MemManage exception `FTSSS</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USGFAULTPENDED</name>
                        <description>The UsageFault exception is banked between Security states, `IAAMO the pending state of the UsageFault exception `FTSSS</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYSTICKACT</name>
                        <description>`IAAMO the active state of the SysTick exception `FTSSS</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PENDSVACT</name>
                        <description>`IAAMO the active state of the PendSV exception `FTSSS</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MONITORACT</name>
                        <description>`IAAMO the active state of the DebugMonitor exception</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SVCALLACT</name>
                        <description>`IAAMO the active state of the SVCall exception `FTSSS</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NMIACT</name>
                        <description>`IAAMO the active state of the NMI exception</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SECUREFAULTACT</name>
                        <description>`IAAMO the active state of the SecureFault exception</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USGFAULTACT</name>
                        <description>`IAAMO the active state of the UsageFault exception `FTSSS</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HARDFAULTACT</name>
                        <description>Indicates and allows limited modification of the active state of the HardFault exception `FTSSS</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSFAULTACT</name>
                        <description>`IAAMO the active state of the BusFault exception</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MEMFAULTACT</name>
                        <description>`IAAMO the active state of the MemManage exception `FTSSS</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CFSR</name>
                <addressOffset>0x0000ed28</addressOffset>
                <description>Contains the three Configurable Fault Status Registers.

                    31:16 UFSR: Provides information on UsageFault exceptions

