cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    15:8 BFSR: Provides information on BusFault exceptions

                    7:0 MMFSR: Provides information on MemManage exceptions</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>UFSR_DIVBYZERO</name>
                        <description>Sticky flag indicating whether an integer division by zero error has occurred</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_UNALIGNED</name>
                        <description>Sticky flag indicating whether an unaligned access error has occurred</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_STKOF</name>
                        <description>Sticky flag indicating whether a stack overflow error has occurred</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_NOCP</name>
                        <description>Sticky flag indicating whether a coprocessor disabled or not present error has occurred</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_INVPC</name>
                        <description>Sticky flag indicating whether an integrity check error has occurred</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_INVSTATE</name>
                        <description>Sticky flag indicating whether an EPSR.T or EPSR.IT validity error has occurred</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFSR_UNDEFINSTR</name>
                        <description>Sticky flag indicating whether an undefined instruction error has occurred</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_BFARVALID</name>
                        <description>Indicates validity of the contents of the BFAR register</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_LSPERR</name>
                        <description>Records whether a BusFault occurred during FP lazy state preservation</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_STKERR</name>
                        <description>Records whether a derived BusFault occurred during exception entry stacking</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_UNSTKERR</name>
                        <description>Records whether a derived BusFault occurred during exception return unstacking</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_IMPRECISERR</name>
                        <description>Records whether an imprecise data access error has occurred</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_PRECISERR</name>
                        <description>Records whether a precise data access error has occurred</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFSR_IBUSERR</name>
                        <description>Records whether a BusFault on an instruction prefetch has occurred</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MMFSR</name>
                        <description>Provides information on MemManage exceptions</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>HFSR</name>
                <addressOffset>0x0000ed2c</addressOffset>
                <description>Shows the cause of any HardFaults</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DEBUGEVT</name>
                        <description>Indicates when a Debug event has occurred</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FORCED</name>
                        <description>Indicates that a fault with configurable priority has been escalated to a HardFault exception, because it could not be made active, because of priority, or because it was disabled</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VECTTBL</name>
                        <description>Indicates when a fault has occurred because of a vector table read error on exception processing</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DFSR</name>
                <addressOffset>0x0000ed30</addressOffset>
                <description>Shows which debug event occurred</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EXTERNAL</name>
                        <description>Sticky flag indicating whether an External debug request debug event has occurred</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VCATCH</name>
                        <description>Sticky flag indicating whether a Vector catch debug event has occurred</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DWTTRAP</name>
                        <description>Sticky flag indicating whether a Watchpoint debug event has occurred</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BKPT</name>
                        <description>Sticky flag indicating whether a Breakpoint debug event has occurred</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HALTED</name>
                        <description>Sticky flag indicating that a Halt request debug event or Step debug event has occurred</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MMFAR</name>
                <addressOffset>0x0000ed34</addressOffset>
                <description>Shows the address of the memory location that caused an MPU fault</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>This register is updated with the address of a location that produced a MemManage fault. The MMFSR shows the cause of the fault, and whether this field is valid. This field is valid only when MMFSR.MMARVALID is set, otherwise it is UNKNOWN</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BFAR</name>
                <addressOffset>0x0000ed38</addressOffset>
                <description>Shows the address associated with a precise data access BusFault</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>This register is updated with the address of a location that produced a BusFault. The BFSR shows the reason for the fault. This field is valid only when BFSR.BFARVALID is set, otherwise it is UNKNOWN</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_PFR0</name>
                <addressOffset>0x0000ed40</addressOffset>
                <description>Gives top-level information about the instruction set supported by the PE</description>
                <resetValue>0x00000030</resetValue>
                <fields>
                    <field>
                        <name>STATE1</name>
                        <description>T32 instruction set support</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATE0</name>
                        <description>A32 instruction set support</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_PFR1</name>
                <addressOffset>0x0000ed44</addressOffset>
                <description>Gives information about the programmers&#39; model and Extensions support</description>
                <resetValue>0x00000520</resetValue>
                <fields>
                    <field>
                        <name>MPROGMOD</name>
                        <description>Identifies support for the M-Profile programmers&#39; model support</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SECURITY</name>
                        <description>Identifies whether the Security Extension is implemented</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_DFR0</name>
                <addressOffset>0x0000ed48</addressOffset>
                <description>Provides top level information about the debug system</description>
                <resetValue>0x00200000</resetValue>
                <fields>
                    <field>
                        <name>MPROFDBG</name>
                        <description>Indicates the supported M-profile debug architecture</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_AFR0</name>
                <addressOffset>0x0000ed4c</addressOffset>
                <description>Provides information about the IMPLEMENTATION DEFINED features of the PE</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IMPDEF3</name>
                        <description>IMPLEMENTATION DEFINED meaning</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMPDEF2</name>
                        <description>IMPLEMENTATION DEFINED meaning</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMPDEF1</name>
                        <description>IMPLEMENTATION DEFINED meaning</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMPDEF0</name>
                        <description>IMPLEMENTATION DEFINED meaning</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_MMFR0</name>
                <addressOffset>0x0000ed50</addressOffset>
                <description>Provides information about the implemented memory model and memory management support</description>
                <resetValue>0x00101f40</resetValue>
                <fields>
                    <field>
                        <name>AUXREG</name>
                        <description>Indicates support for Auxiliary Control Registers</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TCM</name>
                        <description>Indicates support for tightly coupled memories (TCMs)</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SHARELVL</name>
                        <description>Indicates the number of shareability levels implemented</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OUTERSHR</name>
                        <description>Indicates the outermost shareability domain implemented</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PMSA</name>
                        <description>Indicates support for the protected memory system architecture (PMSA)</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_MMFR1</name>
                <addressOffset>0x0000ed54</addressOffset>
                <description>Provides information about the implemented memory model and memory management support</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ID_MMFR1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_MMFR2</name>
                <addressOffset>0x0000ed58</addressOffset>
                <description>Provides information about the implemented memory model and memory management support</description>
                <resetValue>0x01000000</resetValue>
                <fields>
                    <field>
                        <name>WFISTALL</name>
                        <description>Indicates the support for Wait For Interrupt (WFI) stalling</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_MMFR3</name>
                <addressOffset>0x0000ed5c</addressOffset>
                <description>Provides information about the implemented memory model and memory management support</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BPMAINT</name>
                        <description>Indicates the supported branch predictor maintenance</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMAINTSW</name>
                        <description>Indicates the supported cache maintenance operations by set/way</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMAINTVA</name>
                        <description>Indicates the supported cache maintenance operations by address</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_ISAR0</name>
                <addressOffset>0x0000ed60</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x08092300</resetValue>
                <fields>
                    <field>
                        <name>DIVIDE</name>
                        <description>Indicates the supported Divide instructions</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEBUG</name>
                        <description>Indicates the implemented Debug instructions</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>COPROC</name>
                        <description>Indicates the supported Coprocessor instructions</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMPBRANCH</name>
                        <description>Indicates the supported combined Compare and Branch instructions</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BITFIELD</name>
                        <description>Indicates the supported bit field instructions</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BITCOUNT</name>
                        <description>Indicates the supported bit count instructions</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_ISAR1</name>
                <addressOffset>0x0000ed64</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x05725000</resetValue>
                <fields>
                    <field>
                        <name>INTERWORK</name>
                        <description>Indicates the implemented Interworking instructions</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMMEDIATE</name>
                        <description>Indicates the implemented for data-processing instructions with long immediates</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IFTHEN</name>
                        <description>Indicates the implemented If-Then instructions</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EXTEND</name>
                        <description>Indicates the implemented Extend instructions</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
