cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>ID_ISAR2</name>
                <addressOffset>0x0000ed68</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x30173426</resetValue>
                <fields>
                    <field>
                        <name>REVERSAL</name>
                        <description>Indicates the implemented Reversal instructions</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MULTU</name>
                        <description>Indicates the implemented advanced unsigned Multiply instructions</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MULTS</name>
                        <description>Indicates the implemented advanced signed Multiply instructions</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MULT</name>
                        <description>Indicates the implemented additional Multiply instructions</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MULTIACCESSINT</name>
                        <description>Indicates the support for interruptible multi-access instructions</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MEMHINT</name>
                        <description>Indicates the implemented Memory Hint instructions</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LOADSTORE</name>
                        <description>Indicates the implemented additional load/store instructions</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_ISAR3</name>
                <addressOffset>0x0000ed6c</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x07895729</resetValue>
                <fields>
                    <field>
                        <name>TRUENOP</name>
                        <description>Indicates the implemented true NOP instructions</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>T32COPY</name>
                        <description>Indicates the support for T32 non flag-setting MOV instructions</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TABBRANCH</name>
                        <description>Indicates the implemented Table Branch instructions</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SYNCHPRIM</name>
                        <description>Used in conjunction with ID_ISAR4.SynchPrim_frac to indicate the implemented Synchronization Primitive instructions</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SVC</name>
                        <description>Indicates the implemented SVC instructions</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SIMD</name>
                        <description>Indicates the implemented SIMD instructions</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SATURATE</name>
                        <description>Indicates the implemented saturating instructions</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_ISAR4</name>
                <addressOffset>0x0000ed70</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x01310132</resetValue>
                <fields>
                    <field>
                        <name>PSR_M</name>
                        <description>Indicates the implemented M profile instructions to modify the PSRs</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SYNCPRIM_FRAC</name>
                        <description>Used in conjunction with ID_ISAR3.SynchPrim to indicate the implemented Synchronization Primitive instructions</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BARRIER</name>
                        <description>Indicates the implemented Barrier instructions</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WRITEBACK</name>
                        <description>Indicates the support for writeback addressing modes</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WITHSHIFTS</name>
                        <description>Indicates the support for writeback addressing modes</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>UNPRIV</name>
                        <description>Indicates the implemented unprivileged instructions</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ID_ISAR5</name>
                <addressOffset>0x0000ed74</addressOffset>
                <description>Provides information about the instruction set implemented by the PE</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ID_ISAR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTR</name>
                <addressOffset>0x0000ed7c</addressOffset>
                <description>Provides information about the architecture of the caches. CTR is RES0 if CLIDR is zero.</description>
                <resetValue>0x8000c000</resetValue>
                <fields>
                    <field>
                        <name>RES1</name>
                        <description>Reserved, RES1</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CWG</name>
                        <description>Log2 of the number of words of the maximum size of memory that can be overwritten as a result of the eviction of a cache entry that has had a memory location in it modified</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERG</name>
                        <description>Log2 of the number of words of the maximum size of the reservation granule that has been implemented for the Load-Exclusive and Store-Exclusive instructions</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DMINLINE</name>
                        <description>Log2 of the number of words in the smallest cache line of all the data caches and unified caches that are controlled by the PE</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RES1_1</name>
                        <description>Reserved, RES1</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMINLINE</name>
                        <description>Log2 of the number of words in the smallest cache line of all the instruction caches that are controlled by the PE</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CPACR</name>
                <addressOffset>0x0000ed88</addressOffset>
                <description>Specifies the access privileges for coprocessors and the FP Extension</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CP11</name>
                        <description>The value in this field is ignored. If the implementation does not include the FP Extension, this field is RAZ/WI. If the value of this bit is not programmed to the same value as the CP10 field, then the value is UNKNOWN</description>
                        <bitRange>[23:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP10</name>
                        <description>Defines the access rights for the floating-point functionality</description>
                        <bitRange>[21:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP7</name>
                        <description>Controls access privileges for coprocessor 7</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP6</name>
                        <description>Controls access privileges for coprocessor 6</description>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP5</name>
                        <description>Controls access privileges for coprocessor 5</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP4</name>
                        <description>Controls access privileges for coprocessor 4</description>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP3</name>
                        <description>Controls access privileges for coprocessor 3</description>
                        <bitRange>[7:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP2</name>
                        <description>Controls access privileges for coprocessor 2</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP1</name>
                        <description>Controls access privileges for coprocessor 1</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP0</name>
                        <description>Controls access privileges for coprocessor 0</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NSACR</name>
                <addressOffset>0x0000ed8c</addressOffset>
                <description>Defines the Non-secure access permissions for both the FP Extension and coprocessors CP0 to CP7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CP11</name>
                        <description>Enables Non-secure access to the Floating-point Extension</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP10</name>
                        <description>Enables Non-secure access to the Floating-point Extension</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP7</name>
                        <description>Enables Non-secure access to coprocessor CP7</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP6</name>
                        <description>Enables Non-secure access to coprocessor CP6</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP5</name>
                        <description>Enables Non-secure access to coprocessor CP5</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP4</name>
                        <description>Enables Non-secure access to coprocessor CP4</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP3</name>
                        <description>Enables Non-secure access to coprocessor CP3</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP2</name>
                        <description>Enables Non-secure access to coprocessor CP2</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP1</name>
                        <description>Enables Non-secure access to coprocessor CP1</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP0</name>
                        <description>Enables Non-secure access to coprocessor CP0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_TYPE</name>
                <addressOffset>0x0000ed90</addressOffset>
                <description>The MPU Type Register indicates how many regions the MPU `FTSSS supports</description>
                <resetValue>0x00000800</resetValue>
                <fields>
                    <field>
                        <name>DREGION</name>
                        <description>Number of regions supported by the MPU</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SEPARATE</name>
                        <description>Indicates support for separate instructions and data address regions</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_CTRL</name>
                <addressOffset>0x0000ed94</addressOffset>
                <description>Enables the MPU and, when the MPU is enabled, controls whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults, NMIs, and exception handlers when FAULTMASK is set to 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRIVDEFENA</name>
                        <description>Controls whether the default memory map is enabled for privileged software</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HFNMIENA</name>
                        <description>Controls whether handlers executing with priority less than 0 access memory with the MPU enabled or disabled. This applies to HardFaults, NMIs, and exception handlers when FAULTMASK is set to 1</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enables the MPU</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RNR</name>
                <addressOffset>0x0000ed98</addressOffset>
                <description>Selects the region currently accessed by MPU_RBAR and MPU_RLAR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REGION</name>
                        <description>Indicates the memory region accessed by MPU_RBAR and MPU_RLAR</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RBAR</name>
                <addressOffset>0x0000ed9c</addressOffset>
                <description>Provides indirect read and write access to the base address of the currently selected MPU region `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BASE</name>
                        <description>Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SH</name>
                        <description>Defines the Shareability domain of this region for Normal memory</description>
                        <bitRange>[4:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AP</name>
                        <description>Defines the access permissions for this region</description>
                        <bitRange>[2:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>XN</name>
                        <description>Defines whether code can be executed from this region</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RLAR</name>
                <addressOffset>0x0000eda0</addressOffset>
                <description>Provides indirect read and write access to the limit address of the currently selected MPU region `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LIMIT</name>
                        <description>Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTRINDX</name>
                        <description>Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
                        <bitRange>[3:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
