cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>MVFR0</name>
                <addressOffset>0x0000ef40</addressOffset>
                <description>Describes the features provided by the Floating-point Extension</description>
                <resetValue>0x60540601</resetValue>
                <fields>
                    <field>
                        <name>FPROUND</name>
                        <description>Indicates the rounding modes supported by the FP Extension</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPSQRT</name>
                        <description>Indicates the support for FP square root operations</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPDIVIDE</name>
                        <description>Indicates the support for FP divide operations</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPDP</name>
                        <description>Indicates support for FP double-precision operations</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPSP</name>
                        <description>Indicates support for FP single-precision operations</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SIMDREG</name>
                        <description>Indicates size of FP register file</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MVFR1</name>
                <addressOffset>0x0000ef44</addressOffset>
                <description>Describes the features provided by the Floating-point Extension</description>
                <resetValue>0x85000089</resetValue>
                <fields>
                    <field>
                        <name>FMAC</name>
                        <description>Indicates whether the FP Extension implements the fused multiply accumulate instructions</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPHP</name>
                        <description>Indicates whether the FP Extension implements half-precision FP conversion instructions</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPDNAN</name>
                        <description>Indicates whether the FP hardware implementation supports NaN propagation</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPFTZ</name>
                        <description>Indicates whether subnormals are always flushed-to-zero</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MVFR2</name>
                <addressOffset>0x0000ef48</addressOffset>
                <description>Describes the features provided by the Floating-point Extension</description>
                <resetValue>0x00000060</resetValue>
                <fields>
                    <field>
                        <name>FPMISC</name>
                        <description>Indicates support for miscellaneous FP features</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DDEVARCH</name>
                <addressOffset>0x0000efbc</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x47702a04</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Defines that the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Defines the architecture revision of the component</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHVER</name>
                        <description>Defines the architecture version of the component</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHPART</name>
                        <description>Defines the architecture of the component</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DDEVTYPE</name>
                <addressOffset>0x0000efcc</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>Component sub-type</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>CoreSight major type</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR4</name>
                <addressOffset>0x0000efd0</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR5</name>
                <addressOffset>0x0000efd4</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DPIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR6</name>
                <addressOffset>0x0000efd8</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DPIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR7</name>
                <addressOffset>0x0000efdc</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DPIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR0</name>
                <addressOffset>0x0000efe0</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR1</name>
                <addressOffset>0x0000efe4</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR2</name>
                <addressOffset>0x0000efe8</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x0000000b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DPIDR3</name>
                <addressOffset>0x0000efec</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCIDR0</name>
                <addressOffset>0x0000eff0</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCIDR1</name>
                <addressOffset>0x0000eff4</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCIDR2</name>
                <addressOffset>0x0000eff8</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCIDR3</name>
                <addressOffset>0x0000effc</addressOffset>
                <description>Provides CoreSight discovery information for the SCS</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPRGCTLR</name>
                <addressOffset>0x00041004</addressOffset>
                <description>Programming Control Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EN</name>
                        <description>Trace Unit Enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCSTATR</name>
                <addressOffset>0x0004100c</addressOffset>
                <description>The TRCSTATR indicates the ETM-Teal status</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PMSTABLE</name>
                        <description>Indicates whether the ETM-Teal registers are stable and can be read</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IDLE</name>
                        <description>Indicates that the trace unit is inactive</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCONFIGR</name>
                <addressOffset>0x00041010</addressOffset>
                <description>The TRCCONFIGR sets the basic tracing options for the trace unit</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RS</name>
                        <description>Return stack enable</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TS</name>
                        <description>Global timestamp tracing</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>COND</name>
                        <description>Conditional instruction tracing</description>
                        <bitRange>[10:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CCI</name>
                        <description>Cycle counting in instruction trace</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BB</name>
                        <description>Branch broadcast mode</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCEVENTCTL0R</name>
                <addressOffset>0x00041020</addressOffset>
                <description>The TRCEVENTCTL0R controls the tracing of events in the trace stream. The events also drive the ETM-Teal external outputs.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TYPE1</name>
                        <description>Selects the resource type for event 1</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL1</name>
                        <description>Selects the resource number, based on the value of TYPE1: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL1[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL1[2:0]</description>
                        <bitRange>[10:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TYPE0</name>
                        <description>Selects the resource type for event 0</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL0</name>
                        <description>Selects the resource number, based on the value of TYPE0: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL0[2:0]</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCEVENTCTL1R</name>
                <addressOffset>0x00041024</addressOffset>
                <description>The TRCEVENTCTL1R controls how the events selected by TRCEVENTCTL0R behave</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LPOVERRIDE</name>
                        <description>Low power state behavior override</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATB</name>
                        <description>ATB enabled</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INSTEN1</name>
                        <description>One bit per event, to enable generation of an event element in the instruction trace stream when the selected event occurs</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INSTEN0</name>
                        <description>One bit per event, to enable generation of an event element in the instruction trace stream when the selected event occurs</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
