cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>TRCPIDR4</name>
                <addressOffset>0x00041fd0</addressOffset>
                <description>TRCPIDR4</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR5</name>
                <addressOffset>0x00041fd4</addressOffset>
                <description>TRCPIDR5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR6</name>
                <addressOffset>0x00041fd8</addressOffset>
                <description>TRCPIDR6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR7</name>
                <addressOffset>0x00041fdc</addressOffset>
                <description>TRCPIDR7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR0</name>
                <addressOffset>0x00041fe0</addressOffset>
                <description>TRCPIDR0</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR1</name>
                <addressOffset>0x00041fe4</addressOffset>
                <description>TRCPIDR1</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR2</name>
                <addressOffset>0x00041fe8</addressOffset>
                <description>TRCPIDR2</description>
                <resetValue>0x0000002b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>reads as 0b1</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR3</name>
                <addressOffset>0x00041fec</addressOffset>
                <description>TRCPIDR3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR0</name>
                <addressOffset>0x00041ff0</addressOffset>
                <description>TRCCIDR0</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>reads as 0b00001101</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR1</name>
                <addressOffset>0x00041ff4</addressOffset>
                <description>TRCCIDR1</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>reads as 0b1001</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>reads as 0b0000</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR2</name>
                <addressOffset>0x00041ff8</addressOffset>
                <description>TRCCIDR2</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>reads as 0b00000101</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR3</name>
                <addressOffset>0x00041ffc</addressOffset>
                <description>TRCCIDR3</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>reads as 0b10110001</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTICONTROL</name>
                <addressOffset>0x00042000</addressOffset>
                <description>CTI Control Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GLBEN</name>
                        <description>Enables or disables the CTI</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINTACK</name>
                <addressOffset>0x00042010</addressOffset>
                <description>CTI Interrupt Acknowledge Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTACK</name>
                        <description>Acknowledges the corresponding ctitrigout output. There is one bit of the register for each ctitrigout output. When a 1 is written to a bit in this register, the corresponding ctitrigout is acknowledged, causing it to be cleared.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPSET</name>
                <addressOffset>0x00042014</addressOffset>
                <description>CTI Application Trigger Set Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPSET</name>
                        <description>Setting a bit HIGH generates a channel event for the selected channel. There is one bit of the register for each channel</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPCLEAR</name>
                <addressOffset>0x00042018</addressOffset>
                <description>CTI Application Trigger Clear Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPCLEAR</name>
                        <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPPULSE</name>
                <addressOffset>0x0004201c</addressOffset>
                <description>CTI Application Pulse Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPULSE</name>
                        <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <name>CTIINEN%s</name>
                <addressOffset>0x00042020</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <name>CTIOUTEN%s</name>
                <addressOffset>0x000420a0</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTITRIGINSTATUS</name>
                <addressOffset>0x00042130</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINSTATUS</name>
                        <description>Shows the status of the ctitrigin inputs. There is one bit of the field for each trigger input.Because the register provides a view of the raw ctitrigin inputs, the reset value is UNKNOWN.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTITRIGOUTSTATUS</name>
                <addressOffset>0x00042134</addressOffset>
                <description>CTI Trigger In Status Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTSTATUS</name>
                        <description>Shows the status of the ctitrigout outputs. There is one bit of the field for each trigger output.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTICHINSTATUS</name>
                <addressOffset>0x00042138</addressOffset>
                <description>CTI Channel In Status Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTICHOUTSTATUS</name>
                        <description>Shows the status of the ctichout outputs. There is one bit of the field for each channel output</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIGATE</name>
                <addressOffset>0x00042140</addressOffset>
                <description>Enable CTI Channel Gate register</description>
                <resetValue>0x0000000f</resetValue>
                <fields>
                    <field>
                        <name>CTIGATEEN3</name>
                        <description>Enable ctichout3. Set to 0 to disable channel propagation.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN2</name>
                        <description>Enable ctichout2. Set to 0 to disable channel propagation.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN1</name>
                        <description>Enable ctichout1. Set to 0 to disable channel propagation.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN0</name>
                        <description>Enable ctichout0. Set to 0 to disable channel propagation.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ASICCTL</name>
                <addressOffset>0x00042144</addressOffset>
                <description>External Multiplexer Control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ASICCTL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCHOUT</name>
                <addressOffset>0x00042ee4</addressOffset>
                <description>Integration Test Channel Output register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTCHOUT</name>
                        <description>Sets the value of the ctichout outputs</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITTRIGOUT</name>
                <addressOffset>0x00042ee8</addressOffset>
                <description>Integration Test Trigger Output register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTTRIGOUT</name>
                        <description>Sets the value of the ctitrigout outputs</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCHIN</name>
                <addressOffset>0x00042ef4</addressOffset>
                <description>Integration Test Channel Input register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTCHIN</name>
                        <description>Reads the value of the ctichin inputs.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCTRL</name>
                <addressOffset>0x00042f00</addressOffset>
                <description>Integration Mode Control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IME</name>
                        <description>Integration Mode Enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEVARCH</name>
                <addressOffset>0x00042fbc</addressOffset>
                <description>Device Architecture register</description>
                <resetValue>0x47701a14</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Indicates the component architect</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Indicates whether the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Indicates the architecture revision</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHID</name>
                        <description>Indicates the component</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEVID</name>
                <addressOffset>0x00042fc8</addressOffset>
                <description>Device Configuration register</description>
                <resetValue>0x00040800</resetValue>
                <fields>
                    <field>
                        <name>NUMCH</name>
                        <description>Number of ECT channels available</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMTRIG</name>
                        <description>Number of ECT triggers available.</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EXTMUXNUM</name>
                        <description>Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl. The default value of 0b00000 indicates that no multiplexing is present. This value of this bit depends on the Verilog define EXTMUXNUM that you must change accordingly.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
