cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Memory-mapped accesses will generate bus errors when direct serial mode is enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DIRECT_TX</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Transmit FIFO for direct mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NOPUSH</name>
                        <description>Inhibit the RX FIFO push that would correspond to this TX FIFO entry.

                            Useful to avoid garbage appearing in the RX FIFO when pushing the command at the beginning of a SPI transfer.</description>
                        <bitRange>[20:20]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>OE</name>
                        <description>Output enable (active-high). For single width (SPI), this field is ignored, and SD0 is always set to output, with SD1 always set to input.

                            For dual and quad width (DSPI/QSPI), this sets whether the relevant SDx pads are set to output whilst transferring this FIFO record. In this case the command/address should have OE set, and the data transfer should have OE set or clear depending on the direction of the transfer.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DWIDTH</name>
                        <description>Data width. If 0, hardware will transmit the 8 LSBs of the DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and 16-bit transfers can be mixed freely.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>IWIDTH</name>
                        <description>Configure whether this FIFO record is transferred with single/dual/quad interface width (0/1/2). Different widths can be mixed freely.</description>
                        <bitRange>[17:16]</bitRange>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>S</name>
                                <value>0</value>
                                <description>Single width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>D</name>
                                <value>1</value>
                                <description>Dual width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Q</name>
                                <value>2</value>
                                <description>Quad width</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATA</name>
                        <description>Data pushed here will be clocked out falling edges of SCK (or before the very first rising edge of SCK, if this is the first pulse). For each byte clocked out, the interface will simultaneously sample one byte, on rising edges of SCK, and push this to the DIRECT_RX FIFO.

                            For 16-bit data, the least-significant byte is transmitted first.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DIRECT_RX</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Receive FIFO for direct mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIRECT_RX</name>
                        <description>With each byte clocked out on the serial interface, one byte will simultaneously be clocked in, and will appear in this FIFO. The serial interface will stall when this FIFO is full, to avoid dropping data.

                            When 16-bit data is pushed into the TX FIFO, the corresponding RX FIFO push will also contain 16 bits of data. The least-significant byte is the first one received.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>M0_TIMING</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Timing configuration register for memory address window 0.</description>
                <resetValue>0x40000004</resetValue>
                <fields>
                    <field>
                        <name>COOLDOWN</name>
                        <description>Chip select cooldown period. When a memory transfer finishes, the chip select remains asserted for 64 x COOLDOWN system clock cycles, plus half an SCK clock period (rounded up for odd SCK divisors). After this cooldown expires, the chip select is always deasserted to save power.

                            If the next memory access arrives within the cooldown period, the QMI may be able to append more SCK cycles to the currently ongoing SPI transfer, rather than starting a new transfer. This reduces access latency and increases bus throughput.

                            Specifically, the next access must be in the same direction (read/write), access the same memory window (chip select 0/1), and follow sequentially the address of the last transfer. If any of these are false, the new access will first deassert the chip select, then begin a new transfer.

                            If COOLDOWN is 0, the address alignment configured by PAGEBREAK has been reached, or the total chip select assertion limit MAX_SELECT has been reached, the cooldown period is skipped, and the chip select will always be deasserted one half SCK period after the transfer finishes.</description>
                        <bitRange>[31:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAGEBREAK</name>
                        <description>When page break is enabled, chip select will automatically deassert when crossing certain power-of-2-aligned address boundaries. The next access will always begin a new read/write SPI burst, even if the address of the next access follows in sequence with the last access before the page boundary.

                            Some flash and PSRAM devices forbid crossing page boundaries with a single read/write transfer, or restrict the operating frequency for transfers that do cross page a boundary. This option allows the QMI to safely support those devices.

                            This field has no effect when COOLDOWN is disabled.</description>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                                <description>No page boundary is enforced</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                                <description>Break bursts crossing a 256-byte page boundary</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>2</value>
                                <description>Break bursts crossing a 1024-byte quad-page boundary</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4096</name>
                                <value>3</value>
                                <description>Break bursts crossing a 4096-byte sector boundary</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SELECT_SETUP</name>
                        <description>Add up to one additional system clock cycle of setup between chip select assertion and the first rising edge of SCK.

                            The default setup time is one half SCK period, which is usually sufficient except for very high SCK frequencies with some flash devices.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SELECT_HOLD</name>
                        <description>Add up to three additional system clock cycles of active hold between the last falling edge of SCK and the deassertion of this window&#39;s chip select.

                            The default hold time is one system clock cycle. Note that flash datasheets usually give chip select active hold time from the last *rising* edge of SCK, and so even zero hold from the last falling edge would be safe.

                            Note that this is a minimum hold time guaranteed by the QMI: the actual chip select active hold may be slightly longer for read transfers with low clock divisors and/or high sample delays. Specifically, if the point two cycles after the last RX data sample is later than the last SCK falling edge, then the hold time is measured from *this* point.

                            Note also that, in case the final SCK pulse is masked to save energy (true for non-DTR reads when COOLDOWN is disabled or PAGE_BREAK is reached), all of QMI&#39;s timing logic behaves as though the clock pulse were still present. The SELECT_HOLD time is applied from the point where the last SCK falling edge would be if the clock pulse were not masked.</description>
                        <bitRange>[24:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MAX_SELECT</name>
                        <description>Enforce a maximum assertion duration for this window&#39;s chip select, in units of 64 system clock cycles. If 0, the QMI is permitted to keep the chip select asserted indefinitely when servicing sequential memory accesses (see COOLDOWN).

                            This feature is required to meet timing constraints of PSRAM devices, which specify a maximum chip select assertion so they can perform DRAM refresh cycles. See also MIN_DESELECT, which can enforce a minimum deselect time.

