cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            If the next memory access arrives within the cooldown period, the QMI may be able to append more SCK cycles to the currently ongoing SPI transfer, rather than starting a new transfer. This reduces access latency and increases bus throughput.

                            Specifically, the next access must be in the same direction (read/write), access the same memory window (chip select 0/1), and follow sequentially the address of the last transfer. If any of these are false, the new access will first deassert the chip select, then begin a new transfer.

                            If COOLDOWN is 0, the address alignment configured by PAGEBREAK has been reached, or the total chip select assertion limit MAX_SELECT has been reached, the cooldown period is skipped, and the chip select will always be deasserted one half SCK period after the transfer finishes.</description>
                        <bitRange>[31:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAGEBREAK</name>
                        <description>When page break is enabled, chip select will automatically deassert when crossing certain power-of-2-aligned address boundaries. The next access will always begin a new read/write SPI burst, even if the address of the next access follows in sequence with the last access before the page boundary.

                            Some flash and PSRAM devices forbid crossing page boundaries with a single read/write transfer, or restrict the operating frequency for transfers that do cross page a boundary. This option allows the QMI to safely support those devices.

                            This field has no effect when COOLDOWN is disabled.</description>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                                <description>No page boundary is enforced</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                                <description>Break bursts crossing a 256-byte page boundary</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>2</value>
                                <description>Break bursts crossing a 1024-byte quad-page boundary</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4096</name>
                                <value>3</value>
                                <description>Break bursts crossing a 4096-byte sector boundary</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SELECT_SETUP</name>
                        <description>Add up to one additional system clock cycle of setup between chip select assertion and the first rising edge of SCK.

                            The default setup time is one half SCK period, which is usually sufficient except for very high SCK frequencies with some flash devices.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SELECT_HOLD</name>
                        <description>Add up to three additional system clock cycles of active hold between the last falling edge of SCK and the deassertion of this window&#39;s chip select.

                            The default hold time is one system clock cycle. Note that flash datasheets usually give chip select active hold time from the last *rising* edge of SCK, and so even zero hold from the last falling edge would be safe.

                            Note that this is a minimum hold time guaranteed by the QMI: the actual chip select active hold may be slightly longer for read transfers with low clock divisors and/or high sample delays. Specifically, if the point two cycles after the last RX data sample is later than the last SCK falling edge, then the hold time is measured from *this* point.

                            Note also that, in case the final SCK pulse is masked to save energy (true for non-DTR reads when COOLDOWN is disabled or PAGE_BREAK is reached), all of QMI&#39;s timing logic behaves as though the clock pulse were still present. The SELECT_HOLD time is applied from the point where the last SCK falling edge would be if the clock pulse were not masked.</description>
                        <bitRange>[24:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MAX_SELECT</name>
                        <description>Enforce a maximum assertion duration for this window&#39;s chip select, in units of 64 system clock cycles. If 0, the QMI is permitted to keep the chip select asserted indefinitely when servicing sequential memory accesses (see COOLDOWN).

                            This feature is required to meet timing constraints of PSRAM devices, which specify a maximum chip select assertion so they can perform DRAM refresh cycles. See also MIN_DESELECT, which can enforce a minimum deselect time.

                            If a memory access is in progress at the time MAX_SELECT is reached, the QMI will wait for the access to complete before deasserting the chip select. This additional time must be accounted for to calculate a safe MAX_SELECT value. In the worst case, this may be a fully-formed serial transfer, including command prefix and address, with a data payload as large as one cache line.</description>
                        <bitRange>[22:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MIN_DESELECT</name>
                        <description>After this window&#39;s chip select is deasserted, it remains deasserted for half an SCK cycle (rounded up to an integer number of system clock cycles), plus MIN_DESELECT additional system clock cycles, before the QMI reasserts either chip select pin.

