cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ATRANS7</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Configure address translation for XIP virtual addresses 0x1c00000 through 0x1ffffff (a 4 MiB window starting at +28 MiB).

                    Address translation allows a program image to be executed in place at multiple physical flash addresses (for example, a double-buffered flash image for over-the-air updates), without the overhead of position-independent code.

                    At reset, the address translation registers are initialised to an identity mapping, so that they can be ignored if address translation is not required.

                    Note that the XIP cache is fully virtually addressed, so a cache flush is required after changing the address translation.</description>
                <resetValue>0x04000c00</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Translation aperture size for this virtual address range, in units of 4 kiB (one flash sector).

                            Bits 21:12 of the virtual address are compared to SIZE. Offsets greater than SIZE return a bus error, and do not cause a QSPI access.</description>
                        <bitRange>[26:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BASE</name>
                        <description>Physical address base for this virtual address range, in units of 4 kiB (one flash sector).

                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>XIP_CTRL</name>
        <description>QSPI flash execute-in-place block</description>
        <baseAddress>0x400c8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>32</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Cache control register. Read-only from a Non-secure context.</description>
                <resetValue>0x00000083</resetValue>
                <fields>
                    <field>
                        <name>WRITABLE_M1</name>
                        <description>If 1, enable writes to XIP memory window 1 (addresses 0x11000000 through 0x11ffffff, and their uncached mirrors). If 0, this region is read-only.

                            XIP memory is *read-only by default*. This bit must be set to enable writes if a RAM device is attached on QSPI chip select 1.

                            The default read-only behaviour avoids two issues with writing to a read-only QSPI device (e.g. flash). First, a write will initially appear to succeed due to caching, but the data will eventually be lost when the written line is evicted, causing unpredictable behaviour.

                            Second, when a written line is evicted, it will cause a write command to be issued to the flash, which can break the flash out of its continuous read mode. After this point, flash reads will return garbage. This is a security concern, as it allows Non-secure software to break Secure flash reads if it has permission to write to any flash address.

                            Note the read-only behaviour is implemented by downgrading writes to reads, so writes will still cause allocation of an address, but have no other effect.</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WRITABLE_M0</name>
                        <description>If 1, enable writes to XIP memory window 0 (addresses 0x10000000 through 0x10ffffff, and their uncached mirrors). If 0, this region is read-only.

                            XIP memory is *read-only by default*. This bit must be set to enable writes if a RAM device is attached on QSPI chip select 0.

                            The default read-only behaviour avoids two issues with writing to a read-only QSPI device (e.g. flash). First, a write will initially appear to succeed due to caching, but the data will eventually be lost when the written line is evicted, causing unpredictable behaviour.

                            Second, when a written line is evicted, it will cause a write command to be issued to the flash, which can break the flash out of its continuous read mode. After this point, flash reads will return garbage. This is a security concern, as it allows Non-secure software to break Secure flash reads if it has permission to write to any flash address.

                            Note the read-only behaviour is implemented by downgrading writes to reads, so writes will still cause allocation of an address, but have no other effect.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SPLIT_WAYS</name>
                        <description>When 1, route all cached+Secure accesses to way 0 of the cache, and route all cached+Non-secure accesses to way 1 of the cache.

