cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PLL_SYS</name>
        <baseAddress>0x40050000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>32</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>PLL_SYS_IRQ</name>
            <value>42</value>
        </interrupt>
        <registers>
            <register>
                <name>CS</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and Status 
                    GENERAL CONSTRAINTS: 
                    Reference clock frequency min=5MHz, max=800MHz 
                    Feedback divider min=16, max=320 
                    VCO frequency min=750MHz, max=1600MHz</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>LOCK</name>
                        <description>PLL is locked</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LOCK_N</name>
                        <description>PLL is not locked 
                            Ideally this is cleared when PLL lock is seen and this should never normally be set</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>BYPASS</name>
                        <description>Passes the reference clock to the output instead of the divided VCO. The VCO continues to run so the user can switch between the reference clock and the divided VCO but the output will glitch when doing so.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REFDIV</name>
                        <description>Divides the PLL input reference clock. 
                            Behaviour is undefined for div=0. 
                            PLL output will be unpredictable during refdiv changes, wait for lock=1 before using it.</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWR</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Controls the PLL power modes.</description>
                <resetValue>0x0000002d</resetValue>
                <fields>
                    <field>
                        <name>VCOPD</name>
                        <description>PLL VCO powerdown 
                            To save power set high when PLL output not required or bypass=1.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POSTDIVPD</name>
                        <description>PLL post divider powerdown 
                            To save power set high when PLL output not required or bypass=1.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DSMPD</name>
                        <description>PLL DSM powerdown 
                            Nothing is achieved by setting this low.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PD</name>
                        <description>PLL powerdown 
                            To save power set high when PLL output not required.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FBDIV_INT</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Feedback divisor 
                    (note: this PLL does not support fractional division)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBDIV_INT</name>
                        <description>see ctrl reg description for constraints</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PRIM</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Controls the PLL post dividers for the primary output 
                    (note: this PLL does not have a secondary output) 
                    the primary output is driven from VCO divided by postdiv1*postdiv2</description>
                <resetValue>0x00077000</resetValue>
                <fields>
                    <field>
                        <name>POSTDIV1</name>
                        <description>divide by 1-7</description>
                        <bitRange>[18:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POSTDIV2</name>
                        <description>divide by 1-7</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCK_N_STICKY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Interrupt Enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCK_N_STICKY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Interrupt Force</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCK_N_STICKY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Interrupt status after masking &amp; forcing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCK_N_STICKY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
