cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="PLL_SYS">
        <name>PLL_USB</name>
        <baseAddress>0x40058000</baseAddress>
        <interrupt>
        <name>PLL_USB_IRQ</name>
        <value>43</value>
    </interrupt>
    </peripheral>
    <peripheral>
        <name>ACCESSCTRL</name>
        <description>Hardware access control registers</description>
        <baseAddress>0x40060000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>236</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>LOCK</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Once a LOCK bit is written to 1, ACCESSCTRL silently ignores writes from that master. LOCK is writable only by a Secure, Privileged processor or debugger.

                    LOCK bits are only writable when their value is zero. Once set, they can never be cleared, except by a full reset of ACCESSCTRL

                    Setting the LOCK bit does not affect whether an access raises a bus error. Unprivileged writes, or writes from the DMA, will continue to raise bus errors. All other accesses will continue not to.</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>DEBUG</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FORCE_CORE_NS</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Force core 1&#39;s bus accesses to always be Non-secure, no matter the core&#39;s internal state.

                    Useful for schemes where one core is designated as the Non-secure core, since some peripherals may filter individual registers internally based on security state but not on master ID.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CORE1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CFGRESET</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Write 1 to reset all ACCESSCTRL configuration, except for the LOCK and FORCE_CORE_NS registers.

                    This bit is used in the RP2350 bootrom to quickly restore ACCESSCTRL to a known state during the boot path.

                    Note that, like all registers in ACCESSCTRL, this register is not writable when the writer&#39;s corresponding LOCK bit is set, therefore a master which has been locked out of ACCESSCTRL can not use the CFGRESET register to disturb its contents.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CFGRESET</name>
                        <bitRange>[0:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_NSMASK0</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Control whether GPIO0...31 are accessible to Non-secure code. Writable only by a Secure, Privileged processor or debugger.

                    0 -&gt; Secure access only

                    1 -&gt; Secure + Non-secure access</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_NSMASK0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_NSMASK1</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Control whether GPIO32..47 are accessible to Non-secure code, and whether QSPI and USB bitbang are accessible through the Non-secure SIO. Writable only by a Secure, Privileged processor or debugger.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ROM</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access ROM, and at what security/privilege levels they can do so.

