cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, SPI0 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, SPI0 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, SPI0 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, SPI0 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, SPI0 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, SPI0 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, SPI0 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, SPI0 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI1</name>
                <addressOffset>0x00000094</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access SPI1, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, SPI1 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, SPI1 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, SPI1 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, SPI1 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, SPI1 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, SPI1 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, SPI1 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, SPI1 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0</name>
                <addressOffset>0x00000098</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access TIMER0, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, TIMER0 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, TIMER0 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, TIMER0 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, TIMER0 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, TIMER0 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, TIMER0 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, TIMER0 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, TIMER0 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1</name>
                <addressOffset>0x0000009c</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access TIMER1, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, TIMER1 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, TIMER1 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, TIMER1 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, TIMER1 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, TIMER1 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, TIMER1 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, TIMER1 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, TIMER1 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UART0</name>
                <addressOffset>0x000000a0</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access UART0, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, UART0 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, UART0 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, UART0 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, UART0 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, UART0 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, UART0 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, UART0 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, UART0 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UART1</name>
                <addressOffset>0x000000a4</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access UART1, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000fc</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, UART1 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, UART1 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, UART1 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, UART1 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, UART1 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, UART1 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, UART1 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, UART1 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OTP</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access OTP, and at what security/privilege levels they can do so.

                    Defaults to Secure access from any master.

