cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>UARTIFLS</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Interrupt FIFO Level Select Register, UARTIFLS</description>
                <resetValue>0x00000012</resetValue>
                <fields>
                    <field>
                        <name>RXIFLSEL</name>
                        <description>Receive interrupt FIFO level select. The trigger points for the receive interrupt are as follows: b000 = Receive FIFO becomes &gt;= 1 / 8 full b001 = Receive FIFO becomes &gt;= 1 / 4 full b010 = Receive FIFO becomes &gt;= 1 / 2 full b011 = Receive FIFO becomes &gt;= 3 / 4 full b100 = Receive FIFO becomes &gt;= 7 / 8 full b101-b111 = reserved.</description>
                        <bitRange>[5:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXIFLSEL</name>
                        <description>Transmit interrupt FIFO level select. The trigger points for the transmit interrupt are as follows: b000 = Transmit FIFO becomes &lt;= 1 / 8 full b001 = Transmit FIFO becomes &lt;= 1 / 4 full b010 = Transmit FIFO becomes &lt;= 1 / 2 full b011 = Transmit FIFO becomes &lt;= 3 / 4 full b100 = Transmit FIFO becomes &lt;= 7 / 8 full b101-b111 = reserved.</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTIMSC</name>
                <addressOffset>0x00000038</addressOffset>
                <description>Interrupt Mask Set/Clear Register, UARTIMSC</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OEIM</name>
                        <description>Overrun error interrupt mask. A read returns the current mask for the UARTOEINTR interrupt. On a write of 1, the mask of the UARTOEINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BEIM</name>
                        <description>Break error interrupt mask. A read returns the current mask for the UARTBEINTR interrupt. On a write of 1, the mask of the UARTBEINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PEIM</name>
                        <description>Parity error interrupt mask. A read returns the current mask for the UARTPEINTR interrupt. On a write of 1, the mask of the UARTPEINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FEIM</name>
                        <description>Framing error interrupt mask. A read returns the current mask for the UARTFEINTR interrupt. On a write of 1, the mask of the UARTFEINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RTIM</name>
                        <description>Receive timeout interrupt mask. A read returns the current mask for the UARTRTINTR interrupt. On a write of 1, the mask of the UARTRTINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXIM</name>
                        <description>Transmit interrupt mask. A read returns the current mask for the UARTTXINTR interrupt. On a write of 1, the mask of the UARTTXINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXIM</name>
                        <description>Receive interrupt mask. A read returns the current mask for the UARTRXINTR interrupt. On a write of 1, the mask of the UARTRXINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DSRMIM</name>
                        <description>nUARTDSR modem interrupt mask. A read returns the current mask for the UARTDSRINTR interrupt. On a write of 1, the mask of the UARTDSRINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DCDMIM</name>
                        <description>nUARTDCD modem interrupt mask. A read returns the current mask for the UARTDCDINTR interrupt. On a write of 1, the mask of the UARTDCDINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTSMIM</name>
                        <description>nUARTCTS modem interrupt mask. A read returns the current mask for the UARTCTSINTR interrupt. On a write of 1, the mask of the UARTCTSINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RIMIM</name>
                        <description>nUARTRI modem interrupt mask. A read returns the current mask for the UARTRIINTR interrupt. On a write of 1, the mask of the UARTRIINTR interrupt is set. A write of 0 clears the mask.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTRIS</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Raw Interrupt Status Register, UARTRIS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OERIS</name>
                        <description>Overrun error interrupt status. Returns the raw interrupt state of the UARTOEINTR interrupt.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BERIS</name>
                        <description>Break error interrupt status. Returns the raw interrupt state of the UARTBEINTR interrupt.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PERIS</name>
                        <description>Parity error interrupt status. Returns the raw interrupt state of the UARTPEINTR interrupt.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FERIS</name>
                        <description>Framing error interrupt status. Returns the raw interrupt state of the UARTFEINTR interrupt.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RTRIS</name>
                        <description>Receive timeout interrupt status. Returns the raw interrupt state of the UARTRTINTR interrupt. a</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXRIS</name>
                        <description>Transmit interrupt status. Returns the raw interrupt state of the UARTTXINTR interrupt.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXRIS</name>
                        <description>Receive interrupt status. Returns the raw interrupt state of the UARTRXINTR interrupt.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DSRRMIS</name>
                        <description>nUARTDSR modem interrupt status. Returns the raw interrupt state of the UARTDSRINTR interrupt.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DCDRMIS</name>
                        <description>nUARTDCD modem interrupt status. Returns the raw interrupt state of the UARTDCDINTR interrupt.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CTSRMIS</name>
                        <description>nUARTCTS modem interrupt status. Returns the raw interrupt state of the UARTCTSINTR interrupt.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RIRMIS</name>
                        <description>nUARTRI modem interrupt status. Returns the raw interrupt state of the UARTRIINTR interrupt.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTMIS</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Masked Interrupt Status Register, UARTMIS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OEMIS</name>
                        <description>Overrun error masked interrupt status. Returns the masked interrupt state of the UARTOEINTR interrupt.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BEMIS</name>
                        <description>Break error masked interrupt status. Returns the masked interrupt state of the UARTBEINTR interrupt.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PEMIS</name>
                        <description>Parity error masked interrupt status. Returns the masked interrupt state of the UARTPEINTR interrupt.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FEMIS</name>
                        <description>Framing error masked interrupt status. Returns the masked interrupt state of the UARTFEINTR interrupt.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RTMIS</name>
                        <description>Receive timeout masked interrupt status. Returns the masked interrupt state of the UARTRTINTR interrupt.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXMIS</name>
                        <description>Transmit masked interrupt status. Returns the masked interrupt state of the UARTTXINTR interrupt.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXMIS</name>
                        <description>Receive masked interrupt status. Returns the masked interrupt state of the UARTRXINTR interrupt.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DSRMMIS</name>
                        <description>nUARTDSR modem masked interrupt status. Returns the masked interrupt state of the UARTDSRINTR interrupt.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DCDMMIS</name>
                        <description>nUARTDCD modem masked interrupt status. Returns the masked interrupt state of the UARTDCDINTR interrupt.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CTSMMIS</name>
                        <description>nUARTCTS modem masked interrupt status. Returns the masked interrupt state of the UARTCTSINTR interrupt.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RIMMIS</name>
                        <description>nUARTRI modem masked interrupt status. Returns the masked interrupt state of the UARTRIINTR interrupt.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTICR</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Interrupt Clear Register, UARTICR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OEIC</name>
                        <description>Overrun error interrupt clear. Clears the UARTOEINTR interrupt.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>BEIC</name>
                        <description>Break error interrupt clear. Clears the UARTBEINTR interrupt.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>PEIC</name>
                        <description>Parity error interrupt clear. Clears the UARTPEINTR interrupt.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>FEIC</name>
                        <description>Framing error interrupt clear. Clears the UARTFEINTR interrupt.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RTIC</name>
                        <description>Receive timeout interrupt clear. Clears the UARTRTINTR interrupt.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>TXIC</name>
                        <description>Transmit interrupt clear. Clears the UARTTXINTR interrupt.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RXIC</name>
                        <description>Receive interrupt clear. Clears the UARTRXINTR interrupt.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DSRMIC</name>
                        <description>nUARTDSR modem interrupt clear. Clears the UARTDSRINTR interrupt.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DCDMIC</name>
                        <description>nUARTDCD modem interrupt clear. Clears the UARTDCDINTR interrupt.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CTSMIC</name>
                        <description>nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RIMIC</name>
                        <description>nUARTRI modem interrupt clear. Clears the UARTRIINTR interrupt.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTDMACR</name>
                <addressOffset>0x00000048</addressOffset>
                <description>DMA Control Register, UARTDMACR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DMAONERR</name>
                        <description>DMA on error. If this bit is set to 1, the DMA receive request outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when the UART error interrupt is asserted.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXDMAE</name>
                        <description>Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXDMAE</name>
                        <description>Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID0</name>
                <addressOffset>0x00000fe0</addressOffset>
                <description>UARTPeriphID0 Register</description>
                <resetValue>0x00000011</resetValue>
                <fields>
                    <field>
                        <name>PARTNUMBER0</name>
                        <description>These bits read back as 0x11</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID1</name>
                <addressOffset>0x00000fe4</addressOffset>
                <description>UARTPeriphID1 Register</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>DESIGNER0</name>
                        <description>These bits read back as 0x1</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PARTNUMBER1</name>
                        <description>These bits read back as 0x0</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID2</name>
                <addressOffset>0x00000fe8</addressOffset>
                <description>UARTPeriphID2 Register</description>
                <resetValue>0x00000034</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>This field depends on the revision of the UART: r1p0 0x0 r1p1 0x1 r1p3 0x2 r1p4 0x2 r1p5 0x3</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DESIGNER1</name>
                        <description>These bits read back as 0x4</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
