cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>UARTPERIPHID3</name>
                <addressOffset>0x00000fec</addressOffset>
                <description>UARTPeriphID3 Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CONFIGURATION</name>
                        <description>These bits read back as 0x00</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID0</name>
                <addressOffset>0x00000ff0</addressOffset>
                <description>UARTPCellID0 Register</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID0</name>
                        <description>These bits read back as 0x0D</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID1</name>
                <addressOffset>0x00000ff4</addressOffset>
                <description>UARTPCellID1 Register</description>
                <resetValue>0x000000f0</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID1</name>
                        <description>These bits read back as 0xF0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID2</name>
                <addressOffset>0x00000ff8</addressOffset>
                <description>UARTPCellID2 Register</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID2</name>
                        <description>These bits read back as 0x05</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID3</name>
                <addressOffset>0x00000ffc</addressOffset>
                <description>UARTPCellID3 Register</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID3</name>
                        <description>These bits read back as 0xB1</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
        <name>UART1</name>
        <baseAddress>0x40078000</baseAddress>
        <interrupt>
        <name>UART1_IRQ</name>
        <value>34</value>
    </interrupt>
    </peripheral>
    <peripheral>
        <name>ROSC</name>
        <baseAddress>0x400e8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>40</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Ring Oscillator control</description>
                <resetValue>0x00000aa0</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>On power-up this field is initialised to ENABLE 
                            The system clock must be switched to another source before setting this field to DISABLE otherwise the chip will lock up 
                            The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
                        <bitRange>[23:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLE</name>
                                <value>3358</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE</name>
                                <value>4011</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FREQ_RANGE</name>
                        <description>Controls the number of delay stages in the ROSC ring 
                            LOW uses stages 0 to 7 
                            MEDIUM uses stages 2 to 7 
                            HIGH uses stages 4 to 7 
                            TOOHIGH uses stages 6 to 7 and should not be used because its frequency exceeds design specifications 
                            The clock output will not glitch when changing the range up one step at a time 
                            The clock output will glitch when changing the range down 
                            Note: the values here are gray coded which is why HIGH comes before TOOHIGH</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>4004</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MEDIUM</name>
                                <value>4005</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>4007</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TOOHIGH</name>
                                <value>4006</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>FREQA</name>
                <addressOffset>0x00000004</addressOffset>
                <description>The FREQA &amp; FREQB registers control the frequency by controlling the drive strength of each stage 
                    The drive strength has 4 levels determined by the number of bits set 
                    Increasing the number of bits set increases the drive strength and increases the oscillation frequency 
                    0 bits set is the default drive strength 
                    1 bit set doubles the drive strength 
                    2 bits set triples drive strength 
                    3 bits set quadruples drive strength 
                    For frequency randomisation set both DS0_RANDOM=1 &amp; DS1_RANDOM=1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PASSWD</name>
                        <description>Set to 0x9696 to apply the settings 
                            Any other value in this field will set all drive strengths to 0</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PASS</name>
                                <value>38550</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DS3</name>
                        <description>Stage 3 drive strength</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS2</name>
                        <description>Stage 2 drive strength</description>
                        <bitRange>[10:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS1_RANDOM</name>
                        <description>Randomises the stage 1 drive strength</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS1</name>
                        <description>Stage 1 drive strength</description>
                        <bitRange>[6:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS0_RANDOM</name>
                        <description>Randomises the stage 0 drive strength</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS0</name>
                        <description>Stage 0 drive strength</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FREQB</name>
                <addressOffset>0x00000008</addressOffset>
                <description>For a detailed description see freqa register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PASSWD</name>
                        <description>Set to 0x9696 to apply the settings 
                            Any other value in this field will set all drive strengths to 0</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PASS</name>
                                <value>38550</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DS7</name>
                        <description>Stage 7 drive strength</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS6</name>
                        <description>Stage 6 drive strength</description>
                        <bitRange>[10:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS5</name>
                        <description>Stage 5 drive strength</description>
                        <bitRange>[6:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DS4</name>
                        <description>Stage 4 drive strength</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RANDOM</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Loads a value to the LFSR randomiser</description>
                <resetValue>0x3f04b16d</resetValue>
                <fields>
                    <field>
                        <name>SEED</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DORMANT</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Ring Oscillator pause control</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DORMANT</name>
                        <description>This is used to save power by pausing the ROSC 
                            On power-up this field is initialised to WAKE 
                            An invalid write will also select WAKE 
                            Warning: setup the irq before selecting dormant mode</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>dormant</name>
                                <value>1668246881</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAKE</name>
                                <value>2002873189</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>DIV</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Controls the output divider</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DIV</name>
                        <description>set to 0xaa00 + div where 
                            div = 0 divides by 128 
                            div = 1-127 divides by div 
                            any other value sets div=128 
                            this register resets to div=32</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PASS</name>
                                <value>43520</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>PHASE</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Controls the phase shifted output</description>
                <resetValue>0x00000008</resetValue>
                <fields>
                    <field>
                        <name>PASSWD</name>
                        <description>set to 0xaa 
                            any other value enables the output with shift=0</description>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>enable the phase-shifted output 
                            this can be changed on-the-fly</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FLIP</name>
                        <description>invert the phase-shifted output 
                            this is ignored when div=1</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SHIFT</name>
                        <description>phase shift the phase-shifted output by SHIFT input clocks 
                            this can be changed on-the-fly 
                            must be set to 0 before setting div=1</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>STATUS</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Ring Oscillator Status</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STABLE</name>
                        <description>Oscillator is running and stable</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BADWRITE</name>
                        <description>An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE or FREQA or FREQB or DIV or PHASE or DORMANT</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DIV_RUNNING</name>
                        <description>post-divider is running 
                            this resets to 0 but transitions to 1 during chip startup</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLED</name>
                        <description>Oscillator is enabled but not necessarily running and stable 
                            this resets to 0 but transitions to 1 during chip startup</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RANDOMBIT</name>
                <addressOffset>0x00000020</addressOffset>
                <description>This just reads the state of the oscillator output so randomness is compromised if the ring oscillator is stopped or run at a harmonic of the bus frequency</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>RANDOMBIT</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>COUNT</name>
                <addressOffset>0x00000024</addressOffset>
                <description>A down counter running at the ROSC frequency which counts to zero and stops. 
                    To start the counter write a non-zero value. 
                    Can be used for short software pauses when setting up time sensitive hardware.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>COUNT</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
