cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>CHIP_RESET</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Chip reset control and status</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>HAD_WATCHDOG_RESET_RSM</name>
                        <description>
                            Last reset was a watchdog timeout which was configured to reset the power-on state machine.
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              no\n
                            powman             no\n
                            swcore             no\n
                            psm                yes\n
                            and does not change the power state
                        </description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_HZD_SYS_RESET_REQ</name>
                        <description>Last reset was a system reset from the hazard debugger.
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              no\n
                            powman             no\n
                            swcore             no\n
                            psm                yes\n
                            and does not change the power state
                        </description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_GLITCH_DETECT</name>
                        <description>
                            Last reset was due to a power supply glitch. This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              no\n
                            powman             no\n
                            swcore             no\n
                            psm                yes\n
                            and does not change the power state
                        </description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_SWCORE_PD</name>
                        <description>
                            Last reset was a switched core powerdown. This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              no\n
                            powman             no\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_WATCHDOG_RESET_SWCORE</name>
                        <description>
                            Last reset was a watchdog timeout which was configured to reset the switched-core.
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              no\n
                            powman             no\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_WATCHDOG_RESET_POWMAN</name>
                        <description>
                            Last reset was a watchdog timeout which was configured to reset the power manager.
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_WATCHDOG_RESET_POWMAN_ASYNC</name>
                        <description>
                            Last reset was a watchdog timeout which was configured to reset the power manager asynchronously.
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_RESCUE</name>
                        <description>
                            Last reset was a rescue reset from the debugger\n
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        no, it sets this flag\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_DP_RESET_REQ</name>
                        <description>
                            Last reset was an reset request from the arm debugger\n
                            This resets:\n
                            double_tap flag    no\n
                            DP                 no\n
                            RPAP               no\n
                            rescue_flag        yes\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_RUN_LOW</name>
                        <description>
                            Last reset was from the RUN pin. This resets:\n
                            double_tap flag    no\n
                            DP                 yes\n
                            RPAP               yes\n
                            rescue_flag        yes\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_BOR</name>
                        <description>
                            Last reset was from the brown-out detection block\n
                            This resets:\n
                            double_tap flag    yes\n
                            DP                 yes\n
                            RPAP               yes\n
                            rescue_flag        yes\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAD_POR</name>
                        <description>
                            Last reset was from the power-on reset. This resets:\n
                            double_tap flag    yes\n
                            DP                 yes\n
                            RPAP               yes\n
                            rescue_flag        yes\n
                            timer              yes\n
                            powman             yes\n
                            swcore             yes\n
                            psm                yes\n
                            then starts the power sequencer
                        </description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RESCUE_FLAG</name>
                        <description>This is set by a rescue reset from the RP-AP. 
                            Its purpose is to halt before the bootrom before booting from flash in order to recover from a boot lock-up. 
                            The debugger can then attach once the bootrom has been halted and flash some working code that does not lock up.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DOUBLE_TAP</name>
                        <description>This flag is set by double-tapping RUN. It tells bootcode to go into the bootloader.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WDSEL</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Allows a watchdog reset to reset the internal state of powman in addition to the power-on state machine (PSM). 
                    Note that powman ignores watchdog resets that do not select at least the CLOCKS stage or earlier stages in the PSM. If using these bits, it&#39;s recommended to set PSM_WDSEL to all-ones in addition to the desired bits in this register. Failing to select CLOCKS or earlier will result in the POWMAN_WDSEL register having no effect.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESET_RSM</name>
                        <description>If set to 1, a watchdog reset will run the full power-on state machine (PSM) sequence 
                            From a user perspective it is the same as setting RSM_WDSEL_PROC_COLD 
                            From a hardware debug perspective it has the same effect as a reset from a glitch detector</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET_SWCORE</name>
                        <description>If set to 1, a watchdog reset will reset the switched core power domain and run the full power-on state machine (PSM) sequence 
                            From a user perspective it is the same as setting RSM_WDSEL_PROC_COLD 
                            From a hardware debug perspective it has the same effect as a power-on reset for the switched core power domain</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET_POWMAN</name>
                        <description>If set to 1, a watchdog reset will restore powman defaults, reset the timer, reset the switched core power domain 
                            and run the full power-on state machine (PSM) sequence 
                            This relies on clk_ref running. Use reset_powman_async if that may not be true</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET_POWMAN_ASYNC</name>
                        <description>If set to 1, a watchdog reset will restore powman defaults, reset the timer, 
                            reset the switched core domain and run the full power-on state machine (PSM) sequence 
                            This does not rely on clk_ref running</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SEQ_CFG</name>
                <addressOffset>0x00000034</addressOffset>
                <description>For configuration of the power sequencer 
                    Writes are ignored while POWMAN_STATE_CHANGING=1</description>
                <resetValue>0x001011f0</resetValue>
                <fields>
                    <field>
                        <name>USING_FAST_POWCK</name>
                        <description>0 indicates the POWMAN clock is running from the low power oscillator (32kHz) 
                            1 indicates the POWMAN clock is running from the reference clock (2-50MHz)</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USING_BOD_LP</name>
                        <description>Indicates the brown-out detector (BOD) mode 
                            0 = BOD high power mode which is the default 
                            1 = BOD low power mode</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USING_VREG_LP</name>
                        <description>Indicates the voltage regulator (VREG) mode 
                            0 = VREG high power mode which is the default 
                            1 = VREG low power mode</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USE_FAST_POWCK</name>
                        <description>selects the reference clock (clk_ref) as the source of the POWMAN clock when switched-core is powered. The POWMAN clock always switches to the slow clock (lposc) when switched-core is powered down because the fast clock stops running. 
                            0 always run the POWMAN clock from the slow clock (lposc) 
                            1 run the POWMAN clock from the fast clock when available 
                            This setting takes effect when a power up sequence is next run</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RUN_LPOSC_IN_LP</name>
                        <description>Set to 0 to stop the low power osc when the switched-core is powered down, which is unwise if using it to clock the timer 
                            This setting takes effect when the swcore is next powered down</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USE_BOD_HP</name>
                        <description>Set to 0 to prevent automatic switching to bod high power mode when switched-core is powered up 
                            This setting takes effect when the swcore is next powered up</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USE_BOD_LP</name>
                        <description>Set to 0 to prevent automatic switching to bod low power mode when switched-core is powered down 
                            This setting takes effect when the swcore is next powered down</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USE_VREG_HP</name>
                        <description>Set to 0 to prevent automatic switching to vreg high power mode when switched-core is powered up 
                            This setting takes effect when the swcore is next powered up</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USE_VREG_LP</name>
                        <description>Set to 0 to prevent automatic switching to vreg low power mode when switched-core is powered down 
                            This setting takes effect when the swcore is next powered down</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HW_PWRUP_SRAM0</name>
                        <description>Specifies the power state of SRAM0 when powering up swcore from a low power state (P1.xxx) to a high power state (P0.0xx). 
                            0=power-up 
                            1=no change</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HW_PWRUP_SRAM1</name>
                        <description>Specifies the power state of SRAM1 when powering up swcore from a low power state (P1.xxx) to a high power state (P0.0xx). 
                            0=power-up 
                            1=no change</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
