cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>STATE</name>
                <addressOffset>0x00000038</addressOffset>
                <description>This register controls the power state of the 4 power domains. 
                    The current power state is indicated in POWMAN_STATE_CURRENT which is read-only. 
                    To change the state, write to POWMAN_STATE_REQ. 
                    The coding of POWMAN_STATE_CURRENT &amp; POWMAN_STATE_REQ corresponds to the power states 
                    defined in the datasheet: 
                    bit 3 = SWCORE 
                    bit 2 = XIP cache 
                    bit 1 = SRAM0 
                    bit 0 = SRAM1 
                    0 = powered up 
                    1 = powered down 
                    When POWMAN_STATE_REQ is written, the POWMAN_STATE_WAITING flag is set while the Power Manager determines what is required. If an invalid transition is requested the Power Manager will still register the request in POWMAN_STATE_REQ but will also set the POWMAN_BAD_REQ flag. It will then implement the power-up requests and ignore the power down requests. To do nothing would risk entering an unrecoverable lock-up state. Invalid requests are: any combination of power up and power down requests any request that results in swcore boing powered and xip unpowered If the request is to power down the switched-core domain then POWMAN_STATE_WAITING stays active until the processors halt. During this time the POWMAN_STATE_REQ field can be re-written to change or cancel the request. When the power state transition begins the POWMAN_STATE_WAITING_flag is cleared, the POWMAN_STATE_CHANGING flag is set and POWMAN register writes are ignored until the transition completes.</description>
                <resetValue>0x0000000f</resetValue>
                <fields>
                    <field>
                        <name>CHANGING</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WAITING</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BAD_HW_REQ</name>
                        <description>Bad hardware initiated state request. Went back to state 0 (i.e. everything powered up)</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BAD_SW_REQ</name>
                        <description>Bad software initiated state request. No action taken.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PWRUP_WHILE_WAITING</name>
                        <description>Request ignored because of a pending pwrup request. See current_pwrup_req. Note this blocks powering up AND powering down.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>REQ_IGNORED</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>REQ</name>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CURRENT</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>POW_FASTDIV</name>
                <addressOffset>0x0000003c</addressOffset>
                <resetValue>0x00000040</resetValue>
                <fields>
                    <field>
                        <name>POW_FASTDIV</name>
                        <description>divides the POWMAN clock to provide a tick for the delay module and state machines 
                            when clk_pow is running from the slow clock it is not divided 
                            when clk_pow is running from the fast clock it is divided by tick_div</description>
                        <bitRange>[10:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>POW_DELAY</name>
                <addressOffset>0x00000040</addressOffset>
                <description>power state machine delays</description>
                <resetValue>0x00002011</resetValue>
                <fields>
                    <field>
                        <name>SRAM_STEP</name>
                        <description>timing between the sram0 and sram1 power state machine steps 
                            measured in units of the powman tick period (&gt;=1us), 0 gives a delay of 1 unit</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>XIP_STEP</name>
                        <description>timing between the xip power state machine steps 
                            measured in units of the lposc period, 0 gives a delay of 1 unit</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWCORE_STEP</name>
                        <description>timing between the swcore power state machine steps 
                            measured in units of the lposc period, 0 gives a delay of 1 unit</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXT_CTRL0</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Configures a gpio as a power mode aware control output</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>LP_EXIT_STATE</name>
                        <description>output level when exiting the low power state</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LP_ENTRY_STATE</name>
                        <description>output level when entering the low power state</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INIT_STATE</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INIT</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO_SELECT</name>
                        <description>selects from gpio 0-&gt;30 
                            set to 31 to disable this feature</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXT_CTRL1</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Configures a gpio as a power mode aware control output</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>LP_EXIT_STATE</name>
                        <description>output level when exiting the low power state</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LP_ENTRY_STATE</name>
                        <description>output level when entering the low power state</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INIT_STATE</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INIT</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO_SELECT</name>
                        <description>selects from gpio 0-&gt;30 
                            set to 31 to disable this feature</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXT_TIME_REF</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Select a GPIO to use as a time reference, the source can be used to drive the low power clock at 32kHz, or to provide a 1ms tick to the timer, or provide a 1Hz tick to the timer. The tick selection is controlled by the POWMAN_TIMER register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DRIVE_LPCK</name>
                        <description>Use the selected GPIO to drive the 32kHz low power clock, in place of LPOSC. This field must only be written when POWMAN_TIMER_RUN=0</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOURCE_SEL</name>
                        <description>0 -&gt;  gpio12 
                            1 -&gt;  gpio20 
                            2 -&gt;  gpio14 
                            3 -&gt;  gpio22</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LPOSC_FREQ_KHZ_INT</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Informs the AON Timer of the integer component of the clock frequency when running off the LPOSC.</description>
                <resetValue>0x00000020</resetValue>
                <fields>
                    <field>
                        <name>LPOSC_FREQ_KHZ_INT</name>
                        <description>Integer component of the LPOSC or GPIO clock source frequency in kHz. Default = 32 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LPOSC_FREQ_KHZ_FRAC</name>
                <addressOffset>0x00000054</addressOffset>
                <description>Informs the AON Timer of the fractional component of the clock frequency when running off the LPOSC.</description>
                <resetValue>0x0000c49c</resetValue>
                <fields>
                    <field>
                        <name>LPOSC_FREQ_KHZ_FRAC</name>
                        <description>Fractional component of the LPOSC or GPIO clock source frequency in kHz. Default = 0.768 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>XOSC_FREQ_KHZ_INT</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Informs the AON Timer of the integer component of the clock frequency when running off the XOSC.</description>
                <resetValue>0x00002ee0</resetValue>
                <fields>
                    <field>
                        <name>XOSC_FREQ_KHZ_INT</name>
                        <description>Integer component of the XOSC frequency in kHz. Default = 12000 Must be &gt;1 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>XOSC_FREQ_KHZ_FRAC</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Informs the AON Timer of the fractional component of the clock frequency when running off the XOSC.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>XOSC_FREQ_KHZ_FRAC</name>
                        <description>Fractional component of the XOSC frequency in kHz. This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SET_TIME_63TO48</name>
                <addressOffset>0x00000060</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SET_TIME_63TO48</name>
                        <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SET_TIME_47TO32</name>
                <addressOffset>0x00000064</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SET_TIME_47TO32</name>
                        <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SET_TIME_31TO16</name>
                <addressOffset>0x00000068</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SET_TIME_31TO16</name>
                        <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SET_TIME_15TO0</name>
                <addressOffset>0x0000006c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SET_TIME_15TO0</name>
                        <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>READ_TIME_UPPER</name>
                <addressOffset>0x00000070</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>READ_TIME_UPPER</name>
                        <description>For reading bits 63:32 of the timer. When reading all 64 bits it is possible for the LOWER count to rollover during the read. It is recommended to read UPPER, then LOWER, then re-read UPPER and, if it has changed, re-read LOWER.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>READ_TIME_LOWER</name>
                <addressOffset>0x00000074</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>READ_TIME_LOWER</name>
                        <description>For reading bits 31:0 of the timer.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ALARM_TIME_63TO48</name>
                <addressOffset>0x00000078</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_TIME_63TO48</name>
                        <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ALARM_TIME_47TO32</name>
                <addressOffset>0x0000007c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_TIME_47TO32</name>
                        <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ALARM_TIME_31TO16</name>
                <addressOffset>0x00000080</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_TIME_31TO16</name>
                        <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ALARM_TIME_15TO0</name>
                <addressOffset>0x00000084</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_TIME_15TO0</name>
                        <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
