cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>WATCHDOG</name>
        <baseAddress>0x400d8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>44</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Watchdog control 
                    The rst_wdsel register determines which subsystems are reset when the watchdog is triggered. 
                    The watchdog can be triggered in software.</description>
                <resetValue>0x07000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGGER</name>
                        <description>Trigger a watchdog reset</description>
                        <bitRange>[31:31]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>When not enabled the watchdog timer is paused</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_DBG1</name>
                        <description>Pause the watchdog timer when processor 1 is in debug mode</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_DBG0</name>
                        <description>Pause the watchdog timer when processor 0 is in debug mode</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_JTAG</name>
                        <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TIME</name>
                        <description>Indicates the time in usec before a watchdog reset will be triggered</description>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LOAD</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to approximately 16 seconds.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOAD</name>
                        <bitRange>[23:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>REASON</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.

                    Additionally, as of RP2350, a debugger warm reset of either core (SYSRESETREQ or hartreset) will also clear the watchdog reason register, so that software loaded under the debugger following a watchdog timeout will not continue to see the timeout condition.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FORCE</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <name>SCRATCH%s</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <access>read-write</access>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>DMA</name>
        <description>DMA with separate read and write masters</description>
        <baseAddress>0x50000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>3016</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>DMA_IRQ_0</name>
            <value>10</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_1</name>
            <value>11</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_2</name>
            <value>12</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_3</name>
            <value>13</value>
        </interrupt>
        <registers>
            <register>
                <dim>16</dim>
                <dimIncrement>64</dimIncrement>
                <name>CH%s_READ_ADDR</name>
                <addressOffset>0x00000000</addressOffset>
                <description>DMA Channel 0 Read Address pointer</description>
                <resetValue>0x00000000</resetValue>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>64</dimIncrement>
                <name>CH%s_WRITE_ADDR</name>
                <addressOffset>0x00000004</addressOffset>
                <description>DMA Channel 0 Write Address pointer</description>
                <resetValue>0x00000000</resetValue>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>64</dimIncrement>
                <name>CH%s_TRANS_COUNT</name>
                <addressOffset>0x00000008</addressOffset>
                <description>DMA Channel 0 Transfer Count</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MODE</name>
                        <description>When MODE is 0x0, the transfer count decrements with each transfer until 0, and then the channel triggers the next channel indicated by CTRL_CHAIN_TO.

                            When MODE is 0x1, the transfer count decrements with each transfer until 0, and then the channel re-triggers itself, in addition to the trigger indicated by CTRL_CHAIN_TO. This is useful for e.g. an endless ring-buffer DMA with periodic interrupts.

                            When MODE is 0xf, the transfer count does not decrement. The DMA channel performs an endless sequence of transfers, never triggering other channels or raising interrupts, until an ABORT is raised.

                            All other values are reserved.</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TRIGGER_SELF</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENDLESS</name>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COUNT</name>
                        <description>28-bit transfer count (256 million transfers maximum).

