cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Channels with a security/privilege (SECCFG_CHx) greater SECCFG_IRQ3) read as 0 in this register, and ignore writes.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <dim>4</dim>
                <dimIncrement>4</dimIncrement>
                <name>TIMER%s</name>
                <addressOffset>0x00000440</addressOffset>
                <description>Pacing (X/Y) fractional timer 
                    The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>X</name>
                        <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>Y</name>
                        <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MULTI_CHAN_TRIGGER</name>
                <addressOffset>0x00000450</addressOffset>
                <description>Trigger one or more channels simultaneously</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MULTI_CHAN_TRIGGER</name>
                        <description>Each bit in this register corresponds to a DMA channel. Writing a 1 to the relevant bit is the same as writing to that channel&#39;s trigger register; the channel will start if it is currently enabled and not already busy.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SNIFF_CTRL</name>
                <addressOffset>0x00000454</addressOffset>
                <description>Sniffer Control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OUT_INV</name>
                        <description>If set, the result appears inverted (bitwise complement) when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_REV</name>
                        <description>If set, the result appears bit-reversed when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BSWAP</name>
                        <description>Locally perform a byte reverse on the sniffed data, before feeding into checksum.

                            Note that the sniff hardware is downstream of the DMA channel byteswap performed in the read master: if channel CTRL_BSWAP and SNIFF_CTRL_BSWAP are both enabled, their effects cancel from the sniffer&#39;s point of view.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALC</name>
                        <bitRange>[8:5]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CRC32</name>
                                <value>0</value>
                                <description>Calculate a CRC-32 (IEEE802.3 polynomial)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CRC32R</name>
                                <value>1</value>
                                <description>Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CRC16</name>
                                <value>2</value>
                                <description>Calculate a CRC-16-CCITT</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CRC16R</name>
                                <value>3</value>
                                <description>Calculate a CRC-16-CCITT with bit reversed data</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>EVEN</name>
                                <value>14</value>
                                <description>XOR reduction over all data. == 1 if the total 1 population count is odd.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SUM</name>
                                <value>15</value>
                                <description>Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DMACH</name>
                        <description>DMA channel for Sniffer to observe</description>
                        <bitRange>[4:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable sniffer</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SNIFF_DATA</name>
                <addressOffset>0x00000458</addressOffset>
                <description>Data accumulator for sniff hardware</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SNIFF_DATA</name>
                        <description>Write an initial seed value here before starting a DMA transfer on the channel indicated by SNIFF_CTRL_DMACH. The hardware will update this register each time it observes a read from the indicated channel. Once the channel completes, the final result can be read from this register.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FIFO_LEVELS</name>
                <addressOffset>0x00000460</addressOffset>
                <description>Debug RAF, WAF, TDF levels</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RAF_LVL</name>
                        <description>Current Read-Address-FIFO fill level</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WAF_LVL</name>
                        <description>Current Write-Address-FIFO fill level</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TDF_LVL</name>
                        <description>Current Transfer-Data-FIFO fill level</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CHAN_ABORT</name>
                <addressOffset>0x00000464</addressOffset>
                <description>Abort an in-progress transfer sequence on one or more channels</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CHAN_ABORT</name>
                        <description>Each bit corresponds to a channel. Writing a 1 aborts whatever transfer sequence is in progress on that channel. The bit will remain high until any in-flight transfers have been flushed through the address and data FIFOs.

                            After writing, this register must be polled until it returns all-zero. Until this point, it is unsafe to restart the channel.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>N_CHANNELS</name>
                <addressOffset>0x00000468</addressOffset>
                <description>The number of channels this DMA instance is equipped with. This DMA supports up to 16 hardware channels, but can be configured with as few as one, to minimise silicon area.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>N_CHANNELS</name>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <name>SECCFG_CH%s</name>
                <addressOffset>0x00000480</addressOffset>
                <description>Security configuration for channel 0. Control whether this channel performs Secure/Non-secure and Privileged/Unprivileged bus accesses.

                    If this channel generates bus accesses of some security level, an access of at least that level (in the order S+P &gt; S+U &gt; NS+P &gt; NS+U) is required to program, trigger, abort, check the status of, interrupt on or acknowledge the interrupt of this channel.

                    This register automatically locks down (becomes read-only) once software starts to configure the channel.

                    This register is world-readable, but is writable only from a Secure, Privileged context.</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>LOCK</name>
                        <description>LOCK is 0 at reset, and is set to 1 automatically upon a successful write to this channel&#39;s control registers. That is, a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their aliases.

