cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            If 0, the sniffer can be accessed from either a Privileged or Unprivileged context (with sufficient security level) but can not see transfers from Privileged channels.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_CTRL</name>
                <addressOffset>0x00000500</addressOffset>
                <description>Control register for DMA MPU. Accessible only from a Privileged context.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NS_HIDE_ADDR</name>
                        <description>By default, when a region&#39;s S bit is clear, Non-secure-Privileged reads can see the region&#39;s base address and limit address. Set this bit to make the addresses appear as 0 to Non-secure reads, even when the region is Non-secure, to avoid leaking information about the processor SAU map.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Determine whether an address not covered by an active MPU region is Secure (1) or Non-secure (0)</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Determine whether an address not covered by an active MPU region is Privileged (1) or Unprivileged (0)</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>8</dimIncrement>
                <name>MPU_BAR%s</name>
                <addressOffset>0x00000504</addressOffset>
                <description>Base address register for MPU region 0. Writable only from a Secure, Privileged context.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>This MPU region matches addresses where addr[31:5] (the 27 most significant bits) are greater than or equal to BAR_ADDR, and less than or equal to LAR_ADDR.

                            Readable from any Privileged context, if and only if this region&#39;s S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>8</dim>
                <dimIncrement>8</dimIncrement>
                <name>MPU_LAR%s</name>
                <addressOffset>0x00000508</addressOffset>
                <description>Limit address register for MPU region 0. Writable only from a Secure, Privileged context, with the exception of the P bit.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Limit address bits 31:5. Readable from any Privileged context, if and only if this region&#39;s S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Determines the Secure/Non-secure (=1/0) status of addresses matching this region, if this region is enabled.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Determines the Privileged/Unprivileged (=1/0) status of addresses matching this region, if this region is enabled. Writable from any Privileged context, if and only if the S bit is clear. Otherwise, writable only from a Secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable. If 1, any address within range specified by the base address (BAR_ADDR) and limit address (LAR_ADDR) has the attributes specified by S and P.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>64</dimIncrement>
                <name>CH%s_DBG_CTDREQ</name>
                <addressOffset>0x00000800</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <dim>16</dim>
                <dimIncrement>64</dimIncrement>
                <name>CH%s_DBG_TCR</name>
                <addressOffset>0x00000804</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
