cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TIMER0</name>
        <description>Controls time and alarms

            time is a 64 bit value indicating the time since power-on

            timeh is the top 32 bits of time &amp; timel is the bottom 32 bits to change time write to timelw before timehw to read time read from timelr before timehr

            An alarm is set by setting alarm_enable and writing to the corresponding alarm register When an alarm is pending, the corresponding alarm_running signal will be high An alarm can be cancelled before it has finished by clearing the alarm_enable When an alarm fires, the corresponding alarm_irq is set and alarm_running is cleared To clear the interrupt write a 1 to the corresponding alarm_irq The timer can be locked to prevent writing</description>
        <baseAddress>0x400b0000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>76</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>TIMER0_IRQ_0</name>
            <value>0</value>
        </interrupt>
        <interrupt>
            <name>TIMER0_IRQ_1</name>
            <value>1</value>
        </interrupt>
        <interrupt>
            <name>TIMER0_IRQ_2</name>
            <value>2</value>
        </interrupt>
        <interrupt>
            <name>TIMER0_IRQ_3</name>
            <value>3</value>
        </interrupt>
        <registers>
            <register>
                <name>TIMEHW</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Write to bits 63:32 of time always write timelw before timehw</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMEHW</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMELW</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Write to bits 31:0 of time writes do not get copied to time until timehw is written</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMELW</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMEHR</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Read from bits 63:32 of time always read timelr before timehr</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMEHR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMELR</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Read from bits 31:0 of time</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMELR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <dim>4</dim>
                <dimIncrement>4</dimIncrement>
                <name>ALARM%s</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Arm alarm 0-3, and configure the time it will fire. Once armed, the alarm fires when TIMER_ALARM[0-3] == TIMELR. The alarm will disarm itself once it fires, and can be disarmed early using the ARMED status register.</description>
                <resetValue>0x00000000</resetValue>
                <access>read-write</access>
            </register>
            <register>
                <name>ARMED</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Indicates the armed/disarmed status of each alarm. A write to the corresponding ALARMx register arms the alarm. Alarms automatically disarm upon firing, but writing ones here will disarm immediately without waiting to fire.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ARMED</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMERAWH</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Raw read from bits 63:32 of time (no side effects)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMERAWH</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMERAWL</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Raw read from bits 31:0 of time (no side effects)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMERAWL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBGPAUSE</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Set bits high to enable pause when the corresponding debug ports are active</description>
                <resetValue>0x00000007</resetValue>
                <fields>
                    <field>
                        <name>DBG1</name>
                        <description>Pause when processor 1 is in debug mode</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DBG0</name>
                        <description>Pause when processor 0 is in debug mode</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PAUSE</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Set high to pause the timer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PAUSE</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LOCKED</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Set locked bit to disable write access to timer Once set, cannot be cleared (without a reset)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCKED</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SOURCE</name>
                <addressOffset>0x00000038</addressOffset>
                <description>Selects the source for the timer. Defaults to the normal tick configured in the ticks block (typically configured to 1 microsecond). Writing to 1 will ignore the tick and count clk_sys cycles instead.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK_SYS</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TICK</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLK_SYS</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>ALARM_2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>ALARM_1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>ALARM_0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Interrupt Enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Interrupt Force</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Interrupt status after masking &amp; forcing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALARM_3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ALARM_2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ALARM_1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ALARM_0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
