cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
        <name>TIMER1</name>
        <baseAddress>0x400b8000</baseAddress>
        <interrupt>
        <name>TIMER1_IRQ_0</name>
        <value>4</value>
    </interrupt>
        <interrupt>
        <name>TIMER1_IRQ_1</name>
        <value>5</value>
    </interrupt>
        <interrupt>
        <name>TIMER1_IRQ_2</name>
        <value>6</value>
    </interrupt>
        <interrupt>
        <name>TIMER1_IRQ_3</name>
        <value>7</value>
    </interrupt>
    </peripheral>
    <peripheral>
        <name>PWM</name>
        <description>Simple PWM</description>
        <baseAddress>0x400a8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>272</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>PWM_IRQ_WRAP_0</name>
            <value>8</value>
        </interrupt>
        <interrupt>
            <name>PWM_IRQ_WRAP_1</name>
            <value>9</value>
        </interrupt>
        <registers>
            <register>
                <dim>12</dim>
                <dimIncrement>20</dimIncrement>
                <name>CH%s_CSR</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>12</dim>
                <dimIncrement>20</dimIncrement>
                <name>CH%s_DIV</name>
                <addressOffset>0x00000004</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>12</dim>
                <dimIncrement>20</dimIncrement>
                <name>CH%s_CTR</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>12</dim>
                <dimIncrement>20</dimIncrement>
                <name>CH%s_CC</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>12</dim>
                <dimIncrement>20</dimIncrement>
                <name>CH%s_TOP</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EN</name>
                <addressOffset>0x000000f0</addressOffset>
                <description>This register aliases the CSR_EN bits for all channels. 
                    Writing to this register allows multiple channels to be enabled 
                    or disabled simultaneously, so they can run in perfect sync. 
                    For each channel, there is only one physical EN register bit, 
                    which can be accessed through here or CHx_CSR.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x000000f4</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH10</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CH0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ0_INTE</name>
                <addressOffset>0x000000f8</addressOffset>
                <description>Interrupt Enable for irq0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ0_INTF</name>
                <addressOffset>0x000000fc</addressOffset>
                <description>Interrupt Force for irq0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CH0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ0_INTS</name>
                <addressOffset>0x00000100</addressOffset>
                <description>Interrupt status after masking &amp; forcing for irq0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH10</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CH0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
