cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>I2C0</name>
        <description>DW_apb_i2c address block

            List of configuration constants for the Synopsys I2C hardware (you may see references to these in I2C register header; these are *fixed* values, set at hardware design time):

            IC_ULTRA_FAST_MODE ................ 0x0\n
            IC_UFM_TBUF_CNT_DEFAULT ........... 0x8\n
            IC_UFM_SCL_LOW_COUNT .............. 0x0008\n
            IC_UFM_SCL_HIGH_COUNT ............. 0x0006\n
            IC_TX_TL .......................... 0x0\n
            IC_TX_CMD_BLOCK ................... 0x1\n
            IC_HAS_DMA ........................ 0x1\n
            IC_HAS_ASYNC_FIFO ................. 0x0\n
            IC_SMBUS_ARP ...................... 0x0\n
            IC_FIRST_DATA_BYTE_STATUS ......... 0x1\n
            IC_INTR_IO ........................ 0x1\n
            IC_MASTER_MODE .................... 0x1\n
            IC_DEFAULT_ACK_GENERAL_CALL ....... 0x1\n
            IC_INTR_POL ....................... 0x1\n
            IC_OPTIONAL_SAR ................... 0x0\n
            IC_DEFAULT_TAR_SLAVE_ADDR ......... 0x055\n
            IC_DEFAULT_SLAVE_ADDR ............. 0x055\n
            IC_DEFAULT_HS_SPKLEN .............. 0x1\n
            IC_FS_SCL_HIGH_COUNT .............. 0x0006\n
            IC_HS_SCL_LOW_COUNT ............... 0x0008\n
            IC_DEVICE_ID_VALUE ................ 0x0\n
            IC_10BITADDR_MASTER ............... 0x0\n
            IC_CLK_FREQ_OPTIMIZATION .......... 0x0\n
            IC_DEFAULT_FS_SPKLEN .............. 0x7\n
            IC_ADD_ENCODED_PARAMS ............. 0x0\n
            IC_DEFAULT_SDA_HOLD ............... 0x000001\n
            IC_DEFAULT_SDA_SETUP .............. 0x64\n
            IC_AVOID_RX_FIFO_FLUSH_ON_TX_ABRT . 0x0\n
            IC_CLOCK_PERIOD ................... 100\n
            IC_EMPTYFIFO_HOLD_MASTER_EN ....... 1\n
            IC_RESTART_EN ..................... 0x1\n
            IC_TX_CMD_BLOCK_DEFAULT ........... 0x0\n
            IC_BUS_CLEAR_FEATURE .............. 0x0\n
            IC_CAP_LOADING .................... 100\n
            IC_FS_SCL_LOW_COUNT ............... 0x000d\n
            APB_DATA_WIDTH .................... 32\n
            IC_SDA_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff\n
            IC_SLV_DATA_NACK_ONLY ............. 0x1\n
            IC_10BITADDR_SLAVE ................ 0x0\n
            IC_CLK_TYPE ....................... 0x0\n
            IC_SMBUS_UDID_MSB ................. 0x0\n
            IC_SMBUS_SUSPEND_ALERT ............ 0x0\n
            IC_HS_SCL_HIGH_COUNT .............. 0x0006\n
            IC_SLV_RESTART_DET_EN ............. 0x1\n
            IC_SMBUS .......................... 0x0\n
            IC_OPTIONAL_SAR_DEFAULT ........... 0x0\n
            IC_PERSISTANT_SLV_ADDR_DEFAULT .... 0x0\n
            IC_USE_COUNTS ..................... 0x0\n
            IC_RX_BUFFER_DEPTH ................ 16\n
            IC_SCL_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff\n
            IC_RX_FULL_HLD_BUS_EN ............. 0x1\n
            IC_SLAVE_DISABLE .................. 0x1\n
            IC_RX_TL .......................... 0x0\n
            IC_DEVICE_ID ...................... 0x0\n
            IC_HC_COUNT_VALUES ................ 0x0\n
            I2C_DYNAMIC_TAR_UPDATE ............ 0\n
            IC_SMBUS_CLK_LOW_MEXT_DEFAULT ..... 0xffffffff\n
            IC_SMBUS_CLK_LOW_SEXT_DEFAULT ..... 0xffffffff\n
            IC_HS_MASTER_CODE ................. 0x1\n
            IC_SMBUS_RST_IDLE_CNT_DEFAULT ..... 0xffff\n
            IC_SMBUS_UDID_LSB_DEFAULT ......... 0xffffffff\n
            IC_SS_SCL_HIGH_COUNT .............. 0x0028\n
            IC_SS_SCL_LOW_COUNT ............... 0x002f\n
            IC_MAX_SPEED_MODE ................. 0x2\n
            IC_STAT_FOR_CLK_STRETCH ........... 0x0\n
            IC_STOP_DET_IF_MASTER_ACTIVE ...... 0x0\n
            IC_DEFAULT_UFM_SPKLEN ............. 0x1\n
            IC_TX_BUFFER_DEPTH ................ 16
        </description>
        <baseAddress>0x40090000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>256</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>I2C0_IRQ</name>
            <value>36</value>
        </interrupt>
        <registers>
            <register>
                <name>IC_CON</name>
                <addressOffset>0x00000000</addressOffset>
                <description>I2C Control Register. This register can be written only when the DW_apb_i2c is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                    Read/Write Access: - bit 10 is read only. - bit 11 is read only - bit 16 is read only - bit 17 is read only - bits 18 and 19 are read only.</description>
                <resetValue>0x00000065</resetValue>
                <fields>
                    <field>
                        <name>STOP_DET_IF_MASTER_ACTIVE</name>
                        <description>Master issues the STOP_DET interrupt irrespective of whether master is active or not</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_FIFO_FULL_HLD_CTRL</name>
                        <description>This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is physically full to its RX_BUFFER_DEPTH, as described in the IC_RX_FULL_HLD_BUS_EN parameter.

                            Reset value: 0x0.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Overflow when RX_FIFO is full</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Hold bus when RX_FIFO is full</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TX_EMPTY_CTRL</name>
                        <description>This bit controls the generation of the TX_EMPTY interrupt, as described in the IC_RAW_INTR_STAT register.

                            Reset value: 0x0.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Default behaviour of TX_EMPTY interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Controlled generation of TX_EMPTY interrupt</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STOP_DET_IFADDRESSED</name>
                        <description>In slave mode: - 1&#39;b1:  issues the STOP_DET interrupt only when it is addressed. - 1&#39;b0:  issues the STOP_DET irrespective of whether it&#39;s addressed or not. Reset value: 0x0

