cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            NOTE: During a general call address, this slave does not issue the STOP_DET interrupt if STOP_DET_IF_ADDRESSED = 1&#39;b1, even if the slave responds to the general call address by generating ACK. The STOP_DET interrupt is generated only when the transmitted address matches the slave address (SAR).</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>slave issues STOP_DET intr always</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>slave issues STOP_DET intr only if addressed</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IC_SLAVE_DISABLE</name>
                        <description>This bit controls whether I2C has its slave disabled, which means once the presetn signal is applied, then this bit is set and the slave is disabled.

                            If this bit is set (slave is disabled), DW_apb_i2c functions only as a master and does not perform any action that requires a slave.

                            NOTE: Software should ensure that if this bit is written with 0, then bit 0 should also be written with a 0.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SLAVE_ENABLED</name>
                                <value>0</value>
                                <description>Slave mode is enabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SLAVE_DISABLED</name>
                                <value>1</value>
                                <description>Slave mode is disabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IC_RESTART_EN</name>
                        <description>Determines whether RESTART conditions may be sent when acting as a master. Some older slaves do not support handling RESTART conditions; however, RESTART conditions are used in several DW_apb_i2c operations. When RESTART is disabled, the master is prohibited from performing the following functions: - Sending a START BYTE - Performing any high-speed mode operation - High-speed mode operation - Performing direction changes in combined format mode - Performing a read operation with a 10-bit address By replacing RESTART condition followed by a STOP and a subsequent START condition, split operations are broken down into multiple DW_apb_i2c transfers. If the above operations are performed, it will result in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register.

                            Reset value: ENABLED</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Master restart disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Master restart enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IC_10BITADDR_MASTER</name>
                        <description>Controls whether the DW_apb_i2c starts its transfers in 7- or 10-bit addressing mode when acting as a master. - 0: 7-bit addressing - 1: 10-bit addressing</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADDR_7BITS</name>
                                <value>0</value>
                                <description>Master 7Bit addressing mode</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADDR_10BITS</name>
                                <value>1</value>
                                <description>Master 10Bit addressing mode</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IC_10BITADDR_SLAVE</name>
                        <description>When acting as a slave, this bit controls whether the DW_apb_i2c responds to 7- or 10-bit addresses. - 0: 7-bit addressing. The DW_apb_i2c ignores transactions that involve 10-bit addressing; for 7-bit addressing, only the lower 7 bits of the IC_SAR register are compared. - 1: 10-bit addressing. The DW_apb_i2c responds to only 10-bit addressing transfers that match the full 10 bits of the IC_SAR register.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADDR_7BITS</name>
                                <value>0</value>
                                <description>Slave 7Bit addressing</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADDR_10BITS</name>
                                <value>1</value>
                                <description>Slave 10Bit addressing</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SPEED</name>
                        <description>These bits control at which speed the DW_apb_i2c operates; its setting is relevant only if one is operating the DW_apb_i2c in master mode. Hardware protects against illegal values being programmed by software. These bits must be programmed appropriately for slave mode also, as it is used to capture correct value of spike filter as per the speed mode.

                            This register should be programmed only with a value in the range of 1 to IC_MAX_SPEED_MODE; otherwise, hardware updates this register with the value of IC_MAX_SPEED_MODE.

