cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            1: standard mode (100 kbit/s)

                            2: fast mode (&lt;=400 kbit/s) or fast mode plus (&lt;=1000Kbit/s)

                            3: high speed mode (3.4 Mbit/s)

                            Note: This field is not applicable when IC_ULTRA_FAST_MODE=1</description>
                        <bitRange>[2:1]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>STANDARD</name>
                                <value>1</value>
                                <description>Standard Speed mode of operation</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FAST</name>
                                <value>2</value>
                                <description>Fast or Fast Plus mode of operation</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>High Speed mode of operation</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MASTER_MODE</name>
                        <description>This bit controls whether the DW_apb_i2c master is enabled.

                            NOTE: Software should ensure that if this bit is written with &#39;1&#39; then bit 6 should also be written with a &#39;1&#39;.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Master mode is disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Master mode is enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_TAR</name>
                <addressOffset>0x00000004</addressOffset>
                <description>I2C Target Address Register

                    This register is 12 bits wide, and bits 31:12 are reserved. This register can be written to only when IC_ENABLE[0] is set to 0.

                    Note: If the software or application is aware that the DW_apb_i2c is not using the TAR address for the pending commands in the Tx FIFO, then it is possible to update the TAR address even while the Tx FIFO has entries (IC_STATUS[2]= 0). - It is not necessary to perform any write to this register if DW_apb_i2c is enabled as an I2C slave only.</description>
                <resetValue>0x00000055</resetValue>
                <fields>
                    <field>
                        <name>SPECIAL</name>
                        <description>This bit indicates whether software performs a Device-ID or General Call or START BYTE command. - 0: ignore bit 10 GC_OR_START and use IC_TAR normally - 1: perform special I2C command as specified in Device_ID or GC_OR_START bit Reset value: 0x0</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Disables programming of GENERAL_CALL or START_BYTE transmission</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Enables programming of GENERAL_CALL or START_BYTE transmission</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>GC_OR_START</name>
                        <description>If bit 11 (SPECIAL) is set to 1 and bit 13(Device-ID) is set to 0, then this bit indicates whether a General Call or START byte command is to be performed by the DW_apb_i2c. - 0: General Call Address - after issuing a General Call, only writes may be performed. Attempting to issue a read command results in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register. The DW_apb_i2c remains in General Call mode until the SPECIAL bit value (bit 11) is cleared. - 1: START BYTE Reset value: 0x0</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>GENERAL_CALL</name>
                                <value>0</value>
                                <description>GENERAL_CALL byte transmission</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>START_BYTE</name>
                                <value>1</value>
                                <description>START byte transmission</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IC_TAR</name>
                        <description>This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.

