cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard. This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                            The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH == 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_FS_SCL_LCNT</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Fast Mode or Fast Mode Plus I2C Clock SCL Low Count Register</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>IC_FS_SCL_LCNT</name>
                        <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for fast speed. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to &#39;IC_CLK Frequency Configuration&#39;.

                            This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard.

                            This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                            The minimum valid value is 8; hardware prevents values less than this being written, and if attempted results in 8 being set. For designs with APB_DATA_WIDTH = 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed. If the value is less than 8 then the count value gets changed to 8.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_INTR_STAT</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>I2C Interrupt Status Register

                    Each bit in this register has a corresponding mask bit in the IC_INTR_MASK register. These bits are cleared by reading the matching interrupt clear register. The unmasked raw versions of these bits are available in the IC_RAW_INTR_STAT register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>R_RESTART_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RESTART_DET bit.

                            Reset value: 0x0</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RESTART_DET interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RESTART_DET interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_GEN_CALL</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL bit.

                            Reset value: 0x0</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_GEN_CALL interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_GEN_CALL interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_START_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_START_DET bit.

                            Reset value: 0x0</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_START_DET interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_START_DET interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_STOP_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET bit.

