cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reset value: 0x0</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_TX_OVER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_TX_OVER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_FULL</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_FULL bit.

                            Reset value: 0x0</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RX_FULL interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RX_FULL interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_OVER</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_OVER bit.

                            Reset value: 0x0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RX_OVER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RX_OVER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_UNDER</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_UNDER bit.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>RX_UNDER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>RX_UNDER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_INTR_MASK</name>
                <addressOffset>0x00000030</addressOffset>
                <description>I2C Interrupt Mask Register.

                    These bits mask their corresponding interrupt status bits. This register is active low; a value of 0 masks the interrupt, whereas a value of 1 unmasks the interrupt.</description>
                <resetValue>0x000008ff</resetValue>
                <fields>
                    <field>
                        <name>M_RESTART_DET</name>
                        <description>This bit masks the R_RESTART_DET interrupt in IC_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>RESTART_DET interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>RESTART_DET interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_GEN_CALL</name>
                        <description>This bit masks the R_GEN_CALL interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>GEN_CALL interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>GEN_CALL interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_START_DET</name>
                        <description>This bit masks the R_START_DET interrupt in IC_INTR_STAT register.

