cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reset value: 0x0</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>START_DET interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>START_DET interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_STOP_DET</name>
                        <description>This bit masks the R_STOP_DET interrupt in IC_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>STOP_DET interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>STOP_DET interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_ACTIVITY</name>
                        <description>This bit masks the R_ACTIVITY interrupt in IC_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>ACTIVITY interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>ACTIVITY interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_RX_DONE</name>
                        <description>This bit masks the R_RX_DONE interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>RX_DONE interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>RX_DONE interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_TX_ABRT</name>
                        <description>This bit masks the R_TX_ABRT interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>TX_ABORT interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>TX_ABORT interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_RD_REQ</name>
                        <description>This bit masks the R_RD_REQ interrupt in IC_INTR_STAT register.

                            Reset value: 0x1</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>0</value>
                                <description>RD_REQ interrupt is masked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>1</value>
                                <description>RD_REQ interrupt is unmasked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>M_TX_EMPTY</name>
                        <description>This bit masks the R_TX_EMPTY interrupt in IC_INTR_STAT register.

