cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_CLR_START_DET</name>
                <addressOffset>0x00000064</addressOffset>
                <description>Clear START_DET Interrupt Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR_START_DET</name>
                        <description>Read this register to clear the START_DET interrupt (bit 10) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_CLR_GEN_CALL</name>
                <addressOffset>0x00000068</addressOffset>
                <description>Clear GEN_CALL Interrupt Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR_GEN_CALL</name>
                        <description>Read this register to clear the GEN_CALL interrupt (bit 11) of IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_ENABLE</name>
                <addressOffset>0x0000006c</addressOffset>
                <description>I2C Enable Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TX_CMD_BLOCK</name>
                        <description>In Master mode: - 1&#39;b1: Blocks the transmission of data on I2C bus even if Tx FIFO has data to transmit. - 1&#39;b0: The transmission of data starts on I2C bus automatically, as soon as the first data is available in the Tx FIFO. Note: To block the execution of Master commands, set the TX_CMD_BLOCK bit only when Tx FIFO is empty (IC_STATUS[2]==1) and Master is in Idle state (IC_STATUS[5] == 0). Any further commands put in the Tx FIFO are not executed until TX_CMD_BLOCK bit is unset. Reset value:  IC_TX_CMD_BLOCK_DEFAULT</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NOT_BLOCKED</name>
                                <value>0</value>
                                <description>Tx Command execution not blocked</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLOCKED</name>
                                <value>1</value>
                                <description>Tx Command execution blocked</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABORT</name>
                        <description>When set, the controller initiates the transfer abort. - 0: ABORT not initiated or ABORT done - 1: ABORT operation in progress The software can abort the I2C transfer in master mode by setting this bit. The software can set this bit only when ENABLE is already set; otherwise, the controller ignores any write to ABORT bit. The software cannot clear the ABORT bit once set. In response to an ABORT, the controller issues a STOP and flushes the Tx FIFO after completing the current transfer, then sets the TX_ABORT interrupt after the abort operation. The ABORT bit is cleared automatically after the abort operation.

                            For a detailed description on how to abort I2C transfers, refer to &#39;Aborting I2C Transfers&#39;.

                            Reset value: 0x0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLE</name>
                                <value>0</value>
                                <description>ABORT operation not in progress</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>ABORT operation in progress</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Controls whether the DW_apb_i2c is enabled. - 0: Disables DW_apb_i2c (TX and RX FIFOs are held in an erased state) - 1: Enables DW_apb_i2c Software can disable DW_apb_i2c while it is active. However, it is important that care be taken to ensure that DW_apb_i2c is disabled properly. A recommended procedure is described in &#39;Disabling DW_apb_i2c&#39;.

                            When DW_apb_i2c is disabled, the following occurs: - The TX FIFO and RX FIFO get flushed. - Status bits in the IC_INTR_STAT register are still active until DW_apb_i2c goes into IDLE state. If the module is transmitting, it stops as well as deletes the contents of the transmit buffer after the current transfer is complete. If the module is receiving, the DW_apb_i2c stops the current transfer at the end of the current byte and does not acknowledge the transfer.

                            In systems with asynchronous pclk and ic_clk when IC_CLK_TYPE parameter set to asynchronous (1), there is a two ic_clk delay when enabling or disabling the DW_apb_i2c. For a detailed description on how to disable DW_apb_i2c, refer to &#39;Disabling DW_apb_i2c&#39;

