cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>I2C is disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>I2C is enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_STATUS</name>
                <addressOffset>0x00000070</addressOffset>
                <description>I2C Status Register

                    This is a read-only register used to indicate the current transfer status and FIFO status. The status register may be read at any time. None of the bits in this register request an interrupt.

                    When the I2C is disabled by writing 0 in bit 0 of the IC_ENABLE register: - Bits 1 and 2 are set to 1 - Bits 3 and 10 are set to 0 When the master or slave state machines goes to idle and ic_en=0: - Bits 5 and 6 are set to 0</description>
                <resetValue>0x00000006</resetValue>
                <fields>
                    <field>
                        <name>SLV_ACTIVITY</name>
                        <description>Slave FSM Activity Status. When the Slave Finite State Machine (FSM) is not in the IDLE state, this bit is set. - 0: Slave FSM is in IDLE state so the Slave part of DW_apb_i2c is not Active - 1: Slave FSM is not in IDLE state so the Slave part of DW_apb_i2c is Active Reset value: 0x0</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IDLE</name>
                                <value>0</value>
                                <description>Slave is idle</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>Slave not idle</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MST_ACTIVITY</name>
                        <description>Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in the IDLE state, this bit is set. - 0: Master FSM is in IDLE state so the Master part of DW_apb_i2c is not Active - 1: Master FSM is not in IDLE state so the Master part of DW_apb_i2c is Active Note: IC_STATUS[0]-that is, ACTIVITY bit-is the OR of SLV_ACTIVITY and MST_ACTIVITY bits.

                            Reset value: 0x0</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IDLE</name>
                                <value>0</value>
                                <description>Master is idle</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>Master not idle</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFF</name>
                        <description>Receive FIFO Completely Full. When the receive FIFO is completely full, this bit is set. When the receive FIFO contains one or more empty location, this bit is cleared. - 0: Receive FIFO is not full - 1: Receive FIFO is full Reset value: 0x0</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NOT_FULL</name>
                                <value>0</value>
                                <description>Rx FIFO not full</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FULL</name>
                                <value>1</value>
                                <description>Rx FIFO is full</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RFNE</name>
                        <description>Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or more entries; it is cleared when the receive FIFO is empty. - 0: Receive FIFO is empty - 1: Receive FIFO is not empty Reset value: 0x0</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>EMPTY</name>
                                <value>0</value>
                                <description>Rx FIFO is empty</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>NOT_EMPTY</name>
                                <value>1</value>
                                <description>Rx FIFO not empty</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TFE</name>
                        <description>Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this bit is set. When it contains one or more valid entries, this bit is cleared. This bit field does not request an interrupt. - 0: Transmit FIFO is not empty - 1: Transmit FIFO is empty Reset value: 0x1</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NON_EMPTY</name>
                                <value>0</value>
                                <description>Tx FIFO not empty</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>EMPTY</name>
                                <value>1</value>
                                <description>Tx FIFO is empty</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TFNF</name>
                        <description>Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty locations, and is cleared when the FIFO is full. - 0: Transmit FIFO is full - 1: Transmit FIFO is not full Reset value: 0x1</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FULL</name>
                                <value>0</value>
                                <description>Tx FIFO is full</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>NOT_FULL</name>
                                <value>1</value>
                                <description>Tx FIFO not full</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ACTIVITY</name>
                        <description>I2C Activity Status. Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>I2C is idle</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>I2C is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_TXFLR</name>
                <addressOffset>0x00000074</addressOffset>
                <description>I2C Transmit FIFO Level Register This register contains the number of valid data entries in the transmit FIFO buffer. It is cleared whenever: - The I2C is disabled - There is a transmit abort - that is, TX_ABRT bit is set in the IC_RAW_INTR_STAT register - The slave bulk transmit mode is aborted The register increments whenever data is placed into the transmit FIFO and decrements when data is taken from the transmit FIFO.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXFLR</name>
                        <description>Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO.

