cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Role of DW_apb_i2c:  Master</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_SBYTE_NORSTRT_VOID</name>
                                <value>0</value>
                                <description>User trying to send START byte when RESTART disabled- scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_SBYTE_NORSTRT_GENERATED</name>
                                <value>1</value>
                                <description>User trying to send START byte when RESTART disabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_HS_NORSTRT</name>
                        <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to use the master to transfer data in High Speed mode.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_HS_NORSTRT_VOID</name>
                                <value>0</value>
                                <description>User trying to switch Master to HS mode when RESTART disabled- scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_HS_NORSTRT_GENERATED</name>
                                <value>1</value>
                                <description>User trying to switch Master to HS mode when RESTART disabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_SBYTE_ACKDET</name>
                        <description>This field indicates that the Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_SBYTE_ACKDET_VOID</name>
                                <value>0</value>
                                <description>ACK detected for START byte- scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_SBYTE_ACKDET_GENERATED</name>
                                <value>1</value>
                                <description>ACK detected for START byte</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_HS_ACKDET</name>
                        <description>This field indicates that the Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_HS_ACK_VOID</name>
                                <value>0</value>
                                <description>HS Master code ACKed in HS Mode- scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_HS_ACK_GENERATED</name>
                                <value>1</value>
                                <description>HS Master code ACKed in HS Mode</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_GCALL_READ</name>
                        <description>This field indicates that DW_apb_i2c in the master mode has sent a General Call but the user programmed the byte following the General Call to be a read from the bus (IC_DATA_CMD[9] is set to 1).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_GCALL_READ_VOID</name>
                                <value>0</value>
                                <description>GCALL is followed by read from bus-scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_GCALL_READ_GENERATED</name>
                                <value>1</value>
                                <description>GCALL is followed by read from bus</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_GCALL_NOACK</name>
                        <description>This field indicates that DW_apb_i2c in master mode has sent a General Call and no slave on the bus acknowledged the General Call.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_GCALL_NOACK_VOID</name>
                                <value>0</value>
                                <description>GCALL not ACKed by any slave-scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_GCALL_NOACK_GENERATED</name>
                                <value>1</value>
                                <description>GCALL not ACKed by any slave</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_TXDATA_NOACK</name>
                        <description>This field indicates the master-mode only bit. When the master receives an acknowledgement for the address, but when it sends data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ABRT_TXDATA_NOACK_VOID</name>
                                <value>0</value>
                                <description>Transmitted data non-ACKed by addressed slave-scenario not present</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ABRT_TXDATA_NOACK_GENERATED</name>
                                <value>1</value>
                                <description>Transmitted data not ACKed by addressed slave</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_10ADDR2_NOACK</name>
                        <description>This field indicates that the Master is in 10-bit address mode and that the second address byte of the 10-bit address was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>This abort is not generated</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>Byte 2 of 10Bit Address not ACKed by any slave</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_10ADDR1_NOACK</name>
                        <description>This field indicates that the Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>This abort is not generated</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>Byte 1 of 10Bit Address not ACKed by any slave</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ABRT_7B_ADDR_NOACK</name>
                        <description>This field indicates that the Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.

                            Reset value: 0x0

                            Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>This abort is not generated</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>This abort is generated because of NOACK for 7-bit address</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_SLV_DATA_NACK_ONLY</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Generate Slave Data NACK Register

                    The register is used to generate a NACK for the data part of a transfer when DW_apb_i2c is acting as a slave-receiver. This register only exists when the IC_SLV_DATA_NACK_ONLY parameter is set to 1. When this parameter disabled, this register does not exist and writing to the register&#39;s address has no effect.

                    A write can occur on this register if both of the following conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note: The IC_STATUS[6] is a register read-back location for the internal slv_activity signal; the user should poll this before writing the ic_slv_data_nack_only bit.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NACK</name>
                        <description>Generate NACK. This NACK generation only occurs when DW_apb_i2c is a slave-receiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received; hence, the data transfer is aborted and the data received is not pushed to the receive buffer.

                            When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria. - 1: generate NACK after data byte received - 0: generate NACK/ACK normally Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Slave receiver generates NACK normally</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Slave receiver generates NACK upon data reception only</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_DMA_CR</name>
                <addressOffset>0x00000088</addressOffset>
                <description>DMA Control Register

                    The register is used to enable the DMA Controller interface operation. There is a separate bit for transmit and receive. This can be programmed regardless of the state of IC_ENABLE.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TDMAE</name>
                        <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. Reset value: 0x0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>transmit FIFO DMA channel disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Transmit FIFO DMA channel enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RDMAE</name>
                        <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Receive FIFO DMA channel disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Receive FIFO DMA channel enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_DMA_TDLR</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>DMA Transmit Data Level Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DMATDL</name>
                        <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.

