cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_COMP_PARAM_1</name>
                <addressOffset>0x000000f4</addressOffset>
                <description>Component Parameter Register 1

                    Note This register is not implemented and therefore reads as 0. If it was implemented it would be a constant read-only register that contains encoded information about the component&#39;s parameter settings. Fields shown below are the settings for those parameters</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TX_BUFFER_DEPTH</name>
                        <description>TX Buffer Depth = 16</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_BUFFER_DEPTH</name>
                        <description>RX Buffer Depth = 16</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ADD_ENCODED_PARAMS</name>
                        <description>Encoded parameters not visible</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HAS_DMA</name>
                        <description>DMA handshaking signals are enabled</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INTR_IO</name>
                        <description>COMBINED Interrupt outputs</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HC_COUNT_VALUES</name>
                        <description>Programmable count values for each mode.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAX_SPEED_MODE</name>
                        <description>MAX SPEED MODE = FAST MODE</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>APB_DATA_WIDTH</name>
                        <description>APB data bus width is 32 bits</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_COMP_VERSION</name>
                <addressOffset>0x000000f8</addressOffset>
                <description>I2C Component Version Register</description>
                <resetValue>0x3230312a</resetValue>
                <fields>
                    <field>
                        <name>IC_COMP_VERSION</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_COMP_TYPE</name>
                <addressOffset>0x000000fc</addressOffset>
                <description>I2C Component Type Register</description>
                <resetValue>0x44570140</resetValue>
                <fields>
                    <field>
                        <name>IC_COMP_TYPE</name>
                        <description>Designware Component Type number = 0x44_57_01_40. This assigned unique hex value is constant and is derived from the two ASCII letters &#39;DW&#39; followed by a 16-bit unsigned number.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
        <name>I2C1</name>
        <baseAddress>0x40098000</baseAddress>
        <interrupt>
        <name>I2C1_IRQ</name>
        <value>37</value>
    </interrupt>
    </peripheral>
    <peripheral>
        <name>SPI0</name>
        <baseAddress>0x40080000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>SPI0_IRQ</name>
            <value>31</value>
        </interrupt>
        <registers>
            <register>
                <name>SSPCR0</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control register 0, SSPCR0 on page 3-4</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCR</name>
                        <description>Serial clock rate. The value SCR is used to generate the transmit and receive bit rate of the PrimeCell SSP. The bit rate is: F SSPCLK CPSDVSR x (1+SCR) where CPSDVSR is an even value from 2-254, programmed through the SSPCPSR register and SCR is a value from 0-255.</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SPH</name>
                        <description>SSPCLKOUT phase, applicable to Motorola SPI frame format only. See Motorola SPI frame format on page 2-10.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SPO</name>
                        <description>SSPCLKOUT polarity, applicable to Motorola SPI frame format only. See Motorola SPI frame format on page 2-10.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRF</name>
                        <description>Frame format: 00 Motorola SPI frame format. 01 TI synchronous serial frame format. 10 National Microwire frame format. 11 Reserved, undefined operation.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DSS</name>
                        <description>Data Size Select: 0000 Reserved, undefined operation. 0001 Reserved, undefined operation. 0010 Reserved, undefined operation. 0011 4-bit data. 0100 5-bit data. 0101 6-bit data. 0110 7-bit data. 0111 8-bit data. 1000 9-bit data. 1001 10-bit data. 1010 11-bit data. 1011 12-bit data. 1100 13-bit data. 1101 14-bit data. 1110 15-bit data. 1111 16-bit data.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPCR1</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Control register 1, SSPCR1 on page 3-5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SOD</name>
                        <description>Slave-mode output disable. This bit is relevant only in the slave mode, MS=1. In multiple-slave systems, it is possible for an PrimeCell SSP master to broadcast a message to all slaves in the system while ensuring that only one slave drives data onto its serial output line. In such systems the RXD lines from multiple slaves could be tied together. To operate in such systems, the SOD bit can be set if the PrimeCell SSP slave is not supposed to drive the SSPTXD line: 0 SSP can drive the SSPTXD output in slave mode. 1 SSP must not drive the SSPTXD output in slave mode.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MS</name>
                        <description>Master or slave mode select. This bit can be modified only when the PrimeCell SSP is disabled, SSE=0: 0 Device configured as master, default. 1 Device configured as slave.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SSE</name>
                        <description>Synchronous serial port enable: 0 SSP operation disabled. 1 SSP operation enabled.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LBM</name>
                        <description>Loop back mode: 0 Normal serial port operation enabled. 1 Output of transmit serial shifter is connected to input of receive serial shifter internally.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPDR</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Data register, SSPDR on page 3-6</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DATA</name>
                        <description>Transmit/Receive FIFO: Read Receive FIFO. Write Transmit FIFO. You must right-justify data when the PrimeCell SSP is programmed for a data size that is less than 16 bits. Unused bits at the top are ignored by transmit logic. The receive logic automatically right-justifies.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPSR</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Status register, SSPSR on page 3-7</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>BSY</name>
                        <description>PrimeCell SSP busy flag, RO: 0 SSP is idle. 1 SSP is currently transmitting and/or receiving a frame or the transmit FIFO is not empty.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RFF</name>
                        <description>Receive FIFO full, RO: 0 Receive FIFO is not full. 1 Receive FIFO is full.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RNE</name>
                        <description>Receive FIFO not empty, RO: 0 Receive FIFO is empty. 1 Receive FIFO is not empty.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TNF</name>
                        <description>Transmit FIFO not full, RO: 0 Transmit FIFO is full. 1 Transmit FIFO is not full.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TFE</name>
                        <description>Transmit FIFO empty, RO: 0 Transmit FIFO is not empty. 1 Transmit FIFO is empty.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPCPSR</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Clock prescale register, SSPCPSR on page 3-8</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CPSDVSR</name>
                        <description>Clock prescale divisor. Must be an even number from 2-254, depending on the frequency of SSPCLK. The least significant bit always returns zero on reads.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPIMSC</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Interrupt mask set or clear register, SSPIMSC on page 3-9</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXIM</name>
                        <description>Transmit FIFO interrupt mask: 0 Transmit FIFO half empty or less condition interrupt is masked. 1 Transmit FIFO half empty or less condition interrupt is not masked.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXIM</name>
                        <description>Receive FIFO interrupt mask: 0 Receive FIFO half full or less condition interrupt is masked. 1 Receive FIFO half full or less condition interrupt is not masked.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RTIM</name>
                        <description>Receive timeout interrupt mask: 0 Receive FIFO not empty and no read prior to timeout period interrupt is masked. 1 Receive FIFO not empty and no read prior to timeout period interrupt is not masked.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RORIM</name>
                        <description>Receive overrun interrupt mask: 0 Receive FIFO written to while full condition interrupt is masked. 1 Receive FIFO written to while full condition interrupt is not masked.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPRIS</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Raw interrupt status register, SSPRIS on page 3-10</description>
                <resetValue>0x00000008</resetValue>
                <fields>
                    <field>
                        <name>TXRIS</name>
                        <description>Gives the raw interrupt state, prior to masking, of the SSPTXINTR interrupt</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXRIS</name>
                        <description>Gives the raw interrupt state, prior to masking, of the SSPRXINTR interrupt</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RTRIS</name>
                        <description>Gives the raw interrupt state, prior to masking, of the SSPRTINTR interrupt</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RORRIS</name>
                        <description>Gives the raw interrupt state, prior to masking, of the SSPRORINTR interrupt</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPMIS</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Masked interrupt status register, SSPMIS on page 3-11</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXMIS</name>
                        <description>Gives the transmit FIFO masked interrupt state, after masking, of the SSPTXINTR interrupt</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXMIS</name>
                        <description>Gives the receive FIFO masked interrupt state, after masking, of the SSPRXINTR interrupt</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RTMIS</name>
                        <description>Gives the receive timeout masked interrupt state, after masking, of the SSPRTINTR interrupt</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RORMIS</name>
                        <description>Gives the receive over run masked interrupt status, after masking, of the SSPRORINTR interrupt</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPICR</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Interrupt clear register, SSPICR on page 3-11</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RTIC</name>
                        <description>Clears the SSPRTINTR interrupt</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RORIC</name>
                        <description>Clears the SSPRORINTR interrupt</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPDMACR</name>
                <addressOffset>0x00000024</addressOffset>
                <description>DMA control register, SSPDMACR on page 3-12</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXDMAE</name>
                        <description>Transmit DMA Enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXDMAE</name>
                        <description>Receive DMA Enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPERIPHID0</name>
                <addressOffset>0x00000fe0</addressOffset>
                <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                <resetValue>0x00000022</resetValue>
                <fields>
                    <field>
                        <name>PARTNUMBER0</name>
                        <description>These bits read back as 0x22</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPERIPHID1</name>
                <addressOffset>0x00000fe4</addressOffset>
                <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>DESIGNER0</name>
                        <description>These bits read back as 0x1</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PARTNUMBER1</name>
                        <description>These bits read back as 0x0</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPERIPHID2</name>
                <addressOffset>0x00000fe8</addressOffset>
                <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                <resetValue>0x00000034</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>These bits return the peripheral revision</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DESIGNER1</name>
                        <description>These bits read back as 0x4</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
