cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>SSPPERIPHID3</name>
                <addressOffset>0x00000fec</addressOffset>
                <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CONFIGURATION</name>
                        <description>These bits read back as 0x00</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPCELLID0</name>
                <addressOffset>0x00000ff0</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID0</name>
                        <description>These bits read back as 0x0D</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPCELLID1</name>
                <addressOffset>0x00000ff4</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x000000f0</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID1</name>
                        <description>These bits read back as 0xF0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPCELLID2</name>
                <addressOffset>0x00000ff8</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID2</name>
                        <description>These bits read back as 0x05</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPCELLID3</name>
                <addressOffset>0x00000ffc</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID3</name>
                        <description>These bits read back as 0xB1</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
        <name>SPI1</name>
        <baseAddress>0x40088000</baseAddress>
        <interrupt>
        <name>SPI1_IRQ</name>
        <value>32</value>
    </interrupt>
    </peripheral>
    <peripheral>
        <name>PIO0</name>
        <description>Programmable IO block</description>
        <baseAddress>0x50200000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>392</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>PIO0_IRQ_0</name>
            <value>15</value>
        </interrupt>
        <interrupt>
            <name>PIO0_IRQ_1</name>
            <value>16</value>
        </interrupt>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>PIO control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NEXTPREV_CLKDIV_RESTART</name>
                        <description>Write 1 to restart the clock dividers of state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to writing 1 to the corresponding CLKDIV_RESTART bits in those PIOs&#39; CTRL registers.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXTPREV_SM_DISABLE</name>
                        <description>Write 1 to disable state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to clearing the corresponding SM_ENABLE bits in those PIOs&#39; CTRL registers.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXTPREV_SM_ENABLE</name>
                        <description>Write 1 to enable state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to setting the corresponding SM_ENABLE bits in those PIOs&#39; CTRL registers.

                            If both OTHERS_SM_ENABLE and OTHERS_SM_DISABLE are set, the disable takes precedence.</description>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXT_PIO_MASK</name>
                        <description>A mask of state machines in the neighbouring higher-numbered PIO block in the system (or PIO block 0 if this is the highest-numbered PIO block) to which to apply the operations specified by NEXTPREV_CLKDIV_RESTART, NEXTPREV_SM_ENABLE, and NEXTPREV_SM_DISABLE in the same write.

                            This allows state machines in a neighbouring PIO block to be started/stopped/clock-synced exactly simultaneously with a write to this PIO block&#39;s CTRL register.

                            Note that in a system with two PIOs, NEXT_PIO_MASK and PREV_PIO_MASK actually indicate the same PIO block. In this case the effects are applied cumulatively (as though the masks were OR&#39;d together).

                            Neighbouring PIO blocks are disconnected (status signals tied to 0 and control signals ignored) if one block is accessible to NonSecure code, and one is not.</description>
                        <bitRange>[23:20]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PREV_PIO_MASK</name>
                        <description>A mask of state machines in the neighbouring lower-numbered PIO block in the system (or the highest-numbered PIO block if this is PIO block 0) to which to apply the operations specified by OP_CLKDIV_RESTART, OP_ENABLE, OP_DISABLE in the same write.

                            This allows state machines in a neighbouring PIO block to be started/stopped/clock-synced exactly simultaneously with a write to this PIO block&#39;s CTRL register.

                            Neighbouring PIO blocks are disconnected (status signals tied to 0 and control signals ignored) if one block is accessible to NonSecure code, and one is not.</description>
                        <bitRange>[19:16]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CLKDIV_RESTART</name>
                        <description>Restart a state machine&#39;s clock divider from an initial phase of 0. Clock dividers are free-running, so once started, their output (including fractional jitter) is completely determined by the integer/fractional divisor configured in SMx_CLKDIV. This means that, if multiple clock dividers with the same divisor are restarted simultaneously, by writing multiple 1 bits to this field, the execution clocks of those state machines will run in precise lockstep.

