cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            If STATUS_SEL is TXLEVEL or RXLEVEL, then values of STATUS_N greater than the current FIFO depth are reserved, and have undefined behaviour.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IRQ</name>
                                <value>0</value>
                                <description>Index 0-7 of an IRQ flag in this PIO block</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IRQ_PREVPIO</name>
                                <value>8</value>
                                <description>Index 0-7 of an IRQ flag in the next lower-numbered PIO block</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IRQ_NEXTPIO</name>
                                <value>16</value>
                                <description>Index 0-7 of an IRQ flag in the next higher-numbered PIO block</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <dim>4</dim>
                <dimIncrement>24</dimIncrement>
                <name>SM%s_SHIFTCTRL</name>
                <addressOffset>0x000000d0</addressOffset>
                <description>Control behaviour of the input/output shift registers for state machine 0</description>
                <resetValue>0x000c0000</resetValue>
                <fields>
                    <field>
                        <name>FJOIN_RX</name>
                        <description>When 1, RX FIFO steals the TX FIFO&#39;s storage, and becomes twice as deep. 
                            TX FIFO is disabled as a result (always reads as both full and empty). 
                            FIFOs are flushed when this bit is changed.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_TX</name>
                        <description>When 1, TX FIFO steals the RX FIFO&#39;s storage, and becomes twice as deep. 
                            RX FIFO is disabled as a result (always reads as both full and empty). 
                            FIFOs are flushed when this bit is changed.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PULL_THRESH</name>
                        <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place. 
                            Write 0 for value of 32.</description>
                        <bitRange>[29:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PUSH_THRESH</name>
                        <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place. 
                            Write 0 for value of 32.</description>
                        <bitRange>[24:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_SHIFTDIR</name>
                        <description>1 = shift out of output shift register to right. 0 = to left.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IN_SHIFTDIR</name>
                        <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOPULL</name>
                        <description>Pull automatically when the output shift register is emptied, i.e. on or following an OUT instruction which causes the output shift counter to reach or exceed PULL_THRESH.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOPUSH</name>
                        <description>Push automatically when the input shift register is filled, i.e. on an IN instruction which causes the input shift counter to reach or exceed PUSH_THRESH.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_RX_PUT</name>
                        <description>If 1, disable this state machine&#39;s RX FIFO, make its storage available for random write access by the state machine (using the `put` instruction) and, unless FJOIN_RX_GET is also set, random read access by the processor (through the RXFx_PUTGETy registers).

                            If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX FIFO&#39;s registers can be randomly read/written by the state machine, but are completely inaccessible to the processor.

                            Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_RX_GET</name>
                        <description>If 1, disable this state machine&#39;s RX FIFO, make its storage available for random read access by the state machine (using the `get` instruction) and, unless FJOIN_RX_PUT is also set, random write access by the processor (through the RXFx_PUTGETy registers).

