cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>IRQ1_INTE</name>
                <addressOffset>0x0000017c</addressOffset>
                <description>Interrupt Enable for irq1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM7</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM6</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM5</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM4</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_TXNFULL</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_TXNFULL</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_TXNFULL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_TXNFULL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_RXNEMPTY</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_RXNEMPTY</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_RXNEMPTY</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_RXNEMPTY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ1_INTF</name>
                <addressOffset>0x00000180</addressOffset>
                <description>Interrupt Force for irq1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM7</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM6</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM5</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM4</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_TXNFULL</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_TXNFULL</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_TXNFULL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_TXNFULL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_RXNEMPTY</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_RXNEMPTY</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_RXNEMPTY</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_RXNEMPTY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ1_INTS</name>
                <addressOffset>0x00000184</addressOffset>
                <description>Interrupt status after masking &amp; forcing for irq1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM7</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM6</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM5</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM4</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3_TXNFULL</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2_TXNFULL</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1_TXNFULL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0_TXNFULL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3_RXNEMPTY</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2_RXNEMPTY</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1_RXNEMPTY</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0_RXNEMPTY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
