cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            Reading from the POP_SINGLE register, or reading from the POP_DOUBLE register with PIX2_NOSHIFT set (for pixel doubling), shifts by the indicated amount.

                            Reading from a POP_DOUBLE register when PIX2_NOSHIFT is clear will shift by double the indicated amount. (Shift by 32 means no shift.)</description>
                        <bitRange>[26:24]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <value>0</value>
                                <description>Do not shift the colour data register.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <value>1</value>
                                <description>Shift the colour data register by 1 bit</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>2</name>
                                <value>2</value>
                                <description>Shift the colour data register by 2 bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4</name>
                                <value>3</value>
                                <description>Shift the colour data register by 4 bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8</name>
                                <value>4</value>
                                <description>Shift the colour data register by 8 bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16</name>
                                <value>5</value>
                                <description>Shift the colour data register by 16 bits</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERLEAVE</name>
                        <description>Enable lane interleaving for reads of PEEK_SINGLE/POP_SINGLE.

                            When interleaving is disabled, each of the 3 symbols appears as a contiguous 10-bit field, with lane 0 being the least-significant and starting at bit 0 of the register.

                            When interleaving is enabled, the symbols are packed into 5 chunks of 3 lanes times 2 bits (30 bits total). Each chunk contains two bits of a TMDS symbol per lane, with lane 0 being the least significant.</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L2_NBITS</name>
                        <description>Number of valid colour MSBs for lane 2 (1-8 bits, encoded as 0 through 7). Remaining LSBs are masked to 0 after the rotate.</description>
                        <bitRange>[20:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L1_NBITS</name>
                        <description>Number of valid colour MSBs for lane 1 (1-8 bits, encoded as 0 through 7). Remaining LSBs are masked to 0 after the rotate.</description>
                        <bitRange>[17:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L0_NBITS</name>
                        <description>Number of valid colour MSBs for lane 0 (1-8 bits, encoded as 0 through 7). Remaining LSBs are masked to 0 after the rotate.</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L2_ROT</name>
                        <description>Right-rotate the 16 LSBs of the colour accumulator by 0-15 bits, in order to get the MSB of the lane 2 (red) colour data aligned with the MSB of the 8-bit encoder input.

                            For example, for RGB565 (red most significant), red is bits 15:11, so should be right-rotated by 8 bits to align with bits 7:3 of the encoder input.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L1_ROT</name>
                        <description>Right-rotate the 16 LSBs of the colour accumulator by 0-15 bits, in order to get the MSB of the lane 1 (green) colour data aligned with the MSB of the 8-bit encoder input.

                            For example, for RGB565, green is bits 10:5, so should be right-rotated by 3 bits to align with bits 7:2 of the encoder input.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L0_ROT</name>
                        <description>Right-rotate the 16 LSBs of the colour accumulator by 0-15 bits, in order to get the MSB of the lane 0 (blue) colour data aligned with the MSB of the 8-bit encoder input.

                            For example, for RGB565 (red most significant), blue is bits 4:0, so should be right-rotated by 13 to align with bits 7:3 of the encoder input.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_WDATA</name>
                <addressOffset>0x000001c4</addressOffset>
                <description>Write-only access to the TMDS colour data register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_WDATA</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_PEEK_SINGLE</name>
                <addressOffset>0x000001c8</addressOffset>
                <description>Get the encoding of one pixel&#39;s worth of colour data, packed into a 32-bit value (3x10-bit symbols).

                    The PEEK alias does not shift the colour register when read, but still advances the running DC balance state of each encoder. This is useful for pixel doubling.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_PEEK_SINGLE</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_POP_SINGLE</name>
                <addressOffset>0x000001cc</addressOffset>
                <description>Get the encoding of one pixel&#39;s worth of colour data, packed into a 32-bit value. The packing is 5 chunks of 3 lanes times 2 bits (30 bits total). Each chunk contains two bits of a TMDS symbol per lane. This format is intended for shifting out with the HSTX peripheral on RP2350.

                    The POP alias shifts the colour register when read, as well as advancing the running DC balance state of each encoder.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_POP_SINGLE</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_PEEK_DOUBLE_L0</name>
                <addressOffset>0x000001d0</addressOffset>
                <description>Get lane 0 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The PEEK alias does not shift the colour register when read, but still advances the lane 0 DC balance state. This is useful if all 3 lanes&#39; worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_PEEK_DOUBLE_L0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_POP_DOUBLE_L0</name>
                <addressOffset>0x000001d4</addressOffset>
                <description>Get lane 0 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_POP_DOUBLE_L0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_PEEK_DOUBLE_L1</name>
                <addressOffset>0x000001d8</addressOffset>
                <description>Get lane 1 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The PEEK alias does not shift the colour register when read, but still advances the lane 1 DC balance state. This is useful if all 3 lanes&#39; worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_PEEK_DOUBLE_L1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_POP_DOUBLE_L1</name>
                <addressOffset>0x000001dc</addressOffset>
                <description>Get lane 1 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_POP_DOUBLE_L1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_PEEK_DOUBLE_L2</name>
                <addressOffset>0x000001e0</addressOffset>
                <description>Get lane 2 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The PEEK alias does not shift the colour register when read, but still advances the lane 2 DC balance state. This is useful if all 3 lanes&#39; worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_PEEK_DOUBLE_L2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_POP_DOUBLE_L2</name>
                <addressOffset>0x000001e4</addressOffset>
                <description>Get lane 2 of the encoding of two pixels&#39; worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS_POP_DOUBLE_L2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
