cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="SIO">
        <name>SIO_NS</name>
        <baseAddress>0xd0020000</baseAddress>
    </peripheral>
    <peripheral>
        <name>BOOTRAM</name>
        <description>Additional registers mapped adjacent to the bootram, for use by the bootrom.</description>
        <baseAddress>0x400e0000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>2092</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>WRITE_ONCE0</name>
                <addressOffset>0x00000800</addressOffset>
                <description>This registers always ORs writes into its current contents. Once a bit is set, it can only be cleared by a reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WRITE_ONCE0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WRITE_ONCE1</name>
                <addressOffset>0x00000804</addressOffset>
                <description>This registers always ORs writes into its current contents. Once a bit is set, it can only be cleared by a reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WRITE_ONCE1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK_STAT</name>
                <addressOffset>0x00000808</addressOffset>
                <description>Bootlock status register. 1=unclaimed, 0=claimed. These locks function identically to the SIO spinlocks, but are reserved for bootrom use.</description>
                <resetValue>0x000000ff</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK_STAT</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK0</name>
                <addressOffset>0x0000080c</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK1</name>
                <addressOffset>0x00000810</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK2</name>
                <addressOffset>0x00000814</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK3</name>
                <addressOffset>0x00000818</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK4</name>
                <addressOffset>0x0000081c</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK4</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK5</name>
                <addressOffset>0x00000820</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK6</name>
                <addressOffset>0x00000824</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTLOCK7</name>
                <addressOffset>0x00000828</addressOffset>
                <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTLOCK7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
