cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>CORESIGHT_TRACE</name>
        <description>Coresight block - RP specific registers</description>
        <baseAddress>0x50700000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>8</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL_STATUS</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>TRACE_CAPTURE_FIFO_OVERFLOW</name>
                        <description>This status flag is set high when trace data has been dropped due to the FIFO being full at the point trace data was sampled. Write 1 to acknowledge and clear the bit.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRACE_CAPTURE_FIFO_FLUSH</name>
                        <description>Set to 1 to continuously hold the trace FIFO in a flushed state and prevent overflow.

                            Before clearing this flag, configure and start a DMA channel with the correct DREQ for the TRACE_CAPTURE_FIFO register.

                            Clear this flag to begin sampling trace data, and set once again once the trace capture buffer is full. You must configure the TPIU in order to generate trace packets to be captured, as well as components like the ETM further upstream to generate the event stream propagated to the TPIU.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRACE_CAPTURE_FIFO</name>
                <addressOffset>0x00000004</addressOffset>
                <description>FIFO for trace data captured from the TPIU</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RDATA</name>
                        <description>Read from an 8 x 32-bit FIFO containing trace data captured from the TPIU.

                            Hardware pushes to the FIFO on rising edges of clk_sys, when either of the following is true:

                            * TPIU TRACECTL output is low (normal trace data)

                            * TPIU TRACETCL output is high, and TPIU TRACEDATA0 and TRACEDATA1 are both low (trigger packet)

                            These conditions are in accordance with Arm Coresight Architecture Spec v3.0 section D3.3.3: Decoding requirements for Trace Capture Devices

                            The data captured into the FIFO is the full 32-bit TRACEDATA bus output by the TPIU. Note that the TPIU is a DDR output at half of clk_sys, therefore this interface can capture the full 32-bit TPIU DDR output bandwidth as it samples once per active edge of the TPIU output clock.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>USB</name>
        <description>USB FS/LS controller device registers</description>
        <baseAddress>0x50110000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>280</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>USBCTRL_IRQ</name>
            <value>14</value>
        </interrupt>
        <registers>
            <register>
                <name>ADDR_ENDP</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Device address and endpoint control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Device endpoint to send data to. Only valid for HOST mode.</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with.</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>15</dim>
                <dimIncrement>4</dimIncrement>
                <dimIndex>1-15</dimIndex>
                <name>ADDR_ENDP_%s</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Interrupt endpoint 1. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MAIN_CTRL</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Main control register</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIM_TIMING</name>
                        <description>Reduced timings for simulation</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PHY_ISO</name>
                        <description>Isolates USB phy after controller power-up 
                            Remove isolation once software has configured the controller 
                            Not isolated = 0, Isolated = 1</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_NDEVICE</name>
                        <description>Device mode = 0, Host mode = 1</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CONTROLLER_EN</name>
                        <description>Enable controller</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SOF_WR</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Set the SOF (Start of Frame) frame number in the host controller. The SOF packet is sent every 1ms and the host will increment the frame number by 1 each time.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>COUNT</name>
                        <bitRange>[10:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SOF_RD</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Read the last SOF (Start of Frame) frame number seen. In device mode the last SOF received from the host. In host mode the last SOF sent by the host.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>COUNT</name>
                        <bitRange>[10:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SIE_CTRL</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>SIE control register</description>
                <resetValue>0x00008000</resetValue>
                <fields>
                    <field>
                        <name>EP0_INT_STALL</name>
                        <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP0_DOUBLE_BUF</name>
                        <description>Device: EP0 single buffered = 0, double buffered = 1</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP0_INT_1BUF</name>
                        <description>Device: Set bit in BUFF_STATUS for every buffer completed on EP0</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP0_INT_2BUF</name>
                        <description>Device: Set bit in BUFF_STATUS for every 2 buffers completed on EP0</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP0_INT_NAK</name>
                        <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DIRECT_EN</name>
                        <description>Direct bus drive enable</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DIRECT_DP</name>
                        <description>Direct control of DP</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DIRECT_DM</name>
                        <description>Direct control of DM</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP0_STOP_ON_SHORT_PACKET</name>
                        <description>Device: Stop EP0 on a short packet.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRANSCEIVER_PD</name>
                        <description>Power down bus transceiver</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RPU_OPT</name>
                        <description>Device: Pull-up strength (0=1K2, 1=2k3)</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PULLUP_EN</name>
                        <description>Device: Enable pull up resistor</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PULLDOWN_EN</name>
                        <description>Host: Enable pull down resistors</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET_BUS</name>
                        <description>Host: Reset bus</description>
                        <bitRange>[13:13]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>RESUME</name>
                        <description>Device: Remote wakeup. Device can initiate its own resume after suspend.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>VBUS_EN</name>
                        <description>Host: Enable VBUS</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>KEEP_ALIVE_EN</name>
                        <description>Host: Enable keep alive packet (for low speed bus)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOF_EN</name>
                        <description>Host: Enable SOF generation (for full speed bus)</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOF_SYNC</name>
                        <description>Host: Delay packet(s) until after SOF</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PREAMBLE_EN</name>
                        <description>Host: Preable enable for LS device on FS hub</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STOP_TRANS</name>
                        <description>Host: Stop transaction</description>
                        <bitRange>[4:4]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>RECEIVE_DATA</name>
                        <description>Host: Receive transaction (IN to host)</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEND_DATA</name>
                        <description>Host: Send transaction (OUT from host)</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEND_SETUP</name>
                        <description>Host: Send Setup packet</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>START_TRANS</name>
                        <description>Host: Start transaction</description>
                        <bitRange>[0:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SIE_STATUS</name>
                <addressOffset>0x00000050</addressOffset>
                <description>SIE status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA_SEQ_ERROR</name>
                        <description>Data Sequence Error.

                            The device can raise a sequence error in the following conditions:

