cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>USBPHY_DIRECT</name>
                <addressOffset>0x0000007c</addressOffset>
                <description>This register allows for direct control of the USB phy. Use in conjunction with usbphy_direct_override register to enable each override bit.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RX_DM_OVERRIDE</name>
                        <description>Override rx_dm value into controller</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_DP_OVERRIDE</name>
                        <description>Override rx_dp value into controller</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_DD_OVERRIDE</name>
                        <description>Override rx_dd value into controller</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_OVV</name>
                        <description>DM over voltage</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DP_OVV</name>
                        <description>DP over voltage</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DM_OVCN</name>
                        <description>DM overcurrent</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DP_OVCN</name>
                        <description>DP overcurrent</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_DM</name>
                        <description>DPM pin state</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_DP</name>
                        <description>DPP pin state</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_DD</name>
                        <description>Differential RX</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TX_DIFFMODE</name>
                        <description>TX_DIFFMODE=0: Single ended mode 
                            TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE ignored)</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_FSSLEW</name>
                        <description>TX_FSSLEW=0: Low speed slew rate 
                            TX_FSSLEW=1: Full speed slew rate</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_PD</name>
                        <description>TX power down override (if override enable is set). 1 = powered down.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_PD</name>
                        <description>RX power down override (if override enable is set). 1 = powered down.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DM</name>
                        <description>Output data. TX_DIFFMODE=1, Ignored 
                            TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive. DPM=TX_DM</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DP</name>
                        <description>Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair. TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP 
                            If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable drive. DPP=TX_DP</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DM_OE</name>
                        <description>Output enable. If TX_DIFFMODE=1, Ignored. 
                            If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state; 1 - DPM driving</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DP_OE</name>
                        <description>Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0 - DPP/DPM in Hi-Z state; 1 - DPP/DPM driving 
                            If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state; 1 - DPP driving</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLDN_EN</name>
                        <description>DM pull down enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLUP_EN</name>
                        <description>DM pull up enable</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLUP_HISEL</name>
                        <description>Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLDN_EN</name>
                        <description>DP pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLUP_EN</name>
                        <description>DP pull up enable</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLUP_HISEL</name>
                        <description>Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USBPHY_DIRECT_OVERRIDE</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Override enable for each control in usbphy_direct</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RX_DM_OVERRIDE_EN</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_DP_OVERRIDE_EN</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_DD_OVERRIDE_EN</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DIFFMODE_OVERRIDE_EN</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLUP_OVERRIDE_EN</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_FSSLEW_OVERRIDE_EN</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_PD_OVERRIDE_EN</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_PD_OVERRIDE_EN</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DM_OVERRIDE_EN</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DP_OVERRIDE_EN</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DM_OE_OVERRIDE_EN</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TX_DP_OE_OVERRIDE_EN</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLDN_EN_OVERRIDE_EN</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLDN_EN_OVERRIDE_EN</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLUP_EN_OVERRIDE_EN</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DM_PULLUP_HISEL_OVERRIDE_EN</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLUP_HISEL_OVERRIDE_EN</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USBPHY_TRIM</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Used to adjust trim values of USB phy pull down resistors.</description>
                <resetValue>0x00001f1f</resetValue>
                <fields>
                    <field>
                        <name>DM_PULLDN_TRIM</name>
                        <description>Value to drive to USB PHY 
                            DM pulldown resistor trim control 
                            Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DP_PULLDN_TRIM</name>
                        <description>Value to drive to USB PHY 
                            DP pulldown resistor trim control 
                            Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LINESTATE_TUNING</name>
                <addressOffset>0x00000088</addressOffset>
                <description>Used for debug only.</description>
                <resetValue>0x000000f8</resetValue>
                <fields>
                    <field>
                        <name>SPARE_FIX</name>
                        <bitRange>[11:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_LS_WAKE_FIX</name>
                        <description>Device - exit suspend on any non-idle signalling, not qualified with a 1ms timer</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_RX_ERR_QUIESCE</name>
                        <description>Device - suppress repeated errors until the device FSM is next in the process of decoding an inbound packet.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIE_RX_CHATTER_SE0_FIX</name>
                        <description>RX - when recovering from line chatter or bitstuff errors, treat SE0 as the end of chatter as well as 
                            8 consecutive idle bits.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIE_RX_BITSTUFF_FIX</name>
                        <description>RX - when a bitstuff error is signalled by rx_dasm, unconditionally terminate RX decode to 
                            avoid a hang during certain packet phases.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_BUFF_CONTROL_DOUBLE_READ_FIX</name>
                        <description>Device - the controller FSM performs two reads of the buffer status memory address to 
                            avoid sampling metastable data. An enabled buffer is only used if both reads match.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MULTI_HUB_FIX</name>
                        <description>Host - increase inter-packet and turnaround timeouts to accommodate worst-case hub delays.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LINESTATE_DELAY</name>
                        <description>Device/Host - add an extra 1-bit debounce of linestate sampling.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RCV_DELAY</name>
                        <description>Device - register the received data to account for hub bit dribble before EOP. Only affects certain hubs.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
