cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>INTR</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EPX_STOPPED_ON_NAK</name>
                        <description>Source: NAK_POLL.EPX_STOPPED_ON_NAK</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SM_WATCHDOG_FIRED</name>
                        <description>Source: DEV_SM_WATCHDOG.FIRED</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENDPOINT_ERROR</name>
                        <description>Source: SIE_STATUS.ENDPOINT_ERROR</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_SHORT_PACKET</name>
                        <description>Source: SIE_STATUS.RX_SHORT_PACKET</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EP_STALL_NAK</name>
                        <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ABORT_DONE</name>
                        <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SOF</name>
                        <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SETUP_REQ</name>
                        <description>Device. Source: SIE_STATUS.SETUP_REC</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_RESUME_FROM_HOST</name>
                        <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SUSPEND</name>
                        <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_CONN_DIS</name>
                        <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BUS_RESET</name>
                        <description>Source: SIE_STATUS.BUS_RESET</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VBUS_DETECT</name>
                        <description>Source: SIE_STATUS.VBUS_DETECTED</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Source: SIE_STATUS.STALL_REC</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_CRC</name>
                        <description>Source: SIE_STATUS.CRC_ERROR</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_BIT_STUFF</name>
                        <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_RX_OVERFLOW</name>
                        <description>Source: SIE_STATUS.RX_OVERFLOW</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_RX_TIMEOUT</name>
                        <description>Source: SIE_STATUS.RX_TIMEOUT</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_DATA_SEQ</name>
                        <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BUFF_STATUS</name>
                        <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRANS_COMPLETE</name>
                        <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_SOF</name>
                        <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_RESUME</name>
                        <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_CONN_DIS</name>
                        <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE</name>
                <addressOffset>0x00000090</addressOffset>
                <description>Interrupt Enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EPX_STOPPED_ON_NAK</name>
                        <description>Source: NAK_POLL.EPX_STOPPED_ON_NAK</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SM_WATCHDOG_FIRED</name>
                        <description>Source: DEV_SM_WATCHDOG.FIRED</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_ERROR</name>
                        <description>Source: SIE_STATUS.ENDPOINT_ERROR</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_SHORT_PACKET</name>
                        <description>Source: SIE_STATUS.RX_SHORT_PACKET</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP_STALL_NAK</name>
                        <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ABORT_DONE</name>
                        <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SOF</name>
                        <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SETUP_REQ</name>
                        <description>Device. Source: SIE_STATUS.SETUP_REC</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_RESUME_FROM_HOST</name>
                        <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SUSPEND</name>
                        <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_CONN_DIS</name>
                        <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUS_RESET</name>
                        <description>Source: SIE_STATUS.BUS_RESET</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VBUS_DETECT</name>
                        <description>Source: SIE_STATUS.VBUS_DETECTED</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Source: SIE_STATUS.STALL_REC</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_CRC</name>
                        <description>Source: SIE_STATUS.CRC_ERROR</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_BIT_STUFF</name>
                        <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_RX_OVERFLOW</name>
                        <description>Source: SIE_STATUS.RX_OVERFLOW</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_RX_TIMEOUT</name>
                        <description>Source: SIE_STATUS.RX_TIMEOUT</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_DATA_SEQ</name>
                        <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFF_STATUS</name>
                        <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRANS_COMPLETE</name>
                        <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_SOF</name>
                        <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_RESUME</name>
                        <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_CONN_DIS</name>
                        <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
