cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TRNG</name>
        <description>ARM TrustZone RNG register block</description>
        <baseAddress>0x400f0000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>492</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>TRNG_IRQ</name>
            <value>39</value>
        </interrupt>
        <registers>
            <register>
                <name>RNG_IMR</name>
                <addressOffset>0x00000100</addressOffset>
                <description>Interrupt masking.</description>
                <resetValue>0x0000000f</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VN_ERR_INT_MASK</name>
                        <description>1&#39;b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CRNGT_ERR_INT_MASK</name>
                        <description>1&#39;b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOCORR_ERR_INT_MASK</name>
                        <description>1&#39;b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EHR_VALID_INT_MASK</name>
                        <description>1&#39;b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_ISR</name>
                <addressOffset>0x00000104</addressOffset>
                <description>RNG status register. If corresponding RNG_IMR bit is unmasked, an interrupt will be generated.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VN_ERR</name>
                        <description>1&#39;b1 indicates Von Neuman error. Error in von Neuman occurs if 32 consecutive collected bits are identical, ZERO or ONE.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CRNGT_ERR</name>
                        <description>1&#39;b1 indicates CRNGT in the RNG test failed. Failure occurs when two consecutive blocks of 16 collected bits are equal.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AUTOCORR_ERR</name>
                        <description>1&#39;b1 indicates Autocorrelation test failed four times in a row. When set, RNG cease from functioning until next reset.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EHR_VALID</name>
                        <description>1&#39;b1 indicates that 192 bits have been collected in the RNG, and are ready to be read.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_ICR</name>
                <addressOffset>0x00000108</addressOffset>
                <description>Interrupt/status bit clear Register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VN_ERR</name>
                        <description>Write 1&#39;b1 - clear corresponding bit in RNG_ISR.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CRNGT_ERR</name>
                        <description>Write 1&#39;b1 - clear corresponding bit in RNG_ISR.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOCORR_ERR</name>
                        <description>Cannot be cleared by SW! Only RNG reset clears this bit.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EHR_VALID</name>
                        <description>Write 1&#39;b1 - clear corresponding bit in RNG_ISR.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRNG_CONFIG</name>
                <addressOffset>0x0000010c</addressOffset>
                <description>Selecting the inverter-chain length.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RND_SRC_SEL</name>
                        <description>Selects the number of inverters (out of four possible selections) in the ring oscillator (the entropy source).</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRNG_VALID</name>
                <addressOffset>0x00000110</addressOffset>
                <description>192 bit collection indication.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EHR_VALID</name>
                        <description>1&#39;b1 indicates that collection of bits in the RNG is completed, and data can be read from EHR_DATA register.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA0</name>
                <addressOffset>0x00000114</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA0</name>
                        <description>Bits [31:0] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA1</name>
                <addressOffset>0x00000118</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA1</name>
                        <description>Bits [63:32] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA2</name>
                <addressOffset>0x0000011c</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA2</name>
                        <description>Bits [95:64] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA3</name>
                <addressOffset>0x00000120</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA3</name>
                        <description>Bits [127:96] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA4</name>
                <addressOffset>0x00000124</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA4</name>
                        <description>Bits [159:128] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EHR_DATA5</name>
                <addressOffset>0x00000128</addressOffset>
                <description>RNG collected bits.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EHR_DATA5</name>
                        <description>Bits [191:160] of Entropy Holding Register (EHR) - RNG output register</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RND_SOURCE_ENABLE</name>
                <addressOffset>0x0000012c</addressOffset>
                <description>Enable signal for the random source.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RND_SRC_EN</name>
                        <description>* 1&#39;b1 - entropy source is enabled. *1&#39;b0 - entropy source is disabled</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAMPLE_CNT1</name>
                <addressOffset>0x00000130</addressOffset>
                <description>Counts clocks between sampling of random bit.</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>SAMPLE_CNTR1</name>
                        <description>Sets the number of rng_clk cycles between two consecutive ring oscillator samples. Note! If the Von-Neuman is bypassed, the minimum value for sample counter must not be less then decimal seventeen</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>AUTOCORR_STATISTIC</name>
                <addressOffset>0x00000134</addressOffset>
                <description>Statistic about Autocorrelation test activations.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AUTOCORR_FAILS</name>
                        <description>Count each time an autocorrelation test fails. Any write to the register reset the counter. Stop collecting statistic if one of the counters reached the limit.</description>
                        <bitRange>[21:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOCORR_TRYS</name>
                        <description>Count each time an autocorrelation test starts. Any write to the register reset the counter. Stop collecting statistic if one of the counters reached the limit.</description>
                        <bitRange>[13:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRNG_DEBUG_CONTROL</name>
                <addressOffset>0x00000138</addressOffset>
                <description>Debug register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AUTO_CORRELATE_BYPASS</name>
                        <description>When set, the autocorrelation test in the TRNG module is bypassed.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRNG_CRNGT_BYPASS</name>
                        <description>When set, the CRNGT test in the RNG is bypassed.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VNC_BYPASS</name>
                        <description>When set, the Von-Neuman balancer is bypassed (including the 32 consecutive bits test).</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESERVED</name>
                        <description>N/A</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRNG_SW_RESET</name>
                <addressOffset>0x00000140</addressOffset>
                <description>Generate internal SW reset within the RNG block.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRNG_SW_RESET</name>
                        <description>Writing 1&#39;b1 to this register causes an internal RNG reset.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_DEBUG_EN_INPUT</name>
                <addressOffset>0x000001b4</addressOffset>
                <description>Enable the RNG debug mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RNG_DEBUG_EN</name>
                        <description>* 1&#39;b1 - debug mode is enabled. *1&#39;b0 - debug mode is disabled</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRNG_BUSY</name>
                <addressOffset>0x000001b8</addressOffset>
                <description>RNG Busy indication.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRNG_BUSY</name>
                        <description>Reflects rng_busy status.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RST_BITS_COUNTER</name>
                <addressOffset>0x000001bc</addressOffset>
                <description>Reset the counter of collected bits in the RNG.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RST_BITS_COUNTER</name>
                        <description>Writing any value to this address will reset the bits counter and RNG valid registers. RND_SORCE_ENABLE register must be unset in order for the reset to take place.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_VERSION</name>
                <addressOffset>0x000001c0</addressOffset>
                <description>Displays the version settings of the TRNG.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RNG_USE_5_SBOXES</name>
                        <description>* 1&#39;b1 - 5 SBOX AES. *1&#39;b0 - 20 SBOX AES</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RESEEDING_EXISTS</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KAT_EXISTS</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRNG_EXISTS</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRNG_TESTS_BYPASS_EN</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AUTOCORR_EXISTS</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CRNGT_EXISTS</name>
                        <description>* 1&#39;b1 - Exists. *1&#39;b0 - Does not exist</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EHR_WIDTH_192</name>
                        <description>* 1&#39;b1 - 192-bit EHR. *1&#39;b0 - 128-bit EHR</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
