cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>RNG_BIST_CNTR_0</name>
                <addressOffset>0x000001e0</addressOffset>
                <description>Collected BIST results.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROSC_CNTR_VAL</name>
                        <description>Reflects the results of RNG BIST counter.</description>
                        <bitRange>[21:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_BIST_CNTR_1</name>
                <addressOffset>0x000001e4</addressOffset>
                <description>Collected BIST results.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROSC_CNTR_VAL</name>
                        <description>Reflects the results of RNG BIST counter.</description>
                        <bitRange>[21:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RNG_BIST_CNTR_2</name>
                <addressOffset>0x000001e8</addressOffset>
                <description>Collected BIST results.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESERVED</name>
                        <description>RESERVED</description>
                        <bitRange>[31:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROSC_CNTR_VAL</name>
                        <description>Reflects the results of RNG BIST counter.</description>
                        <bitRange>[21:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>GLITCH_DETECTOR</name>
        <description>Glitch detector controls</description>
        <baseAddress>0x40158000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>24</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>ARM</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Forcibly arm the glitch detectors, if they are not already armed by OTP. When armed, any individual detector trigger will cause a restart of the switched core power domain&#39;s power-on reset state machine.

                    Glitch detector triggers are recorded accumulatively in TRIG_STATUS. If the system is reset by a glitch detector trigger, this is recorded in POWMAN_CHIP_RESET.

                    This register is Secure read/write only.</description>
                <resetValue>0x00005bad</resetValue>
                <fields>
                    <field>
                        <name>ARM</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>no</name>
                                <value>23469</value>
                                <description>Do not force the glitch detectors to be armed</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>yes</name>
                                <value>0</value>
                                <description>Force the glitch detectors to be armed. (Any value other than ARM_NO counts as YES)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>DISARM</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DISARM</name>
                        <description>Forcibly disarm the glitch detectors, if they are armed by OTP. Ignored if ARM is YES.

                            This register is Secure read/write only.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>no</name>
                                <value>0</value>
                                <description>Do not disarm the glitch detectors. (Any value other than DISARM_YES counts as NO)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>yes</name>
                                <value>56495</value>
                                <description>Disarm the glitch detectors</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SENSITIVITY</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Adjust the sensitivity of glitch detectors to values other than their OTP-provided defaults.

                    This register is Secure read/write only.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DEFAULT</name>
                        <bitRange>[31:24]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>yes</name>
                                <value>0</value>
                                <description>Use the default sensitivity configured in OTP for all detectors. (Any value other than DEFAULT_NO counts as YES)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>no</name>
                                <value>222</value>
                                <description>Do not use the default sensitivity configured in OTP. Instead use the value from this register.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DET3_INV</name>
                        <description>Must be the inverse of DET3, else the default value is used.</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET2_INV</name>
                        <description>Must be the inverse of DET2, else the default value is used.</description>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET1_INV</name>
                        <description>Must be the inverse of DET1, else the default value is used.</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET0_INV</name>
                        <description>Must be the inverse of DET0, else the default value is used.</description>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET3</name>
                        <description>Set sensitivity for detector 3. Higher values are more sensitive.</description>
                        <bitRange>[7:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET2</name>
                        <description>Set sensitivity for detector 2. Higher values are more sensitive.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET1</name>
                        <description>Set sensitivity for detector 1. Higher values are more sensitive.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DET0</name>
                        <description>Set sensitivity for detector 0. Higher values are more sensitive.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LOCK</name>
                <addressOffset>0x0000000c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCK</name>
                        <description>Write any nonzero value to disable writes to ARM, DISARM, SENSITIVITY and LOCK. This register is Secure read/write only.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRIG_STATUS</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Set when a detector output triggers. Write-1-clear.

                    (May immediately return high if the detector remains in a failed state. Detectors can only be cleared by a full reset of the switched core power domain.)

                    This register is Secure read/write only.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DET3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DET2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DET1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DET0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRIG_FORCE</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Simulate the firing of one or more detectors. Writing ones to this register will set the matching bits in STATUS_TRIG.

                    If the glitch detectors are currently armed, writing ones will also immediately reset the switched core power domain, and set the reset reason latches in POWMAN_CHIP_RESET to indicate a glitch detector resets.

                    This register is Secure read/write only.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIG_FORCE</name>
                        <bitRange>[3:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
