cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>OTP</name>
        <description>SNPS OTP control IF (SBPI and RPi wrapper control)</description>
        <baseAddress>0x40120000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>372</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>OTP_IRQ</name>
            <value>38</value>
        </interrupt>
        <registers>
            <register>
                <dim>64</dim>
                <dimIncrement>4</dimIncrement>
                <name>SW_LOCK%s</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Software lock register for page n [0..63].\n
                    Locks are initialised from the OTP lock pages at reset.\n
                    This register can be written to further advance the lock state of each page\n
                    (until next reset), and read to check the current lock state of a page.
                </description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR&#39;d with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR&#39;d with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_INSTR</name>
                <addressOffset>0x00000100</addressOffset>
                <description>Dispatch instructions to the SBPI interface, used for programming the OTP fuses.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EXEC</name>
                        <description>Execute instruction</description>
                        <bitRange>[30:30]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>IS_WR</name>
                        <description>Payload type is write</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HAS_PAYLOAD</name>
                        <description>Instruction has payload (data to be written or to be read)</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAYLOAD_SIZE_M1</name>
                        <description>Instruction payload size in bytes minus 1</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TARGET</name>
                        <description>Instruction target, it can be PMC (0x3a) or DAP (0x02)</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CMD</name>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SHORT_WDATA</name>
                        <description>wdata to be used only when payload_size_m1=0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_WDATA_0</name>
                <addressOffset>0x00000104</addressOffset>
                <description>SBPI write payload bytes 3..0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_WDATA_0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_WDATA_1</name>
                <addressOffset>0x00000108</addressOffset>
                <description>SBPI write payload bytes 7..4</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_WDATA_1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_WDATA_2</name>
                <addressOffset>0x0000010c</addressOffset>
                <description>SBPI write payload bytes 11..8</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_WDATA_2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_WDATA_3</name>
                <addressOffset>0x00000110</addressOffset>
                <description>SBPI write payload bytes 15..12</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_WDATA_3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_RDATA_0</name>
                <addressOffset>0x00000114</addressOffset>
                <description>Read payload bytes 3..0. Once read, the data in the register will automatically clear to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_RDATA_0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_RDATA_1</name>
                <addressOffset>0x00000118</addressOffset>
                <description>Read payload bytes 7..4. Once read, the data in the register will automatically clear to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_RDATA_1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_RDATA_2</name>
                <addressOffset>0x0000011c</addressOffset>
                <description>Read payload bytes 11..8. Once read, the data in the register will automatically clear to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_RDATA_2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_RDATA_3</name>
                <addressOffset>0x00000120</addressOffset>
                <description>Read payload bytes 15..12. Once read, the data in the register will automatically clear to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SBPI_RDATA_3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SBPI_STATUS</name>
                <addressOffset>0x00000124</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MISO</name>
                        <description>SBPI MISO (master in - slave out): response from SBPI</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FLAG</name>
                        <description>SBPI flag</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INSTR_MISS</name>
                        <description>Last instruction missed (dropped), as the previous has not finished running</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>INSTR_DONE</name>
                        <description>Last instruction done</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RDATA_VLD</name>
                        <description>Read command has returned data</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>USR</name>
                <addressOffset>0x00000128</addressOffset>
                <description>Controls for APB data read interface (USER interface)</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>PD</name>
                        <description>Power-down; 1 disables current reference. Must be 0 to read data from the OTP.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DCTRL</name>
                        <description>1 enables USER interface; 0 disables USER interface (enables SBPI).

                            This bit must be cleared before performing any SBPI access, such as when programming the OTP. The APB data read interface (USER interface) will be inaccessible during this time, and will return a bus error if any read is attempted.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBG</name>
                <addressOffset>0x0000012c</addressOffset>
                <description>Debug for OTP power-on state machine</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CUSTOMER_RMA_FLAG</name>
                        <description>The chip is in RMA mode</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PSM_STATE</name>
                        <description>Monitor the PSM FSM&#39;s state</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROSC_UP</name>
                        <description>Ring oscillator is up and running</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROSC_UP_SEEN</name>
                        <description>Ring oscillator was seen up and running</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>BOOT_DONE</name>
                        <description>PSM boot done status flag</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PSM_DONE</name>
                        <description>PSM done status flag</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIST</name>
                <addressOffset>0x00000134</addressOffset>
                <description>During BIST, count address locations that have at least one leaky bit</description>
                <resetValue>0x0fff0000</resetValue>
                <fields>
                    <field>
                        <name>CNT_FAIL</name>
                        <description>Flag if the count of address locations with at least one leaky bit exceeds cnt_max</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CNT_CLR</name>
                        <description>Clear counter before use</description>
                        <bitRange>[29:29]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CNT_ENA</name>
                        <description>Enable the counter before the BIST function is initiated</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CNT_MAX</name>
                        <description>The cnt_fail flag will be set if the number of leaky locations exceeds this number</description>
                        <bitRange>[27:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CNT</name>
                        <description>Number of locations that have at least one leaky bit. Note: This count is true only if the BIST was initiated without the fix option.</description>
                        <bitRange>[12:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRT_KEY_W0</name>
                <addressOffset>0x00000138</addressOffset>
                <description>Word 0 (bits 31..0) of the key. Write only, read returns 0x0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRT_KEY_W0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRT_KEY_W1</name>
                <addressOffset>0x0000013c</addressOffset>
                <description>Word 1 (bits 63..32) of the key. Write only, read returns 0x0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRT_KEY_W1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRT_KEY_W2</name>
                <addressOffset>0x00000140</addressOffset>
                <description>Word 2 (bits 95..64) of the key. Write only, read returns 0x0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRT_KEY_W2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRT_KEY_W3</name>
                <addressOffset>0x00000144</addressOffset>
                <description>Word 3 (bits 127..96) of the key. Write only, read returns 0x0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRT_KEY_W3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRITICAL</name>
                <addressOffset>0x00000148</addressOffset>
                <description>Quickly check values of critical flags read during boot up</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RISCV_DISABLE</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARM_DISABLE</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GLITCH_DETECTOR_SENS</name>
                        <bitRange>[6:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GLITCH_DETECTOR_ENABLE</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEFAULT_ARCHSEL</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEBUG_DISABLE</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SECURE_DEBUG_DISABLE</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SECURE_BOOT_ENABLE</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY_VALID</name>
                <addressOffset>0x0000014c</addressOffset>
                <description>Which keys were valid (enrolled) at boot time</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>KEY_VALID</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEBUGEN</name>
                <addressOffset>0x00000150</addressOffset>
                <description>Enable a debug feature that has been disabled. Debug features are disabled if one of the relevant critical boot flags is set in OTP (DEBUG_DISABLE or SECURE_DEBUG_DISABLE), OR if a debug key is marked valid in OTP, and the matching key value has not been supplied over SWD.

                    Specifically:

