cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    - The DEBUG_DISABLE flag disables all debug features. This can be fully overridden by setting all bits of this register.

                    - The SECURE_DEBUG_DISABLE flag disables secure processor debug. This can be fully overridden by setting the PROC0_SECURE and PROC1_SECURE bits of this register.

                    - If a single debug key has been registered, and no matching key value has been supplied over SWD, then all debug features are disabled. This can be fully overridden by setting all bits of this register.

                    - If both debug keys have been registered, and the Non-secure key&#39;s value (key 6) has been supplied over SWD, secure processor debug is disabled. This can be fully overridden by setting the PROC0_SECURE and PROC1_SECURE bits of this register.

                    - If both debug keys have been registered, and the Secure key&#39;s value (key 5) has been supplied over SWD, then no debug features are disabled by the key mechanism. However, note that in this case debug features may still be disabled by the critical boot flags.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MISC</name>
                        <description>Enable other debug components. Specifically, the CTI, and the APB-AP used to access the RISC-V Debug Module.

                            These components are disabled by default if either of the debug disable critical flags is set, or if at least one debug key has been enrolled and the least secure of these enrolled key values has not been provided over SWD.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC1_SECURE</name>
                        <description>Permit core 1&#39;s Mem-AP to generate Secure accesses, assuming it is enabled at all. Also enable secure debug of core 1 (SPIDEN and SPNIDEN).

                            Secure debug of core 1 is disabled by default if the secure debug disable critical flag is set, or if at least one debug key has been enrolled and the most secure of these enrolled key values not yet provided over SWD.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC1</name>
                        <description>Enable core 1&#39;s Mem-AP if it is currently disabled.

                            The Mem-AP is disabled by default if either of the debug disable critical flags is set, or if at least one debug key has been enrolled and the least secure of these enrolled key values has not been provided over SWD.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC0_SECURE</name>
                        <description>Permit core 0&#39;s Mem-AP to generate Secure accesses, assuming it is enabled at all. Also enable secure debug of core 0 (SPIDEN and SPNIDEN).

                            Secure debug of core 0 is disabled by default if the secure debug disable critical flag is set, or if at least one debug key has been enrolled and the most secure of these enrolled key values not yet provided over SWD.

                            Note also that core Mem-APs are unconditionally disabled when a core is switched to RISC-V mode (by setting the ARCHSEL bit and performing a warm reset of the core).</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC0</name>
                        <description>Enable core 0&#39;s Mem-AP if it is currently disabled.

                            The Mem-AP is disabled by default if either of the debug disable critical flags is set, or if at least one debug key has been enrolled and the least secure of these enrolled key values has not been provided over SWD.

                            Note also that core Mem-APs are unconditionally disabled when a core is switched to RISC-V mode (by setting the ARCHSEL bit and performing a warm reset of the core).</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEBUGEN_LOCK</name>
                <addressOffset>0x00000154</addressOffset>
                <description>Write 1s to lock corresponding bits in DEBUGEN. This register is reset by the processor cold reset.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MISC</name>
                        <description>Write 1 to lock the MISC bit of DEBUGEN. Can&#39;t be cleared once set.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC1_SECURE</name>
                        <description>Write 1 to lock the PROC1_SECURE bit of DEBUGEN. Can&#39;t be cleared once set.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC1</name>
                        <description>Write 1 to lock the PROC1 bit of DEBUGEN. Can&#39;t be cleared once set.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC0_SECURE</name>
                        <description>Write 1 to lock the PROC0_SECURE bit of DEBUGEN. Can&#39;t be cleared once set.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROC0</name>
                        <description>Write 1 to lock the PROC0 bit of DEBUGEN. Can&#39;t be cleared once set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ARCHSEL</name>
                <addressOffset>0x00000158</addressOffset>
                <description>Architecture select (Arm/RISC-V). The default and allowable values of this register are constrained by the critical boot flags.

                    This register is reset by the earliest reset in the switched core power domain (before a processor cold reset).

