cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    Cores sample their architecture select signal on a warm reset. The source of the warm reset could be the system power-up state machine, the watchdog timer, Arm SYSRESETREQ or from RISC-V hartresetreq.

                    Note that when an Arm core is deselected, its cold reset domain is also held in reset, since in particular the SYSRESETREQ bit becomes inaccessible once the core is deselected. Note also the RISC-V cores do not have a cold reset domain, since their corresponding controls are located in the Debug Module.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CORE1</name>
                        <description>Select architecture for core 1.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>arm</name>
                                <value>0</value>
                                <description>Switch core 1 to Arm (Cortex-M33)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>riscv</name>
                                <value>1</value>
                                <description>Switch core 1 to RISC-V (Hazard3)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>Select architecture for core 0.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>arm</name>
                                <value>0</value>
                                <description>Switch core 0 to Arm (Cortex-M33)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>riscv</name>
                                <value>1</value>
                                <description>Switch core 0 to RISC-V (Hazard3)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>ARCHSEL_STATUS</name>
                <addressOffset>0x0000015c</addressOffset>
                <description>Get the current architecture select state of each core. Cores sample the current value of the ARCHSEL register when their warm reset is released, at which point the corresponding bit in this register will also update.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CORE1</name>
                        <description>Current architecture for core 0. Updated on processor warm reset.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>arm</name>
                                <value>0</value>
                                <description>Core 1 is currently Arm (Cortex-M33)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>riscv</name>
                                <value>1</value>
                                <description>Core 1 is currently RISC-V (Hazard3)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>Current architecture for core 0. Updated on processor warm reset.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>arm</name>
                                <value>0</value>
                                <description>Core 0 is currently Arm (Cortex-M33)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>riscv</name>
                                <value>1</value>
                                <description>Core 0 is currently RISC-V (Hazard3)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTDIS</name>
                <addressOffset>0x00000160</addressOffset>
                <description>Tell the bootrom to ignore scratch register boot vectors (both power manager and watchdog) on the next power up.

                    If an early boot stage has soft-locked some OTP pages in order to protect their contents from later stages, there is a risk that Secure code running at a later stage can unlock the pages by performing a watchdog reset that resets the OTP.

                    This register can be used to ensure that the bootloader runs as normal on the next power up, preventing Secure code at a later stage from accessing OTP in its unlocked state.

                    Should be used in conjunction with the power manager BOOTDIS register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NEXT</name>
                        <description>This flag always ORs writes into its current contents. It can be set but not cleared by software.

                            The BOOTDIS_NEXT bit is OR&#39;d into the BOOTDIS_NOW bit when the core is powered down. Simultaneously, the BOOTDIS_NEXT bit is cleared. Setting this bit means that the boot scratch registers will be ignored following the next core power down.

                            This flag should be set by an early boot stage that has soft-locked OTP pages, to prevent later stages from unlocking it via watchdog reset.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NOW</name>
                        <description>When the core is powered down, the current value of BOOTDIS_NEXT is OR&#39;d into BOOTDIS_NOW, and BOOTDIS_NEXT is cleared.

                            The bootrom checks this flag before reading the boot scratch registers. If it is set, the bootrom clears it, and ignores the BOOT registers. This prevents Secure software from diverting the boot path before a bootloader has had the chance to soft lock OTP pages containing sensitive data.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x00000164</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APB_RD_NSEC_FAIL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>APB_RD_SEC_FAIL</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>APB_DCTRL_FAIL</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>SBPI_WR_FAIL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>SBPI_FLAG_N</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE</name>
                <addressOffset>0x00000168</addressOffset>
                <description>Interrupt Enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APB_RD_NSEC_FAIL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB_RD_SEC_FAIL</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB_DCTRL_FAIL</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBPI_WR_FAIL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBPI_FLAG_N</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF</name>
                <addressOffset>0x0000016c</addressOffset>
                <description>Interrupt Force</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APB_RD_NSEC_FAIL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB_RD_SEC_FAIL</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB_DCTRL_FAIL</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBPI_WR_FAIL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBPI_FLAG_N</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS</name>
                <addressOffset>0x00000170</addressOffset>
                <description>Interrupt status after masking &amp; forcing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APB_RD_NSEC_FAIL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>APB_RD_SEC_FAIL</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>APB_DCTRL_FAIL</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SBPI_WR_FAIL</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SBPI_FLAG_N</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
