cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    This should be configured to produce an exact 48 MHz based on the crystal oscillator frequency. User mode software may also use this value to calculate the expected crystal frequency based on an assumed 48 MHz PLL output.

                    If no configuration is given, the crystal is assumed to be 12 MHz.

                    The PLL frequency can be calculated as:

                    PLL out = (XOSC frequency / (REFDIV+1)) x FBDIV / (POSTDIV1 x POSTDIV2)

                    Conversely the crystal frequency can be calculated as:

                    XOSC frequency = 48 MHz x (REFDIV+1) x (POSTDIV1 x POSTDIV2) / FBDIV

                    (Note the  +1 on REFDIV is because the value stored in this OTP location is the actual divisor value minus one.)

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_XOSC_CFG are both correctly programmed.</description>
                <size>16</size>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>REFDIV</name>
                        <description>PLL reference divisor, minus one.

                            Programming a value of 0 means a reference divisor of 1. Programming a value of 1 means a reference divisor of 2 (for exceptionally fast XIN inputs)</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>POSTDIV2</name>
                        <description>PLL post-divide 2 divisor, in the range 1..7 inclusive.</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>POSTDIV1</name>
                        <description>PLL post-divide 1 divisor, in the range 1..7 inclusive.</description>
                        <bitRange>[11:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FBDIV</name>
                        <description>PLL feedback divisor, in the range 16..320 inclusive.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTSEL_XOSC_CFG</name>
                <addressOffset>0x00b0</addressOffset>
                <description>Non-default crystal oscillator configuration for the USB bootloader. (ECC)

                    These values may also be used by user code configuring the crystal oscillator.

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_PLL_CFG are both correctly programmed.</description>
                <size>16</size>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>RANGE</name>
                        <description>Value of the XOSC_CTRL_FREQ_RANGE register.</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>1_15MHZ</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>10_30MHZ</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>25_60MHZ</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>40_100MHZ</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STARTUP</name>
                        <description>Value of the XOSC_STARTUP register</description>
                        <bitRange>[13:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USB_WHITE_LABEL_ADDR</name>
                <addressOffset>0x00b8</addressOffset>
                <description>Row index of the USB_WHITE_LABEL structure within OTP (ECC)

                    The table has 16 rows, each of which are also ECC and marked valid by the corresponding valid bit in USB_BOOT_FLAGS (ECC).

                    The entries are either _VALUEs where the 16 bit value is used as is, or _STRDEFs which acts as a pointers to a string value.

                    The value stored in a _STRDEF is two separate bytes: The low seven bits of the first (LSB) byte indicates the number of characters in the string, and the top bit of the first (LSB) byte if set to indicate that each character in the string is two bytes (Unicode) versus one byte if unset. The second (MSB) byte represents the location of the string data, and is encoded as the number of rows from this USB_WHITE_LABEL_ADDR; i.e. the row of the start of the string is USB_WHITE_LABEL_ADDR value + msb_byte.

                    In each case, the corresponding valid bit enables replacing the default value for the corresponding item provided by the boot rom.

                    Note that Unicode _STRDEFs are only supported for USB_DEVICE_PRODUCT_STRDEF, USB_DEVICE_SERIAL_NUMBER_STRDEF and USB_DEVICE_MANUFACTURER_STRDEF. Unicode values will be ignored if specified for other fields, and non-unicode values for these three items will be converted to Unicode characters by setting the upper 8 bits to zero.

