cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                            A KEY_VALID bit is ignored if the corresponding KEY_INVALID bit is set. Boot keys are considered valid only when KEY_VALID is set and KEY_INVALID is clear.

                            Do not mark a boot key as KEY_VALID if it does not contain a valid SHA-256 hash of your secp256k1 public key. Verify keys after programming, before setting the KEY_VALID bits -- a boot key with uncorrectable ECC faults will render your device unbootable if secure boot is enabled.

                            Do not enable secure boot without first installing a valid key. This will render your device unbootable.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT_FLAGS1_R1</name>
                <addressOffset>0x00000130</addressOffset>
                <description>Redundant copy of BOOT_FLAGS1</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOT_FLAGS1_R1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT_FLAGS1_R2</name>
                <addressOffset>0x00000134</addressOffset>
                <description>Redundant copy of BOOT_FLAGS1</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOT_FLAGS1_R2</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION0</name>
                <addressOffset>0x00000138</addressOffset>
                <description>Default boot version thermometer counter, bits 23:0 (RBIT-3)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION0</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION0_R1</name>
                <addressOffset>0x0000013c</addressOffset>
                <description>Redundant copy of DEFAULT_BOOT_VERSION0</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION0_R1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION0_R2</name>
                <addressOffset>0x00000140</addressOffset>
                <description>Redundant copy of DEFAULT_BOOT_VERSION0</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION0_R2</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION1</name>
                <addressOffset>0x00000144</addressOffset>
                <description>Default boot version thermometer counter, bits 47:24 (RBIT-3)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION1_R1</name>
                <addressOffset>0x00000148</addressOffset>
                <description>Redundant copy of DEFAULT_BOOT_VERSION1</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION1_R1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEFAULT_BOOT_VERSION1_R2</name>
                <addressOffset>0x0000014c</addressOffset>
                <description>Redundant copy of DEFAULT_BOOT_VERSION1</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>DEFAULT_BOOT_VERSION1_R2</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_DEVINFO</name>
                <addressOffset>0x00000150</addressOffset>
                <description>Stores information about external flash device(s). (ECC)

                    Assumed to be valid if BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CS1_SIZE</name>
                        <description>The size of the flash/PSRAM device on chip select 1 (addressable at 0x11000000 through 0x11ffffff).

                            A value of zero is decoded as a size of zero (no device). Nonzero values are decoded as 4kiB &lt;&lt; CS1_SIZE. For example, four megabytes is encoded with a CS1_SIZE value of 10, and 16 megabytes is encoded with a CS1_SIZE value of 12.

