cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
                    This should be configured to produce an exact 48 MHz based on the crystal oscillator frequency. User mode software may also use this value to calculate the expected crystal frequency based on an assumed 48 MHz PLL output.

                    If no configuration is given, the crystal is assumed to be 12 MHz.

                    The PLL frequency can be calculated as:

                    PLL out = (XOSC frequency / (REFDIV+1)) x FBDIV / (POSTDIV1 x POSTDIV2)

                    Conversely the crystal frequency can be calculated as:

                    XOSC frequency = 48 MHz x (REFDIV+1) x (POSTDIV1 x POSTDIV2) / FBDIV

                    (Note the  +1 on REFDIV is because the value stored in this OTP location is the actual divisor value minus one.)

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_XOSC_CFG are both correctly programmed.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REFDIV</name>
                        <description>PLL reference divisor, minus one.

                            Programming a value of 0 means a reference divisor of 1. Programming a value of 1 means a reference divisor of 2 (for exceptionally fast XIN inputs)</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>POSTDIV2</name>
                        <description>PLL post-divide 2 divisor, in the range 1..7 inclusive.</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>POSTDIV1</name>
                        <description>PLL post-divide 1 divisor, in the range 1..7 inclusive.</description>
                        <bitRange>[11:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FBDIV</name>
                        <description>PLL feedback divisor, in the range 16..320 inclusive.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTSEL_XOSC_CFG</name>
                <addressOffset>0x00000160</addressOffset>
                <description>Non-default crystal oscillator configuration for the USB bootloader. (ECC)

                    These values may also be used by user code configuring the crystal oscillator.

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_PLL_CFG are both correctly programmed.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RANGE</name>
                        <description>Value of the XOSC_CTRL_FREQ_RANGE register.</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>1_15MHZ</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>10_30MHZ</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>25_60MHZ</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>40_100MHZ</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STARTUP</name>
                        <description>Value of the XOSC_STARTUP register</description>
                        <bitRange>[13:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USB_BOOT_FLAGS</name>
                <addressOffset>0x00000164</addressOffset>
                <description>USB boot specific feature flags (RBIT-3)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DP_DM_SWAP</name>
                        <description>Swap DM/DP during USB boot, to support board layouts with mirrored USB routing (deliberate or accidental).</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WHITE_LABEL_ADDR_VALID</name>
                        <description>valid flag for INFO_UF2_TXT_BOARD_ID_STRDEF entry of the USB_WHITE_LABEL struct (index 15)</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_INFO_UF2_TXT_BOARD_ID_STRDEF_VALID</name>
                        <description>valid flag for the USB_WHITE_LABEL_ADDR field</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_INFO_UF2_TXT_MODEL_STRDEF_VALID</name>
                        <description>valid flag for INFO_UF2_TXT_MODEL_STRDEF entry of the USB_WHITE_LABEL struct (index 14)</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_INDEX_HTM_REDIRECT_NAME_STRDEF_VALID</name>
                        <description>valid flag for INDEX_HTM_REDIRECT_NAME_STRDEF entry of the USB_WHITE_LABEL struct (index 13)</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_INDEX_HTM_REDIRECT_URL_STRDEF_VALID</name>
                        <description>valid flag for INDEX_HTM_REDIRECT_URL_STRDEF entry of the USB_WHITE_LABEL struct (index 12)</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_SCSI_INQUIRY_VERSION_STRDEF_VALID</name>
                        <description>valid flag for SCSI_INQUIRY_VERSION_STRDEF entry of the USB_WHITE_LABEL struct (index 11)</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_SCSI_INQUIRY_PRODUCT_STRDEF_VALID</name>
                        <description>valid flag for SCSI_INQUIRY_PRODUCT_STRDEF entry of the USB_WHITE_LABEL struct (index 10)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_SCSI_INQUIRY_VENDOR_STRDEF_VALID</name>
                        <description>valid flag for SCSI_INQUIRY_VENDOR_STRDEF entry of the USB_WHITE_LABEL struct (index 9)</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_VOLUME_LABEL_STRDEF_VALID</name>
                        <description>valid flag for VOLUME_LABEL_STRDEF entry of the USB_WHITE_LABEL struct (index 8)</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES_VALID</name>
                        <description>valid flag for USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES entry of the USB_WHITE_LABEL struct (index 7)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_SERIAL_NUMBER_STRDEF_VALID</name>
                        <description>valid flag for USB_DEVICE_SERIAL_NUMBER_STRDEF entry of the USB_WHITE_LABEL struct (index 6)</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_PRODUCT_STRDEF_VALID</name>
                        <description>valid flag for USB_DEVICE_PRODUCT_STRDEF entry of the USB_WHITE_LABEL struct (index 5)</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_MANUFACTURER_STRDEF_VALID</name>
                        <description>valid flag for USB_DEVICE_MANUFACTURER_STRDEF entry of the USB_WHITE_LABEL struct (index 4)</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_LANG_ID_VALUE_VALID</name>
                        <description>valid flag for USB_DEVICE_LANG_ID_VALUE entry of the USB_WHITE_LABEL struct (index 3)</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_SERIAL_NUMBER_VALUE_VALID</name>
                        <description>valid flag for USB_DEVICE_BCD_DEVICEVALUE entry of the USB_WHITE_LABEL struct (index 2)</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_PID_VALUE_VALID</name>
                        <description>valid flag for USB_DEVICE_PID_VALUE entry of the USB_WHITE_LABEL struct (index 1)</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WL_USB_DEVICE_VID_VALUE_VALID</name>
                        <description>valid flag for USB_DEVICE_VID_VALUE entry of the USB_WHITE_LABEL struct (index 0)</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USB_BOOT_FLAGS_R1</name>
                <addressOffset>0x00000168</addressOffset>
                <description>Redundant copy of USB_BOOT_FLAGS</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>USB_BOOT_FLAGS_R1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USB_BOOT_FLAGS_R2</name>
                <addressOffset>0x0000016c</addressOffset>
                <description>Redundant copy of USB_BOOT_FLAGS</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>USB_BOOT_FLAGS_R2</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USB_WHITE_LABEL_ADDR</name>
                <addressOffset>0x00000170</addressOffset>
                <description>Row index of the USB_WHITE_LABEL structure within OTP (ECC)

                    The table has 16 rows, each of which are also ECC and marked valid by the corresponding valid bit in USB_BOOT_FLAGS (ECC).

                    The entries are either _VALUEs where the 16 bit value is used as is, or _STRDEFs which acts as a pointers to a string value.

                    The value stored in a _STRDEF is two separate bytes: The low seven bits of the first (LSB) byte indicates the number of characters in the string, and the top bit of the first (LSB) byte if set to indicate that each character in the string is two bytes (Unicode) versus one byte if unset. The second (MSB) byte represents the location of the string data, and is encoded as the number of rows from this USB_WHITE_LABEL_ADDR; i.e. the row of the start of the string is USB_WHITE_LABEL_ADDR value + msb_byte.

