cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
            <register>
                <name>KEY1_VALID</name>
                <addressOffset>0x00003de4</addressOffset>
                <description>Valid flag for key 1. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_VALID</name>
                <addressOffset>0x00003de8</addressOffset>
                <description>Valid flag for key 2. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_VALID</name>
                <addressOffset>0x00003dec</addressOffset>
                <description>Valid flag for key 3. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_VALID</name>
                <addressOffset>0x00003df0</addressOffset>
                <description>Valid flag for key 4. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_VALID</name>
                <addressOffset>0x00003df4</addressOffset>
                <description>Valid flag for key 5. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_VALID</name>
                <addressOffset>0x00003df8</addressOffset>
                <description>Valid flag for key 6. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>63</dim>
                <dimIncrement>8</dimIncrement>
                <name>PAGE%s_LOCK0</name>
                <addressOffset>0x00003e00</addressOffset>
                <description>Lock configuration LSBs for page 0 (rows 0x0 through 0x3f). Locks are stored with 3-way majority vote encoding, so that bits can be set independently.

