cuu/YAHAL/include/MCU/rp2350/RP2350_regs.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TBMAN</name>
        <description>For managing simulation testbenches</description>
        <baseAddress>0x40160000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>4</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PLATFORM</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Indicates the type of platform in use</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>HDLSIM</name>
                        <description>Indicates the platform is a simulation</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPGA</name>
                        <description>Indicates the platform is an FPGA</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ASIC</name>
                        <description>Indicates the platform is an ASIC</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>USB_DPRAM</name>
        <description>DPRAM layout for USB device.</description>
        <baseAddress>0x50100000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>256</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>SETUP_PACKET_LOW</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Bytes 0-3 of the SETUP packet from the host.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WVALUE</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BREQUEST</name>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BMREQUESTTYPE</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SETUP_PACKET_HIGH</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Bytes 4-7 of the setup packet from the host.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WLENGTH</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WINDEX</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>30</dim>
                <dimIncrement>4</dimIncrement>
                <dimIndex>1_IN,1_OUT,2_IN,2_OUT,3_IN,3_OUT,4_IN,4_OUT,5_IN,5_OUT,6_IN,6_OUT,7_IN,7_OUT,8_IN,8_OUT,9_IN,9_OUT,10_IN,10_OUT,11_IN,11_OUT,12_IN,12_OUT,13_IN,13_OUT,14_IN,14_OUT,15_IN,15_OUT</dimIndex>
                <name>EP%s_CONTROL</name>
                <addressOffset>0x00000008</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <dim>32</dim>
                <dimIncrement>4</dimIncrement>
                <dimIndex>0_IN,0_OUT,1_IN,1_OUT,2_IN,2_OUT,3_IN,3_OUT,4_IN,4_OUT,5_IN,5_OUT,6_IN,6_OUT,7_IN,7_OUT,8_IN,8_OUT,9_IN,9_OUT,10_IN,10_OUT,11_IN,11_OUT,12_IN,12_OUT,13_IN,13_OUT,14_IN,14_OUT,15_IN,15_OUT</dimIndex>
                <name>EP%s_BUFFER_CONTROL</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1. 
                    Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FULL_1</name>
                        <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_1</name>
                        <description>Buffer 1 is the last buffer of the transfer.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_1</name>
                        <description>The data pid of buffer 1.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFER_ISO_OFFSET</name>
                        <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint. 
                            For a non Isochronous endpoint the offset is always 64 bytes.</description>
                        <bitRange>[28:27]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>128</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AVAILABLE_1</name>
                        <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_1</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[25:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FULL_0</name>
                        <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_0</name>
                        <description>Buffer 0 is the last buffer of the transfer.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_0</name>
                        <description>The data pid of buffer 0.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET</name>
                        <description>Reset the buffer selector to buffer 0.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Reply with a stall (valid for both buffers).</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVAILABLE_0</name>
                        <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_0</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[9:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    </peripherals>
</device>
